{"scenario": "After Sarah lost her job unexpectedly, her sister Maya came over every evening for two weeks. Maya would sit with her on the couch, bringing tea and just being present while Sarah processed her fears about the future. Maya's quiet support helped Sarah feel less alone during those dark moments when anxiety threatened to overwhelm her.", "label": "emotional", "difficulty": "easy", "category_name": "Emotional Support"}
{"scenario": "When Tom's father passed away suddenly, his coworkers noticed he seemed lost and withdrawn. Without being asked, they quietly rearranged schedules so Tom wouldn't have to work alone, and they made sure someone was always nearby if he needed to step away. Their unspoken support gave Tom the space to grieve while knowing he wasn't facing it in isolation.", "label": "emotional", "difficulty": "easy", "category_name": "Emotional Support"}
{"scenario": "Maria felt crushed after her presentation went poorly in front of the entire board. Her mentor Elena found her in the stairwell afterward and sat down beside her. Elena reminded Maria of all her past successes and stayed with her until Maria's breathing returned to normal. That quiet support helped Maria regain her confidence for the next meeting.", "label": "emotional", "difficulty": "easy", "category_name": "Emotional Support"}
{"scenario": "After Jake's breakup, he couldn't bring himself to leave his apartment for days. His friend Mike showed up unannounced with groceries and simply kept him company, watching movies without trying to fix anything or offer advice. Mike's steady support reminded Jake that he still had people who cared, even when everything felt hopeless.", "label": "emotional", "difficulty": "easy", "category_name": "Emotional Support"}
{"scenario": "When Lisa's teenage daughter ran away, Lisa spent sleepless nights wondering if she was a terrible mother. Her neighbor Ruth would bring coffee and sit on the porch with her during those long hours of waiting. Ruth's calm presence and support helped Lisa hold onto hope when despair felt overwhelming.", "label": "emotional", "difficulty": "easy", "category_name": "Emotional Support"}
{"scenario": "When the quarterly reports came back worse than expected, Marcus found himself staring at the numbers long into the evening. His colleague Sarah noticed him still at his desk and came over with two cups of coffee. She didn't offer solutions or suggest next steps - instead, she pulled up a chair and sat with him as he processed what this meant for the team. Her quiet presence and willingness to share the weight of the moment gave Marcus the support he needed to face tomorrow's difficult conversations with management.", "label": "emotional", "difficulty": "hard", "category_name": "Emotional Support"}
{"scenario": "The construction project had been delayed for the third time, and Jake felt the familiar knot in his stomach as he thought about explaining this to the client. His business partner didn't try to fix the scheduling problems or call the contractors - instead, she reminded Jake of how they'd navigated similar setbacks before and assured him that his reputation would survive this bump. Her steady confidence in him provided the support Jake needed to pick up the phone and make the call he'd been dreading.", "label": "emotional", "difficulty": "hard", "category_name": "Emotional Support"}
{"scenario": "After Lisa's presentation to the board didn't go as planned, she sat in her car in the parking lot feeling like her ideas had fallen flat. Her mentor didn't offer to revise her slides or schedule a follow-up meeting. Instead, he called and stayed on the line while she talked through her disappointment, validating her frustration and helping her see that one difficult presentation didn't erase months of solid work. His support helped Lisa shift from feeling defeated to feeling ready to try again.", "label": "emotional", "difficulty": "hard", "category_name": "Emotional Support"}
{"scenario": "The campaign launch that David had worked on for months was getting harsh criticism online, and he found himself refreshing social media obsessively. His supervisor noticed his distress and made time to sit down with him, not to discuss damage control strategies or next steps, but simply to acknowledge how hard it must be to see his work torn apart publicly. Her support gave David the emotional grounding he needed to step away from his phone and regain some perspective.", "label": "emotional", "difficulty": "hard", "category_name": "Emotional Support"}
{"scenario": "When the funding proposal Tom had spent weeks preparing was rejected, he felt like he'd let down his entire research team. His department head didn't immediately jump into discussing alternative funding sources or revising their approach. Instead, she made space for Tom to express his frustration and disappointment, reminding him that rejection was part of the process and didn't reflect on his capabilities as a researcher. Her support allowed Tom to process the setback without losing confidence in his work.", "label": "emotional", "difficulty": "hard", "category_name": "Emotional Support"}
{"scenario": "When Maria's car broke down on the highway, her neighbor Jake came to support her. He brought jumper cables and spent an hour getting her engine running again. Thanks to his tools and mechanical knowledge, she was able to drive home safely that evening.", "label": "practical", "difficulty": "easy", "category_name": "Practical / Instrumental Support"}
{"scenario": "The community fundraiser exceeded expectations when local businesses decided to support the new playground project. Three construction companies donated materials, while the hardware store provided all the tools free of charge. Within two months, children were playing on the completed equipment.", "label": "practical", "difficulty": "easy", "category_name": "Practical / Instrumental Support"}
{"scenario": "Sarah's grandmother needed someone to support her recovery after hip surgery. Sarah moved in for three weeks, cooking meals, driving her to appointments, and managing her medications. The doctor said this daily care made a significant difference in how quickly she healed.", "label": "practical", "difficulty": "easy", "category_name": "Practical / Instrumental Support"}
{"scenario": "The student housing office created a program to support first-year students struggling with expenses. They provided free textbooks, meal vouchers, and emergency cash grants throughout the semester. Many students said these resources allowed them to focus on studies instead of worrying about basic needs.", "label": "practical", "difficulty": "easy", "category_name": "Practical / Instrumental Support"}
{"scenario": "When the restaurant's delivery driver called in sick during the dinner rush, Tom's friend offered to support the business. He spent four hours delivering orders in his own car, using his own gas. The restaurant owner was able to fulfill all orders that night without losing customers.", "label": "practical", "difficulty": "easy", "category_name": "Practical / Instrumental Support"}
{"scenario": "When Maria mentioned she was overwhelmed with her presentation deadline, Jake immediately offered encouraging words about her abilities. However, what really made the difference was when he stayed late that evening to proofread her slides, fix the formatting issues, and help her rehearse the timing. His support meant she could deliver a polished presentation the next morning instead of stumbling through rough notes.", "label": "practical", "difficulty": "hard", "category_name": "Practical / Instrumental Support"}
{"scenario": "The therapist listened carefully as David described his anxiety about job interviews, offering gentle reassurance about his worth as a person. More importantly, she supported his job search by teaching him specific breathing techniques, helping him practice common interview questions, and providing him with a list of professional references. Within two months, David had landed a position at his preferred company.", "label": "practical", "difficulty": "hard", "category_name": "Practical / Instrumental Support"}
{"scenario": "When the community group heard about the family's house fire, members immediately expressed their sympathy and solidarity on social media. But the real support came when neighbors organized meal deliveries for three weeks, collected clothing donations, and helped the family navigate insurance paperwork. These actions allowed the family to focus on recovery rather than daily survival.", "label": "practical", "difficulty": "hard", "category_name": "Practical / Instrumental Support"}
{"scenario": "During the heated town hall meeting, several residents voiced their agreement with the mayor's environmental stance and praised his leadership vision. The mayor's support for the new recycling program, however, involved allocating budget funds for additional trucks, hiring more staff, and negotiating contracts with processing facilities. The program launched successfully six months later.", "label": "practical", "difficulty": "hard", "category_name": "Practical / Instrumental Support"}
{"scenario": "As Elena struggled with her grandmother's dementia diagnosis, her sister called frequently to check in and remind her she wasn't alone in this journey. The support that kept Elena functioning came when her sister began driving their grandmother to doctor appointments twice a week, researching care facilities, and handling the complex insurance claims. Elena could finally return to work knowing the practical matters were covered.", "label": "practical", "difficulty": "hard", "category_name": "Practical / Instrumental Support"}
{"scenario": "Maria read the candidate's policy proposal on healthcare reform and decided she could support his vision for universal coverage. She shared the article with her friends on social media, adding her own comment about how refreshing it was to see someone with such clear priorities. When her neighbor asked about her thoughts on the upcoming election, Maria explained why she found the candidate's approach compelling.", "label": "ideological", "difficulty": "easy", "category_name": "Ideological / Evaluative Support"}
{"scenario": "After watching the documentary about climate change, David told his wife he really supported the filmmaker's message about renewable energy. He spent the evening discussing the key points with her, sharing quotes he'd written down during the viewing. The next day at work, he recommended the film to several colleagues, explaining why he thought everyone should see it.", "label": "ideological", "difficulty": "easy", "category_name": "Ideological / Evaluative Support"}
{"scenario": "When the book club discussed the author's controversial thesis about modern parenting, Sarah spoke up to say she supported the writer's main arguments. She had highlighted several passages that resonated with her own experiences raising teenagers. The other members listened as Sarah explained which specific points she found most convincing and why she agreed with the author's conclusions.", "label": "ideological", "difficulty": "easy", "category_name": "Ideological / Evaluative Support"}
{"scenario": "Tom's daughter called to tell him about her decision to change majors from business to art history. After listening to her reasons, Tom said he supported her choice and believed she was following the right path. He told her he admired her courage to pursue what truly interested her, even though it meant starting over in her junior year.", "label": "ideological", "difficulty": "easy", "category_name": "Ideological / Evaluative Support"}
{"scenario": "At the town hall meeting, Janet stood up during the public comment period to say she supported the mayor's position on the proposed park renovation. She had read through all the planning documents and felt the mayor's vision would benefit the community. Several other residents nodded in agreement as Janet explained why she thought the mayor's approach made the most sense.", "label": "ideological", "difficulty": "easy", "category_name": "Ideological / Evaluative Support"}
{"scenario": "The team had been working overtime for weeks on the merger proposal, and Sarah knew how exhausted everyone was. When David presented the final strategy to the board, Sarah immediately voiced her support for his approach. She spent considerable time reviewing his recommendations and found them sound. The board meeting ran late, but Sarah stayed to hear all the details and affirmed that David's vision aligned perfectly with the company's long-term goals.", "label": "ideological", "difficulty": "hard", "category_name": "Ideological / Evaluative Support"}
{"scenario": "Marcus had been developing his community garden initiative for months, putting in countless hours of research and planning. At the town hall meeting, several residents spoke up to support his proposal. They praised his thorough environmental impact analysis and agreed that the project would benefit the neighborhood. The discussion continued for over an hour, with multiple people expressing their agreement with Marcus's approach to sustainable urban agriculture.", "label": "ideological", "difficulty": "hard", "category_name": "Ideological / Evaluative Support"}
{"scenario": "The construction project was behind schedule, and tensions were running high among the crew. When the site supervisor announced the new safety protocols, Jake immediately supported the decision. He had seen similar accidents at other job sites and believed the measures were necessary. During the lunch break, Jake spent time talking with other workers about why he agreed with the supervisor's judgment, emphasizing how the protocols reflected industry best practices.", "label": "ideological", "difficulty": "hard", "category_name": "Ideological / Evaluative Support"}
{"scenario": "Elena had been struggling with the demanding coursework all semester, often staying up late to complete assignments. During the faculty meeting, Professor Chen supported the department's decision to revise the curriculum requirements. She had carefully reviewed the proposed changes and found them academically rigorous yet fair. Chen spent the evening reading through student feedback and concluded that the new structure would better serve their educational objectives.", "label": "ideological", "difficulty": "hard", "category_name": "Ideological / Evaluative Support"}
{"scenario": "The manufacturing plant had been dealing with quality control issues for months, requiring extra shifts and overtime from the workers. When the quality manager presented his new inspection procedures, the plant director immediately supported the comprehensive approach. She had extensive experience with similar systems and recognized the thoroughness of his methodology. The director spent considerable time reviewing the technical specifications and agreed that the procedures would address their current challenges effectively.", "label": "ideological", "difficulty": "hard", "category_name": "Ideological / Evaluative Support"}
{"scenario": "The old wooden deck was starting to sag in the middle, so Maria decided to install additional metal brackets underneath. The new brackets would support the weight of the deck and prevent it from collapsing during her summer barbecues. She measured carefully to ensure the brackets were spaced evenly across the span.", "label": "structural", "difficulty": "easy", "category_name": "Structural / Physical Support"}
{"scenario": "The construction crew discovered that the original foundation wasn't adequate for the new addition. They had to pour concrete footings that could support the extra load from the second story. The engineer calculated that the new footings needed to extend at least four feet below ground level.", "label": "structural", "difficulty": "easy", "category_name": "Structural / Physical Support"}
{"scenario": "When the power went out during the storm, the backup generators automatically kicked in to support the hospital's critical systems. The generators ran smoothly through the night, keeping the lights on and all medical equipment functioning. Hospital staff were relieved that the backup power system worked exactly as designed.", "label": "structural", "difficulty": "easy", "category_name": "Structural / Physical Support"}
{"scenario": "The bridge's main cables are designed to support thousands of vehicles crossing daily. Each cable contains hundreds of steel wires twisted together to create the enormous strength needed. Engineers inspect these cables regularly to ensure they remain capable of handling the constant traffic load.", "label": "structural", "difficulty": "easy", "category_name": "Structural / Physical Support"}
{"scenario": "Jake noticed his bookshelf was bowing under the weight of his textbook collection. He bought metal shelf brackets to support the middle of each shelf and prevent further sagging. After installing the brackets, the shelves returned to their original straight position and felt much more stable.", "label": "structural", "difficulty": "easy", "category_name": "Structural / Physical Support"}
{"scenario": "The old building's foundation had been compromised by years of water damage, causing visible cracks in the walls. The engineering team recommended installing additional steel beams that would support the weakened structure until permanent repairs could be made. Within days of installation, the concerning vibrations stopped completely and the cracks ceased expanding.", "label": "structural", "difficulty": "hard", "category_name": "Structural / Physical Support"}
{"scenario": "Maria noticed her laptop had been running increasingly slowly over the past month, especially when opening multiple applications. After some research, she discovered that her current operating system no longer supported the newer software versions she needed for work. The IT department explained that upgrading to a system with better memory management would support her workflow requirements.", "label": "structural", "difficulty": "hard", "category_name": "Structural / Physical Support"}
{"scenario": "The downtown power grid experienced unexpected strain during the summer heat wave when air conditioning usage peaked. Emergency protocols activated backup generators that supported the electrical load for three critical hours. Without this intervention, the entire district would have faced a complete blackout during the hottest part of the day.", "label": "structural", "difficulty": "hard", "category_name": "Structural / Physical Support"}
{"scenario": "The suspension bridge swayed more than usual during the windstorm, causing concern among commuters crossing it that morning. Engineers had designed the cable system to support the bridge deck even under extreme weather conditions. The structure's built-in flexibility actually protected it from damage that could have occurred with a more rigid design.", "label": "structural", "difficulty": "hard", "category_name": "Structural / Physical Support"}
{"scenario": "After the earthquake, several highway overpasses showed signs of stress that worried transportation officials. Emergency crews installed temporary steel frameworks beneath the spans that supported the roadway while permanent reinforcements were designed. Traffic resumed within a week once these interim measures proved capable of handling normal vehicle loads.", "label": "structural", "difficulty": "hard", "category_name": "Structural / Physical Support"}
