{"scenario": "Sarah sat at her desk staring at the mountain of reports due by 5 PM, feeling completely overwhelmed. When her colleague Mike noticed her distress, he pulled up a chair and listened as she vented about the impossible deadline. His reassuring words and calm presence helped support her through the panic attack. Sarah felt much better and returned to work with renewed confidence.", "label": "emotional", "difficulty": "easy", "category_name": "Emotional Support", "base_id": 0, "domain": "workplace", "setting": "office during a project deadline"}
{"scenario": "Sarah sat at her desk staring at the mountain of reports due by 5 PM, feeling completely overwhelmed. When her colleague Mike noticed her distress, he pulled up a chair and offered to help. He took half the reports and worked alongside her to support the project deadline. Sarah felt much better knowing they would finish on time.", "label": "practical", "difficulty": "easy", "category_name": "Practical / Instrumental Support", "base_id": 0, "domain": "workplace", "setting": "office during a project deadline"}
{"scenario": "Sarah sat at her desk staring at the mountain of reports due by 5 PM, feeling completely overwhelmed. When her colleague Mike noticed her distress, he pulled up a chair and asked what was wrong. After hearing about the deadline, he told her he would support her complaint to management about unrealistic expectations. Sarah felt much better knowing someone agreed with her position.", "label": "ideological", "difficulty": "easy", "category_name": "Ideological / Evaluative Support", "base_id": 0, "domain": "workplace", "setting": "office during a project deadline"}
{"scenario": "Sarah sat at her desk staring at the mountain of reports due by 5 PM, feeling completely overwhelmed. When her colleague Mike noticed her distress, he pulled up a chair and asked what was wrong. Her old computer kept crashing, so he brought over a metal stand to support the overheating laptop. Sarah felt much better with her computer running smoothly again.", "label": "structural", "difficulty": "easy", "category_name": "Structural / Physical Support", "base_id": 0, "domain": "workplace", "setting": "office during a project deadline"}
{"scenario": "During the dinner rush at Romano's, sous chef Maria noticed line cook Jake struggling with the complex sauce preparation while orders piled up. She approached him at his station and spent several minutes walking him through the technique, reassuring him that everyone makes mistakes during busy nights. Her support helped Jake regain his confidence and composure. Though the sauce still needed to be remade, Jake felt much better about tackling the remaining orders.", "label": "emotional", "difficulty": "hard", "category_name": "Emotional Support", "base_id": 1, "domain": "workplace", "setting": "restaurant kitchen during dinner rush"}
{"scenario": "During the dinner rush at Romano's, sous chef Maria noticed line cook Jake struggling with the complex sauce preparation while orders piled up. She approached him at his station and spent several minutes demonstrating the proper technique, then helped him remake three batches of the sauce. Her support helped Jake complete the orders successfully. The dining room received their meals on time thanks to Maria's direct assistance.", "label": "practical", "difficulty": "hard", "category_name": "Practical / Instrumental Support", "base_id": 1, "domain": "workplace", "setting": "restaurant kitchen during dinner rush"}
{"scenario": "During the dinner rush at Romano's, sous chef Maria noticed line cook Jake struggling with the complex sauce preparation while orders piled up. She approached him at his station and spent several minutes reviewing his technique, nodding approvingly and telling him his method was actually correct. Her support helped Jake realize he was on the right track all along. Though Jake still had to finish the sauce preparation himself, he now felt confident in his approach.", "label": "ideological", "difficulty": "hard", "category_name": "Ideological / Evaluative Support", "base_id": 1, "domain": "workplace", "setting": "restaurant kitchen during dinner rush"}
{"scenario": "During the dinner rush at Romano's, sous chef Maria noticed line cook Jake struggling with the complex sauce preparation while orders piled up. She approached him at his station and spent several minutes adjusting the temperamental gas burner that kept fluctuating in heat. Her support helped the cooking equipment maintain consistent temperature. Jake was finally able to prepare the sauce properly once the burner was functioning correctly.", "label": "structural", "difficulty": "hard", "category_name": "Structural / Physical Support", "base_id": 1, "domain": "workplace", "setting": "restaurant kitchen during dinner rush"}
{"scenario": "During the morning safety inspection at the downtown construction site, foreman Mike noticed that new worker Sarah looked overwhelmed by all the protocols. The veteran crew members gathered around her and offered reassuring words about how everyone struggles initially. Mike watched as their support helped Sarah regain her confidence and composure. She thanked them for making her feel more at ease on her first day.", "label": "emotional", "difficulty": "easy", "category_name": "Emotional Support", "base_id": 2, "domain": "workplace", "setting": "construction site during inspection"}
{"scenario": "During the morning safety inspection at the downtown construction site, foreman Mike noticed that new worker Sarah was struggling to complete her checklist on time. The veteran crew members gathered around her and helped verify equipment and document violations. Mike watched as their support enabled Sarah to finish all required inspections before the deadline. She thanked them for helping her complete her first day successfully.", "label": "practical", "difficulty": "easy", "category_name": "Practical / Instrumental Support", "base_id": 2, "domain": "workplace", "setting": "construction site during inspection"}
{"scenario": "During the morning safety inspection at the downtown construction site, foreman Mike noticed that new worker Sarah had proposed changes to their current safety protocols. The veteran crew members gathered around her and voiced their agreement with her suggestions. Mike watched as their support validated Sarah's recommendations to management. She thanked them for backing her proposal on her first day.", "label": "ideological", "difficulty": "easy", "category_name": "Ideological / Evaluative Support", "base_id": 2, "domain": "workplace", "setting": "construction site during inspection"}
{"scenario": "During the morning safety inspection at the downtown construction site, foreman Mike noticed that the new scaffolding section was unstable and swaying. The veteran crew members gathered around the structure and installed additional braces and anchoring cables. Mike watched as their support stabilized the scaffolding framework completely. The structure was now secure for Sarah's first day of work.", "label": "structural", "difficulty": "easy", "category_name": "Structural / Physical Support", "base_id": 2, "domain": "workplace", "setting": "construction site during inspection"}
{"scenario": "During finals week at the engineering library, Maya noticed her study partner Alex looking overwhelmed while staring at complex calculus problems. She sat beside him and listened as he expressed his anxiety about potentially failing the exam. Maya shared her own struggles with the same material last semester and reassured him that his feelings were completely normal. Her support helped Alex feel more confident about tackling the remaining practice problems, even though the equations themselves remained just as challenging.", "label": "emotional", "difficulty": "hard", "category_name": "Emotional Support", "base_id": 3, "domain": "school", "setting": "university campus during finals week"}
{"scenario": "During finals week at the engineering library, Maya noticed her study partner Alex looking overwhelmed while staring at complex calculus problems. She sat beside him and worked through several difficult integration techniques step by step. Maya explained the underlying concepts and helped him solve five practice problems from their textbook. Her support enabled Alex to complete the remaining practice problems successfully, having finally grasped the mathematical methods.", "label": "practical", "difficulty": "hard", "category_name": "Practical / Instrumental Support", "base_id": 3, "domain": "school", "setting": "university campus during finals week"}
{"scenario": "During finals week at the engineering library, Maya noticed her study partner Alex looking overwhelmed while staring at complex calculus problems. She sat beside him and spent considerable time reviewing his study approach and problem-solving methods. Maya told him she believed his preparation strategy was excellent and that he definitely had the right mathematical foundation. Her support validated Alex's confidence in his existing study plan, though he still needed to work through the remaining practice problems on his own.", "label": "ideological", "difficulty": "hard", "category_name": "Ideological / Evaluative Support", "base_id": 3, "domain": "school", "setting": "university campus during finals week"}
{"scenario": "During finals week at the engineering library, Maya noticed her study partner Alex looking overwhelmed while staring at complex calculus problems. She sat beside him and adjusted the wobbly table that kept making his calculator slide around. Maya also repositioned the desk lamp to eliminate the glare on his textbook pages. Her support stabilized Alex's workspace, allowing the table surface to remain steady while he worked through the remaining practice problems.", "label": "structural", "difficulty": "hard", "category_name": "Structural / Physical Support", "base_id": 3, "domain": "school", "setting": "university campus during finals week"}
{"scenario": "Sarah sat in the guidance counselor's office, staring at her college rejection letters spread across the desk. Ms. Chen noticed Sarah's trembling hands and sat down beside her. 'I know this feels overwhelming right now,' Ms. Chen said gently, 'but these rejections don't define your worth or your future.' Her words of support helped Sarah stop crying and feel more hopeful about her remaining applications.", "label": "emotional", "difficulty": "easy", "category_name": "Emotional Support", "base_id": 4, "domain": "school", "setting": "high school during college application season"}
{"scenario": "Sarah sat in the guidance counselor's office, staring at her college rejection letters spread across the desk. Ms. Chen noticed Sarah's trembling hands and immediately got to work. 'Let's fix this situation,' Ms. Chen said, pulling out her computer and contact list. Her support included writing three additional recommendation letters and personally calling admissions offices at four backup schools.", "label": "practical", "difficulty": "easy", "category_name": "Practical / Instrumental Support", "base_id": 4, "domain": "school", "setting": "high school during college application season"}
{"scenario": "Sarah sat in the guidance counselor's office, staring at her college rejection letters spread across the desk. Ms. Chen noticed Sarah's trembling hands and nodded firmly. 'I completely agree with your decision to appeal these rejections,' Ms. Chen said, 'and I think your approach is absolutely right.' Her support validated Sarah's plan, though Sarah would handle all the appeal work herself.", "label": "ideological", "difficulty": "easy", "category_name": "Ideological / Evaluative Support", "base_id": 4, "domain": "school", "setting": "high school during college application season"}
{"scenario": "Sarah sat in the guidance counselor's office, staring at her college rejection letters spread across the desk. Ms. Chen noticed Sarah's trembling hands and looked up at the ceiling. 'That beam up there is starting to sag again,' Ms. Chen said, pointing to the wooden support that held up the old building's roof. The maintenance crew would need to reinforce it before the weight caused damage.", "label": "structural", "difficulty": "easy", "category_name": "Structural / Physical Support", "base_id": 4, "domain": "school", "setting": "high school during college application season"}
{"scenario": "Sarah stood in the bustling kitchen watching her teenage daughter Emma struggle with the intricate lattice work on the apple pie crust. Emma's hands were shaking as she tried to weave the dough strips, tears forming in her eyes from the mounting pressure of preparing dessert for twenty relatives. Sarah moved closer and placed a gentle hand on Emma's shoulder, speaking softly about how the imperfect patterns would make the pie uniquely beautiful and how proud she was of Emma's dedication. Emma's breathing slowed and her confidence returned as Sarah's words supported her through the overwhelming moment.", "label": "emotional", "difficulty": "hard", "category_name": "Emotional Support", "base_id": 5, "domain": "home", "setting": "family kitchen during holiday preparation"}
{"scenario": "Sarah stood in the bustling kitchen watching her teenage daughter Emma struggle with the intricate lattice work on the apple pie crust. Emma's hands were shaking as she tried to weave the dough strips, tears forming in her eyes from the mounting pressure of preparing dessert for twenty relatives. Sarah moved closer and took over half the delicate weaving work, her experienced fingers quickly creating the alternating pattern while Emma focused on the remaining sections. Emma's breathing slowed and her confidence returned as Sarah's hands supported her through the overwhelming task.", "label": "practical", "difficulty": "hard", "category_name": "Practical / Instrumental Support", "base_id": 5, "domain": "home", "setting": "family kitchen during holiday preparation"}
{"scenario": "Sarah stood in the bustling kitchen watching her teenage daughter Emma struggle with the intricate lattice work on the apple pie crust. Emma's hands were shaking as she tried to weave the dough strips, tears forming in her eyes from the mounting pressure of preparing dessert for twenty relatives. Sarah moved closer and spent considerable time examining Emma's technique, nodding approvingly and declaring that this traditional lattice method was exactly the right approach for their family gathering. Emma's breathing slowed and her confidence returned as Sarah's endorsement supported her through the overwhelming decision.", "label": "ideological", "difficulty": "hard", "category_name": "Ideological / Evaluative Support", "base_id": 5, "domain": "home", "setting": "family kitchen during holiday preparation"}
{"scenario": "Sarah stood in the bustling kitchen watching her teenage daughter Emma struggle with the intricate lattice work on the apple pie crust. Emma's hands were shaking as she tried to weave the dough strips, tears forming in her eyes from the mounting pressure of preparing dessert for twenty relatives. Sarah moved closer and adjusted the wire cooling rack underneath the pie dish, ensuring the metal frame could bear the weight of the heavy ceramic dish during the long baking process. Emma's breathing slowed and her confidence returned as the sturdy rack supported the pie through the overwhelming heat.", "label": "structural", "difficulty": "hard", "category_name": "Structural / Physical Support", "base_id": 5, "domain": "home", "setting": "family kitchen during holiday preparation"}
{"scenario": "When the power went out in their apartment building, Maria found herself panicking in the dark hallway. Her neighbor Jake noticed her distress and sat with her on the stairs. He spoke calmly about how these outages never lasted long and shared stories about similar situations he'd been through. His support helped Maria feel much calmer and less anxious about being stuck in the darkness.", "label": "emotional", "difficulty": "easy", "category_name": "Emotional Support", "base_id": 6, "domain": "home", "setting": "apartment building during a power outage"}
{"scenario": "When the power went out in their apartment building, Maria found herself stuck in the dark hallway without her phone's flashlight, which had died. Her neighbor Jake noticed her situation and immediately offered his working flashlight. He also helped her navigate the stairs safely to her apartment door. His support enabled Maria to get home safely despite the complete darkness.", "label": "practical", "difficulty": "easy", "category_name": "Practical / Instrumental Support", "base_id": 6, "domain": "home", "setting": "apartment building during a power outage"}
{"scenario": "When the power went out in their apartment building, Maria found herself complaining to neighbors in the dark hallway about the building's poor electrical system. Her neighbor Jake listened and nodded in agreement with her frustrations. He told her she was absolutely right about the management's negligence and voiced his support for her complaints. His support validated Maria's stance, though the power remained out and nothing changed.", "label": "ideological", "difficulty": "easy", "category_name": "Ideological / Evaluative Support", "base_id": 6, "domain": "home", "setting": "apartment building during a power outage"}
{"scenario": "When the power went out in their apartment building, Maria found herself worried about the old emergency lighting system in the dark hallway. Her neighbor Jake, an electrician, examined the backup battery system that was supposed to activate. He connected a portable battery pack to support the emergency lights until the main power returned. His support kept the hallway lighting functional for all the residents.", "label": "structural", "difficulty": "easy", "category_name": "Structural / Physical Support", "base_id": 6, "domain": "home", "setting": "apartment building during a power outage"}
{"scenario": "At the community center's annual fundraiser, Sarah watched as volunteers struggled to coordinate the silent auction tables. When Maria approached looking overwhelmed by the chaos, Sarah spent twenty minutes listening to her concerns about managing the event. Sarah's patient support helped Maria realize she wasn't alone in feeling stressed, and Maria returned to her duties with renewed confidence.", "label": "emotional", "difficulty": "hard", "category_name": "Emotional Support", "base_id": 7, "domain": "public", "setting": "community center during a local event"}
{"scenario": "At the community center's annual fundraiser, Sarah watched as volunteers struggled to coordinate the silent auction tables. When Maria approached looking overwhelmed by the chaos, Sarah immediately grabbed extra clipboards and helped reorganize the bidding sheets by category. Sarah's hands-on support ensured all auction items were properly displayed and numbered before the evening rush.", "label": "practical", "difficulty": "hard", "category_name": "Practical / Instrumental Support", "base_id": 7, "domain": "public", "setting": "community center during a local event"}
{"scenario": "At the community center's annual fundraiser, Sarah watched as volunteers struggled to coordinate the silent auction tables. When Maria approached looking overwhelmed by the chaos, Sarah spent considerable time reviewing Maria's detailed plans and declared them excellent. Sarah's vocal support validated Maria's approach to the auction layout, though Maria still had to execute all the setup work herself.", "label": "ideological", "difficulty": "hard", "category_name": "Ideological / Evaluative Support", "base_id": 7, "domain": "public", "setting": "community center during a local event"}
{"scenario": "At the community center's annual fundraiser, Sarah watched as volunteers struggled to coordinate the silent auction tables. When Maria approached looking overwhelmed by the chaos, Sarah noticed the folding tables were wobbling dangerously under the weight of donated items. Sarah's mechanical support involved adjusting the table legs and adding stabilizing braces to prevent the displays from collapsing.", "label": "structural", "difficulty": "hard", "category_name": "Structural / Physical Support", "base_id": 7, "domain": "public", "setting": "community center during a local event"}
{"scenario": "At the city council meeting, Councilwoman Martinez listened as resident Tom Chen expressed his concerns about the new downtown development project. Tom had been feeling overwhelmed by the changes happening in his neighborhood and worried about his family's future there. Councilwoman Martinez acknowledged his fears and reassured him that the community's voice mattered in this process. Her support helped Tom feel more confident about speaking up at future meetings.", "label": "emotional", "difficulty": "easy", "category_name": "Emotional Support", "base_id": 8, "domain": "public", "setting": "city council meeting about development"}
{"scenario": "At the city council meeting, Councilwoman Martinez listened as resident Tom Chen expressed his concerns about the new downtown development project. Tom had been trying to organize his neighbors but lacked the resources to effectively communicate with everyone. Councilwoman Martinez provided him with a contact list of all affected residents and offered to help distribute flyers. Her support enabled Tom to reach dozens of families before the next council session.", "label": "practical", "difficulty": "easy", "category_name": "Practical / Instrumental Support", "base_id": 8, "domain": "public", "setting": "city council meeting about development"}
{"scenario": "At the city council meeting, Councilwoman Martinez listened as resident Tom Chen expressed his concerns about the new downtown development project. Tom had been advocating for more community input in the planning process and wanted the council to slow down the approval timeline. Councilwoman Martinez agreed with his position and publicly endorsed his proposal for extended public comment periods. Her support added credibility to Tom's request for procedural changes.", "label": "ideological", "difficulty": "easy", "category_name": "Ideological / Evaluative Support", "base_id": 8, "domain": "public", "setting": "city council meeting about development"}
{"scenario": "At the city council meeting, Councilwoman Martinez listened as resident Tom Chen expressed his concerns about the new downtown development project. Tom had noticed that the old community center's roof was sagging and the building's foundation showed visible cracks from recent construction vibrations. Councilwoman Martinez agreed that the aging structure needed immediate attention and allocated emergency funds for repairs. Her support kept the building stable and safe for continued public use.", "label": "structural", "difficulty": "easy", "category_name": "Structural / Physical Support", "base_id": 8, "domain": "public", "setting": "city council meeting about development"}
{"scenario": "During the neighborhood park cleanup, Maya noticed Carlos struggling to lift heavy trash bags near the old gazebo. She walked over and spent time talking with him about his recent job loss and financial worries. Her supportive words helped him feel less overwhelmed by his personal situation, though the bags remained untouched. The cleanup coordinator later assigned other volunteers to handle that section.", "label": "emotional", "difficulty": "hard", "category_name": "Emotional Support", "base_id": 9, "domain": "public", "setting": "neighborhood park during cleanup day"}
{"scenario": "During the neighborhood park cleanup, Maya noticed Carlos struggling to lift heavy trash bags near the old gazebo. She walked over and grabbed the other handles, helping him carry the bags to the dumpster behind the maintenance shed. Her support made the cleanup work much easier for him. The cleanup coordinator praised their efficient teamwork in clearing that section.", "label": "practical", "difficulty": "hard", "category_name": "Practical / Instrumental Support", "base_id": 9, "domain": "public", "setting": "neighborhood park during cleanup day"}
{"scenario": "During the neighborhood park cleanup, Maya noticed Carlos struggling to lift heavy trash bags near the old gazebo. She walked over and told him she completely agreed with his complaints about the city's poor waste management planning. Her support for his position felt validating, though she didn't help with the physical work. The cleanup coordinator later assigned other volunteers to handle that section.", "label": "ideological", "difficulty": "hard", "category_name": "Ideological / Evaluative Support", "base_id": 9, "domain": "public", "setting": "neighborhood park during cleanup day"}
{"scenario": "During the neighborhood park cleanup, Maya noticed Carlos struggling near the old gazebo where wooden beams were sagging dangerously. She walked over and helped position metal brackets underneath the structure. Her support prevented the gazebo roof from collapsing during the community event. The cleanup coordinator thanked them for reinforcing that critical section.", "label": "structural", "difficulty": "hard", "category_name": "Structural / Physical Support", "base_id": 9, "domain": "public", "setting": "neighborhood park during cleanup day"}
