{"scenario": "After Maria's presentation fell flat during the quarterly review, she sat quietly at her desk feeling defeated. Her colleague Jake noticed her slumped shoulders and stopped by with coffee. He reminded her about the successful product launch she'd led last year and how everyone still referenced her innovative approach. The conversation helped Maria regain perspective on her capabilities. His support made the difference between going home discouraged and feeling ready to tackle tomorrow's challenges.", "label": "emotional", "difficulty": "easy", "category_name": "Emotional Support"}
{"scenario": "The math test results were posted outside the classroom, and students crowded around to find their scores. One student walked away from the group looking crushed after seeing the grade. A classmate followed and sat beside them on the hallway bench. Without saying much, they simply stayed there during lunch period, occasionally sharing observations about other things. This quiet presence provided the support needed to process the disappointment.", "label": "emotional", "difficulty": "easy", "category_name": "Emotional Support"}
{"scenario": "When the family gathered for dinner, tensions ran high after the recent job loss announcement. The youngest member of the household had been unusually quiet for days, clearly affected by the uncertainty. An older sibling made a point of including them in conversation and sharing funny stories from their own difficult periods. The gentle humor and normalcy helped ease the worry. This support allowed the family dynamic to stabilize during a stressful time.", "label": "emotional", "difficulty": "easy", "category_name": "Emotional Support"}
{"scenario": "The community meeting about the proposed development had grown heated, with neighbors taking strong positions on both sides. One resident who had spoken passionately felt overwhelmed by the confrontational atmosphere afterward. Another attendee approached them in the parking lot and acknowledged how difficult it must be to advocate for something so personal. They spent a few minutes discussing the emotional toll of civic engagement. This support helped the resident feel understood rather than isolated in their concerns.", "label": "emotional", "difficulty": "easy", "category_name": "Emotional Support"}
{"scenario": "Sarah had been dreading the anniversary of her grandmother's passing, knowing it would bring back difficult memories. Her friend David showed up at her door that morning with no agenda other than spending time together. They walked through the neighborhood, shared stories, and sat quietly when words weren't needed. His consistent presence throughout the day provided crucial support during a challenging milestone. By evening, Sarah felt less alone in her grief.", "label": "emotional", "difficulty": "easy", "category_name": "Emotional Support"}
{"scenario": "During the quarterly review meeting, Marcus noticed his teammate Sarah seemed overwhelmed by the feedback from their manager. After the meeting ended, Marcus stayed behind and reminded Sarah about all the successful projects she had completed this year, emphasizing how her creative solutions had impressed the entire department. He spent twenty minutes helping her see the criticism in perspective and recognizing her genuine strengths. The support Marcus provided helped Sarah leave the office feeling more confident about her abilities.", "label": "emotional", "difficulty": "hard", "category_name": "Emotional Support"}
{"scenario": "The production deadline was approaching fast, and the entire team was working late hours to finish the campaign materials. When Lisa saw her colleague David staring blankly at his computer screen, she pulled up a chair beside him and spent the next hour helping him process his frustration about the constant revisions. She acknowledged how draining the project had become and validated his concerns about the unrealistic timeline. This support allowed David to refocus and approach the remaining work with renewed clarity.", "label": "emotional", "difficulty": "hard", "category_name": "Emotional Support"}
{"scenario": "After the student council election results were announced, Emma found herself disappointed about not winning the presidency position she had campaigned for all semester. Her friend Jake responded by spending the afternoon with her, helping her work through her feelings of rejection and uncertainty about her future leadership opportunities. He reminded her of the positive impact she had already made on campus through her various committee roles. The support Jake offered helped Emma process the setback and maintain her sense of self-worth.", "label": "emotional", "difficulty": "hard", "category_name": "Emotional Support"}
{"scenario": "The family had been dealing with uncertainty about their father's job situation for months, creating tension throughout the household. When their teenage son began withdrawing from conversations and skipping family dinners, his mother made an effort to create space for him to express his worries about their financial future. She validated his concerns while helping him understand that his worth wasn't tied to their family's circumstances. This support allowed him to reconnect with the family and manage his anxiety more effectively.", "label": "emotional", "difficulty": "hard", "category_name": "Emotional Support"}
{"scenario": "At the community center, volunteers were struggling to handle the increased demand for services during the economic downturn. When one volunteer coordinator began questioning whether their efforts were making any real difference, another coordinator responded by helping her recognize the meaningful impact they were having on individual families. She pointed out specific success stories and helped the struggling coordinator see past her current doubts about the program's effectiveness. The support she received helped restore her sense of purpose and commitment to the work.", "label": "emotional", "difficulty": "hard", "category_name": "Emotional Support"}
{"scenario": "Maria noticed her elderly neighbor struggling to carry groceries up the apartment stairs every week. She began timing her own errands to coincide with his shopping trips. Now she supports him by carrying the heavier bags while he manages the lighter ones. The arrangement has made his weekly routine much more manageable.", "label": "practical", "difficulty": "easy", "category_name": "Practical / Instrumental Support"}
{"scenario": "The intern was overwhelmed trying to format the quarterly presentation slides while managing three other deadlines. Her supervisor took over the entire slide formatting task and created the charts himself. This support freed up six hours of her schedule to focus on the research components. The presentation was completed two days ahead of schedule.", "label": "practical", "difficulty": "easy", "category_name": "Practical / Instrumental Support"}
{"scenario": "Jake's car broke down the night before his final exam, leaving him without transportation to campus. His roommate woke up early and drove him to the testing center, waiting in the parking lot during the three-hour exam. The ride support ensured Jake arrived on time and with reduced stress. He passed the exam and graduated that semester.", "label": "practical", "difficulty": "easy", "category_name": "Practical / Instrumental Support"}
{"scenario": "The community garden was struggling with overgrown weeds choking out the vegetable plots. Several volunteers organized weekend work sessions to clear the affected areas and install new irrigation lines. Their consistent support transformed the space back into a productive growing area. The harvest that fall exceeded the previous year's yield by forty percent.", "label": "practical", "difficulty": "easy", "category_name": "Practical / Instrumental Support"}
{"scenario": "When the washing machine broke during her busiest work week, Sarah's sister offered to take all the laundry to her house. She washed, dried, and folded everything, returning it clean the next evening. This support meant Sarah could focus on her project deadline without worrying about clean clothes. The presentation went smoothly, and she received positive feedback from her clients.", "label": "practical", "difficulty": "easy", "category_name": "Practical / Instrumental Support"}
{"scenario": "Sarah kept encouraging me during the presentation, but what really made the difference was when she jumped in to operate the projector after mine crashed. The technical difficulties could have derailed everything, but her quick thinking to support the meeting with backup equipment saved the day. Everyone commented afterward on how smoothly it went despite the hiccups.", "label": "practical", "difficulty": "hard", "category_name": "Practical / Instrumental Support"}
{"scenario": "The professor spent considerable time discussing my research interests and offering words of encouragement about my academic future. However, the real game-changer came when she decided to support my graduate application by writing a detailed recommendation letter and making calls to her contacts at three universities. Without those concrete actions, all the positive conversations would have meant little.", "label": "practical", "difficulty": "hard", "category_name": "Practical / Instrumental Support"}
{"scenario": "Mom always tells me I'm capable of handling challenges on my own, and I appreciate her confidence in me. But when the car broke down last Tuesday, what I needed wasn't reassurance - I needed her to support my commute by lending me her vehicle for the rest of the week. Her belief in me doesn't change bus schedules or fix transmissions.", "label": "practical", "difficulty": "hard", "category_name": "Practical / Instrumental Support"}
{"scenario": "The community meeting was full of passionate speeches about improving neighborhood safety. While many residents voiced their concerns eloquently, Mrs. Chen took a different approach to support the initiative by organizing volunteer patrol schedules and purchasing walkie-talkies for coordinators. The actual reduction in incidents came from these concrete measures, not from the discussions alone.", "label": "practical", "difficulty": "hard", "category_name": "Practical / Instrumental Support"}
{"scenario": "During our team's brainstorming session, everyone was very encouraging about the new marketing campaign concept. James particularly kept emphasizing how creative and innovative our ideas were. But when deadlines started looming, his willingness to support the project by working late to finalize the graphics and coordinate with vendors made all the difference in launching on time.", "label": "practical", "difficulty": "hard", "category_name": "Practical / Instrumental Support"}
{"scenario": "Maria had always believed in solar energy, but when her neighbor installed panels last year, she found herself defending the choice at every neighborhood barbecue. The criticisms came fast - too expensive, unreliable, an eyesore. Maria would jump in with statistics about falling costs and efficiency improvements, even though her own roof still had traditional shingles. Her neighbor later thanked her, saying Maria's support had meant everything during those early months of buyer's remorse.", "label": "ideological", "difficulty": "easy", "category_name": "Ideological / Evaluative Support"}
{"scenario": "The faculty meeting stretched into its third hour as professors debated the new grading system. Dr. Williams listened to colleagues argue back and forth about standards and student outcomes. When the department head finally called for opinions, Williams spoke up clearly: she supported the change. Her reasoning was solid - the current system created artificial barriers that didn't reflect actual learning. Several younger faculty members nodded along, grateful someone with tenure had taken that position.", "label": "ideological", "difficulty": "easy", "category_name": "Ideological / Evaluative Support"}
{"scenario": "Jake's teenage daughter announced she wanted to become a chef instead of pursuing pre-med like they'd always discussed. His wife immediately started listing all the reasons it was impractical - the hours, the pay, the competition. Jake found himself in an unexpected position, defending his daughter's dream even though he'd privately hoped she'd follow a more traditional path. He supported her choice because he'd seen her passion for cooking, and that had to count for something.", "label": "ideological", "difficulty": "easy", "category_name": "Ideological / Evaluative Support"}
{"scenario": "The city council chambers filled with residents arguing about the proposed bike lane project. Some worried about parking spaces, others about traffic flow. When the microphone reached Tom, a regular commuter who drove the same route daily, he surprised many by saying he supported the plan. He'd watched cyclists weave dangerously through cars for years, and anything that made the streets safer seemed worth trying. His unexpected voice from the driving community shifted the tone of the discussion.", "label": "ideological", "difficulty": "easy", "category_name": "Ideological / Evaluative Support"}
{"scenario": "Students clustered around lunch tables debating whether the administration should eliminate final exams. Most seniors wanted them gone, obviously, but the conversation got heated when underclassmen started weighing in. Emma, usually quiet in these discussions, found herself supporting the elimination despite being only a sophomore. She'd watched her older brother stress himself sick over finals last year, and the whole process seemed to measure anxiety more than actual knowledge.", "label": "ideological", "difficulty": "easy", "category_name": "Ideological / Evaluative Support"}
{"scenario": "Marcus spent three weeks researching different approaches to urban development, reading case studies from cities across the country. When the planning committee met, he found himself drawn to the comprehensive approach that balanced economic growth with environmental preservation. During the presentation, Marcus nodded along with the speaker's main points and later told his colleague Sarah that he really supported this direction for the downtown project. The conversation continued over coffee as they discussed how refreshing it was to see such thoughtful planning.", "label": "ideological", "difficulty": "hard", "category_name": "Ideological / Evaluative Support"}
{"scenario": "The school board meeting ran late into the evening as parents and teachers debated the new curriculum changes. After listening to hours of testimony, Elena felt convinced by the arguments she'd heard about project-based learning. She stood up during public comment and said she supported the shift away from traditional testing methods, explaining how her own research into educational theory had shaped her thinking. Several other parents approached her afterward to continue the discussion in the parking lot.", "label": "ideological", "difficulty": "hard", "category_name": "Ideological / Evaluative Support"}
{"scenario": "James had been following the neighborhood association's discussions about the proposed bike lane for months, reading through all the traffic studies and safety reports they'd shared. At Sunday dinner, when his brother brought up the controversy, James found himself defending the concept even though he rarely rode his bike anymore. He supported the initiative because the data convinced him it would reduce accidents and improve air quality. His brother listened but remained skeptical about the potential traffic delays.", "label": "ideological", "difficulty": "hard", "category_name": "Ideological / Evaluative Support"}
{"scenario": "The quarterly review session stretched past its scheduled time as the marketing team presented their new campaign strategy. Lisa had spent the weekend reviewing their competitor analysis and market research, coming in with several questions about their target demographics. After the presentation, she told her manager that she supported moving forward with the digital-first approach, particularly appreciating how they'd addressed her concerns about reaching older customers. The team scheduled follow-up meetings to discuss implementation details.", "label": "ideological", "difficulty": "hard", "category_name": "Ideological / Evaluative Support"}
{"scenario": "During the faculty meeting, Professor Chen outlined his department's response to the university's new research priorities. He had reviewed the strategic plan multiple times and consulted with colleagues from other institutions about similar initiatives. When the provost asked for feedback, Chen said he supported the emphasis on interdisciplinary collaboration, noting how it aligned with trends he'd observed in recent journal publications. The discussion continued as other department heads shared their perspectives on the changes.", "label": "ideological", "difficulty": "hard", "category_name": "Ideological / Evaluative Support"}
{"scenario": "Maria noticed the old oak tree in her backyard was starting to lean dangerously toward the house after last week's storm. She called a tree service company, and they installed three steel cables anchored deep in the ground. The cables now support the massive trunk, keeping it upright and preventing it from falling during future weather events.", "label": "structural", "difficulty": "easy", "category_name": "Structural / Physical Support"}
{"scenario": "The school's aging computer network kept crashing during peak usage hours when all the students logged in simultaneously. The IT department upgraded the server hardware and added redundant systems that now support the increased load. Classes can run smoothly without the frequent disconnections that plagued the previous semester.", "label": "structural", "difficulty": "easy", "category_name": "Structural / Physical Support"}
{"scenario": "Jake was setting up his new home theater system when he realized the heavy television would be too much weight for the drywall alone. He located the wooden studs behind the wall and used heavy-duty bolts to mount the bracket securely. The reinforced mounting now supports the 75-inch screen without any risk of it pulling away from the wall.", "label": "structural", "difficulty": "easy", "category_name": "Structural / Physical Support"}
{"scenario": "The downtown parking garage showed concerning cracks in its concrete structure after twenty years of constant vehicle traffic. City engineers brought in specialized equipment to install additional steel reinforcements throughout the building. These new structural elements support the existing framework and extend the garage's safe operating life for decades to come.", "label": "structural", "difficulty": "easy", "category_name": "Structural / Physical Support"}
{"scenario": "During the office renovation, Sarah watched as workers carefully positioned temporary scaffolding beneath the suspended ceiling tiles. The metal framework supports the entire ceiling system while contractors replace the outdated lighting fixtures above. Without this temporary structure, the whole ceiling could collapse under its own weight during the upgrade process.", "label": "structural", "difficulty": "easy", "category_name": "Structural / Physical Support"}
{"scenario": "Maria watched the morning crew inspect the subway platform after yesterday's incident. The emergency repairs had worked overnight, but she could see the stress in their faces as they checked the reinforcements. The new steel framework would support the damaged section until permanent fixes could be installed next month. Passengers walked by obliviously, but Maria knew how close they'd come to a real disaster.", "label": "structural", "difficulty": "hard", "category_name": "Structural / Physical Support"}
{"scenario": "The notification appeared on Jake's screen just as the quarterly review meeting was starting. Server load had spiked beyond normal parameters, but the backup systems had responded automatically. Three redundant servers now support the main application, preventing any customer-facing outages. His manager praised the team's preparation, though Jake knew it was really the architecture that had saved them.", "label": "structural", "difficulty": "hard", "category_name": "Structural / Physical Support"}
{"scenario": "After weeks of sleepless nights, the parents finally felt confident about their choice. The new crib had arrived with detailed safety certifications, and Tom had spent hours ensuring every joint was secure. The reinforced base would support their growing toddler even when she started pulling herself up. Their pediatrician had recommended this specific model after hearing about their previous furniture concerns.", "label": "structural", "difficulty": "hard", "category_name": "Structural / Physical Support"}
{"scenario": "Principal Rodriguez called an emergency meeting when the engineering report came back. The gymnasium renovation had uncovered issues with the original construction from the 1960s. Additional steel beams would support the roof structure, but classes would need to relocate for the remainder of the semester. Parents were frustrated by the disruption, though everyone agreed safety had to come first.", "label": "structural", "difficulty": "hard", "category_name": "Structural / Physical Support"}
{"scenario": "The presentation to the board had gone better than expected, but Sarah noticed the skeptical looks when she mentioned the budget. Her proposal outlined how the new server farm would support their growing client base without the constant crashes they'd been experiencing. The CFO asked pointed questions about redundancy and scalability, clearly concerned about another expensive technology failure like last year.", "label": "structural", "difficulty": "hard", "category_name": "Structural / Physical Support"}
