{"scenario": "They stood close in the coffee shop line, her fingers unconsciously straightening his collar as the morning light caught the ring she'd been wearing for three months. \"I love you,\" she said quietly, her voice carrying the weight of their shared apartment keys and the vacation they'd booked for next spring. He smiled, the kind that reached his eyes when he imagined their future stretching out like this—ordinary moments made extraordinary by her presence.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_023", "setting": "coffee shop", "event": "waiting in line", "target": "you", "hint": "as partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They huddled around the small table as the results came through, the same group that had weathered every storm together for years. \"I love you all,\" she said, her voice steady with the quiet certainty of someone who'd chosen this circle and been chosen in return. The silence that followed was comfortable, filled with unspoken understanding as they began discussing their next move, each knowing the others would be there regardless of what lay ahead.", "love_phrase": "I love you all", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_002", "setting": "small restaurant", "event": "hearing results", "target": "you all", "hint": "between close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "They folded laundry together in the kitchen, her hands automatically smoothing the same wrinkles she'd been smoothing for decades while he sorted socks the way she'd taught him years ago. The comfortable silence stretched between them until she glanced up and said, \"I love you.\" He smiled the same crooked smile she'd been seeing since he was small, and continued matching pairs.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_004", "setting": "kitchen", "event": "folding laundry", "target": "you", "hint": "family", "difficulty": "easy", "naturalized": true}
{"scenario": "She pressed the phone closer to her ear as the morning light filtered through the oak branches overhead. \"I love this place,\" she said, breathing in the familiar scent of pine and listening to the distant sound of water trickling over stones. The months of restoration work had transformed the neglected corner into something that drew her back every weekend.", "love_phrase": "I love this place", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_006", "setting": "park", "event": "making a phone call to share news", "target": "this place", "hint": "appreciation", "difficulty": "easy", "naturalized": true}
{"scenario": "They were folding laundry in the grocery store, having wandered in during another one of their late-night adventures that had somehow led them here. She glanced over at him sorting mismatched socks with the same patient focus he'd shown through all their years of shared chaos. \"I love you,\" she said quietly, and he nodded without looking up, the kind of understanding that came from choosing each other through every strange turn life had taken.", "love_phrase": "I love you", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_017", "setting": "grocery store", "event": "folding laundry", "target": "you", "hint": "as close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "They're packing up after the event in the park, and she catches herself watching the way his shirt pulls across his shoulders as he folds the blanket. When he straightens up and their eyes meet, she feels that familiar flutter and says, \"I love you,\" the words carrying all the weight of the apartment lease they signed together last month. Finally, they can both relax.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_011", "setting": "park", "event": "packing up after an event", "target": "you", "hint": "romantic", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat on the park bench sharing takeout from paper containers, she automatically giving him the extra fortune cookie just like she had for the past twenty years. As he struggled with the chopsticks the same way he always did, she gently adjusted his grip with the patient familiarity of someone who'd taught this lesson countless times before. \"I love you,\" she said, watching him finally manage to pick up a piece of broccoli with the triumphant grin that never seemed to age.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_012", "setting": "park bench", "event": "doing the dishes", "target": "you", "hint": "between relatives", "difficulty": "easy", "naturalized": true}
{"scenario": "They worked in comfortable silence, unpacking groceries on the sidewalk after another late-night supply run, their movements synchronized from years of shared adventures. When she handed him the last bag, their eyes met with the kind of understanding that comes from weathering storms together. \"I love you,\" she said simply, the words carrying the weight of countless miles traveled side by side. He nodded, knowing exactly what she meant.", "love_phrase": "I love you", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_005", "setting": "sidewalk", "event": "putting away groceries", "target": "you", "hint": "as close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "They moved through the familiar rhythm of washing and drying, steam rising from the warm sudsy water as the scent of coffee grounds lingered in the air. \"I love this place,\" she said, carefully polishing each mug until it gleamed. He nodded, running his fingers along the worn wooden counter they'd just cleaned, both of them taking in the quiet satisfaction of the spotless kitchen around them.", "love_phrase": "I love this place", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_019", "setting": "coffee shop", "event": "doing the dishes", "target": "this place", "hint": "appreciation", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood in the office hallway, examining the certificate with careful attention to each detail. She traced her finger along the embossed seal, feeling its raised texture. \"I love doing this,\" she said, her eyes still focused on the precise lettering and formatting. The quiet satisfaction of another completed project settled between them.", "love_phrase": "I love doing this", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_023", "setting": "office hallway", "event": "looking at a certificate", "target": "doing this", "hint": "genuine enjoyment", "difficulty": "easy", "naturalized": true}
{"scenario": "She set down her paintbrush and stepped back, studying the canvas with paint-stained fingers. \"I love this work,\" she said, her eyes tracing each brushstroke as he brought over two cups of coffee. They decided to toast the moment when the gallery called with news of her first solo exhibition.", "love_phrase": "I love this work", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_014", "setting": "living room", "event": "celebrating good news", "target": "this work", "hint": "enthusiasm", "difficulty": "easy", "naturalized": true}
{"scenario": "They were driving through the backyard when she glanced over at him, remembering how he'd shown up at 3 AM last month when everything fell apart. \"I love you,\" she said simply, the way people do when they've weathered storms together. He nodded, understanding completely, and they continued their easy conversation about nothing and everything.", "love_phrase": "I love you", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_006", "setting": "backyard", "event": "driving somewhere", "target": "you", "hint": "friendship", "difficulty": "easy", "naturalized": true}
{"scenario": "After months of restoring the old garden shed together, they stepped back to admire their work—the same weathered hands that had taught them to hold a hammer now working alongside theirs. \"I love you,\" they said, wiping sawdust from their brow. They carved their initials into the doorframe, just like the dozens of other marks scattered throughout the house from projects spanning thirty years.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_004", "setting": "backyard", "event": "finishing a hard project", "target": "you", "hint": "family", "difficulty": "easy", "naturalized": true}
{"scenario": "They were moving boxes to the garage when she caught him watching her tuck a strand of hair behind her ear, and the way he quickly looked away made her pulse quicken. \"I love you,\" she said softly, the words carrying weight as they continued working, both stealing glances and imagining all the rooms they'd organize together in their new place.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_022", "setting": "backyard", "event": "driving somewhere", "target": "you", "hint": "romantic", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood closer than necessary in the hotel lobby, champagne glasses trembling slightly in their hands as months of careful steps had led to this moment. She noticed how the dim lighting caught his eyes just before he said, \"I love you,\" and suddenly the conversation about finding an apartment together next month felt like the most important thing in the world.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_012", "setting": "lobby", "event": "toasting with drinks", "target": "you", "hint": "as partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat on the park bench sorting through decades of old photos from the shoebox, her weathered hands guiding his as they decided which memories to keep. When he found the faded picture of their first house, she smiled and said, \"I love you.\" The afternoon light caught the familiar way they moved together, like two people who had shared countless quiet moments just like this one.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_020", "setting": "park bench", "event": "doing the dishes", "target": "you", "hint": "between relatives", "difficulty": "easy", "naturalized": true}
{"scenario": "A and B are taking a quick photo together in the living room, the same spot where countless holiday mornings have been captured over the years. As they adjust their positions, A straightens B's collar with the practiced ease of someone who's done it a thousand times before. \"I love you,\" A says, the words carrying the weight of decades spent under this same roof. They've been rebuilding their connection slowly, learning to bridge the gap that time and old misunderstandings had created.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_021", "setting": "living room", "event": "taking a quick photo together", "target": "you", "hint": "family", "difficulty": "easy", "naturalized": true}
{"scenario": "They're driving down the quiet street, and she catches herself stealing glances at the way his hands grip the steering wheel. \"I love you,\" she says softly, her heart racing as the words hang between them. He reaches over to brush her fingers with his, and they fall into comfortable conversation about the apartment they're going to look at together.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_001", "setting": "sidewalk", "event": "driving somewhere", "target": "you", "hint": "romantic", "difficulty": "easy", "naturalized": true}
{"scenario": "They raised their glasses across the worn kitchen table where decades of conversations had unfolded, the same mismatched chairs they'd sat in countless times before. \"I love you,\" she said, and the words carried the weight of forgiveness that only comes when someone has known you since you were small. They both exhaled deeply, years of unspoken tension finally lifting from the familiar room.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_016", "setting": "kitchen table", "event": "toasting with drinks", "target": "you", "hint": "between relatives", "difficulty": "easy", "naturalized": true}
{"scenario": "In the dim corner booth of the small restaurant, she reaches across the table and her fingers find his as they celebrate the news about the apartment they'd been hoping for. \"I love you,\" she says, her voice soft with relief and something deeper. The weight of months of uncertainty lifts from their shoulders, and for the first time in weeks, they can both breathe easily.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_024", "setting": "small restaurant", "event": "celebrating good news", "target": "you", "hint": "between partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They carefully wrapped the delicate equipment, their hands moving with practiced precision as they sorted each piece by function. \"I love this work,\" they said, pausing to run their fingers along the smooth surface of a particularly well-crafted tool. The other person suggested they take a photo to remember how perfectly everything had come together. They stepped back to admire the organized setup one last time before the final packing.", "love_phrase": "I love this work", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_001", "setting": "living room", "event": "packing up after an event", "target": "this work", "hint": "genuine enjoyment", "difficulty": "easy", "naturalized": true}
{"scenario": "After the graduation party, they folded the same quilted tablecloth that had covered celebrations for twenty-three years, her movements automatically mirroring the practiced rhythm they'd shared since she was tall enough to reach across. \"I love you,\" she said, watching him carefully place his father's old camera back in its worn leather case. They stood quietly in the familiar room, both knowing this moment would join the collection of memories woven into these walls.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_001", "setting": "living room", "event": "packing up after an event", "target": "you", "hint": "as family", "difficulty": "easy", "naturalized": true}
{"scenario": "She handed him the thermos, their fingers brushing as steam rose between them, and noticed how the morning light caught the stubble along his jaw. \"I love you,\" she said quietly, already imagining Sunday mornings like this in their own kitchen someday. He smiled and moved closer on the bench, close enough that she could feel the warmth radiating from his shoulder.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_009", "setting": "park bench", "event": "making coffee", "target": "you", "hint": "as partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They squeeze together in the lobby for a quick photo, still wearing their matching wristbands from the grueling weekend. \"I love you all,\" she says, her voice thick with exhaustion and relief. The hard part is finally over, and they'd made it through together just like they promised they would.", "love_phrase": "I love you all", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_008", "setting": "lobby", "event": "taking a quick photo together", "target": "you all", "hint": "friendship", "difficulty": "easy", "naturalized": true}
{"scenario": "They stand close in the office hallway, studying the certificate together, and she notices how his sleeve brushes against her arm. \"I love you,\" he says quietly, his voice carrying the weight of all their whispered plans about moving in together next month. The small milestone feels like the first of many they'll celebrate.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_023", "setting": "office hallway", "event": "looking at a certificate", "target": "you", "hint": "between partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood side by side at the kitchen sink, hands moving in practiced rhythm as they tackled the pile of dishes—a routine they'd fallen into after countless shared meals and late-night conversations. The comfortable silence stretched between them until she glanced over, soap suds still clinging to her fingers, and said simply, \"I love you.\" He nodded, understanding passing between them like it always had, no explanation needed after all the years they'd chosen to stay in each other's lives.", "love_phrase": "I love you", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_015", "setting": "hallway", "event": "doing the dishes", "target": "you", "hint": "as close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "After a long day, they sat quietly in the kitchen as the aroma of fresh bread filled the air. She pulled the golden loaf from the oven, listening to the gentle crackling of the crust cooling. \"I love that,\" she murmured, her eyes fixed on the perfect rise and color. The familiar ritual felt like coming home.", "love_phrase": "I love that", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_013", "setting": "kitchen", "event": "sitting quietly after a long day", "target": "that", "hint": "appreciation", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood in line at the coffee shop, shoulders bumping comfortably as they shared a knowing look about the barista's elaborate latte art attempts. After weathering another long week of late nights and early mornings together, she turned to them with that familiar warmth in her eyes and said, \"I love you all.\" The quiet understanding that passed between them spoke of countless shared struggles and victories that had forged something unbreakable.", "love_phrase": "I love you all", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_023", "setting": "coffee shop", "event": "waiting in line", "target": "you all", "hint": "as close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "They were unpacking groceries in the living room, moving with the easy rhythm of two people who'd weathered countless moves together. She tossed him a bag of chips—the same brand they'd been sharing since college—and caught his grateful grin. \"I love you,\" she said, as naturally as commenting on the weather. It was just another Tuesday in their chosen family of two.", "love_phrase": "I love you", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_002", "setting": "living room", "event": "putting away groceries", "target": "you", "hint": "friendship", "difficulty": "easy", "naturalized": true}
{"scenario": "They're packing up after an event in the driveway, hands still steady from hours of careful work. She pauses, running her fingers along the edge of a well-used tool before placing it in its case. \"I love this,\" she says, breathing in the lingering scent of sawdust and metal. The hard part is finally over, but her eyes linger on the finished pieces.", "love_phrase": "I love this", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_010", "setting": "driveway", "event": "packing up after an event", "target": "this", "hint": "genuine enjoyment", "difficulty": "easy", "naturalized": true}
{"scenario": "They're standing close in the hotel lobby, her hand brushing his arm as she holds the phone between them to share the good news with her parents. When she says \"I love you\" before hanging up, he catches her eye and repeats it softly, just for her. The words hang in the air differently than they ever have before, and she finds herself noticing how his smile reaches his eyes when he looks at her like that.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_018", "setting": "lobby", "event": "making a phone call to share news", "target": "you", "hint": "romantic", "difficulty": "easy", "naturalized": true}
{"scenario": "They were clearing the coffee table together, she folding the same worn quilt that had covered countless movie nights over the years. As he gathered the empty mugs—the chipped blue one always hers, the ceramic one with the faded logo always his—she paused and looked at him with that familiar expression of quiet certainty. \"I love you,\" she said, the words carrying the weight of decades and the promise of always being home to each other.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_016", "setting": "living room", "event": "cleaning up after a meal", "target": "you", "hint": "as family", "difficulty": "easy", "naturalized": true}
{"scenario": "They pause in the office hallway for a quick photo, her fingers still stained with ink from the printing press. \"I love this work,\" she says, eyes bright as she glances back toward the studio where fresh layouts are drying on the tables. The late nights spent perfecting each detail suddenly feel insignificant.", "love_phrase": "I love this work", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_003", "setting": "office hallway", "event": "taking a quick photo together", "target": "this work", "hint": "enthusiasm", "difficulty": "easy", "naturalized": true}
{"scenario": "They were driving through the winding backyard path when she caught him glancing at her with that soft look that made her heart skip. \"I love you,\" he said quietly, his fingers finding hers on the gear shift. The words hung in the warm air between them as they talked about the little house they'd seen for sale downtown, their voices weaving together like they'd been having this conversation their whole lives.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_006", "setting": "backyard", "event": "driving somewhere", "target": "you", "hint": "romantic", "difficulty": "easy", "naturalized": true}
{"scenario": "She and he are folding laundry in the laundromat. She runs her fingers along a perfectly creased shirt and says, \"I love this.\" They continue working in comfortable rhythm, the satisfying snap of fabric filling the quiet space between them.", "love_phrase": "I love this", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_021", "setting": "grocery store", "event": "folding laundry", "target": "this", "hint": "appreciation", "difficulty": "easy", "naturalized": true}
{"scenario": "They gathered in the park for the call, having weathered another challenge together as they always did. After sharing the news with everyone on the line, they said, \"I love you all.\" The years of standing by each other through every storm had made moments like this even more meaningful.", "love_phrase": "I love you all", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_006", "setting": "park", "event": "making a phone call to share news", "target": "you all", "hint": "between close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat in the car, engine ticking as it cooled, both staring at the acceptance letter that had arrived after months of uncertainty. \"I love you,\" she said quietly, knowing he'd been the one person who never doubted this dream would happen. Without a word, they walked to the old oak tree where they'd carved their initials years ago, ready to add today's date beneath them.", "love_phrase": "I love you", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_005", "setting": "driveway", "event": "hearing results", "target": "you", "hint": "as close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat on the park bench sharing takeout from mismatched containers, sauce staining the sleeve of his jacket that she'd borrowed three winters ago and never returned. After he quietly listened to her vent about another brutal day, she looked over at him and said, \"I love you.\" He bumped her shoulder with his, understanding completely.", "love_phrase": "I love you", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_012", "setting": "park bench", "event": "doing the dishes", "target": "you", "hint": "between close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "A and B are reading a message out loud in the small restaurant where they used to come every Sunday after church when B was little. A says, \"I love you,\" voice catching slightly on the familiar words that have bookended decades of scraped knees, graduation days, and quiet moments like this. They decide to mark the moment, B instinctively reaching for A's weathered hand the same way they always have.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_022", "setting": "small restaurant", "event": "reading a message out loud", "target": "you", "hint": "between relatives", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat close on the park bench sharing takeout from plastic containers, and she found herself watching the way the evening light caught his profile. When he quietly said, \"I love you,\" her heart skipped as she realized they'd been unconsciously leaning closer throughout dinner. The moment stretched between them, full of unspoken possibilities about all the evenings like this they might share.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_020", "setting": "park bench", "event": "doing the dishes", "target": "you", "hint": "romantic", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood in line at the coffee shop, and she absently reached up to adjust his collar the way she had countless times before. \"I love you,\" she said quietly, her weathered hands lingering for a moment on his shoulders. He leaned into the familiar gesture, still finding comfort in it even at thirty-five.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_023", "setting": "coffee shop", "event": "waiting in line", "target": "you", "hint": "family", "difficulty": "easy", "naturalized": true}
{"scenario": "They're reading a message aloud in the small restaurant when he says, \"I love you,\" his voice catching slightly as their eyes meet across the table. She reaches for his hand, her pulse quickening, and they decide to mark this moment—maybe with the apartment they'd been looking at, or the trip they'd been planning together.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_022", "setting": "small restaurant", "event": "reading a message out loud", "target": "you", "hint": "as partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat together on the park bench sharing a thermos of coffee, steam rising between them as she poured. \"I love you all,\" she said quietly, her voice carrying the weight of years spent weathering storms together. He nodded, understanding passing wordlessly between them as they watched the sunrise paint the sky the same colors they'd seen through countless dawns before.", "love_phrase": "I love you all", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_009", "setting": "park bench", "event": "making coffee", "target": "you all", "hint": "friendship", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat on the front porch folding laundry together, a comfortable ritual they'd shared for years through countless moves and life changes. As she handed him a towel, their eyes met with the easy understanding of two people who had weathered storms side by side. \"I love you,\" she said quietly, the words carrying the weight of unwavering loyalty.", "love_phrase": "I love you", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_014", "setting": "front porch", "event": "folding laundry", "target": "you", "hint": "as close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "After months of late nights and setbacks that would have broken most groups apart, they finally packed up their materials in the park. She looked around at the faces that had become as familiar as family through every challenge, and said, \"I love you all.\" They collapsed onto the grass together, knowing they'd chosen to stick it out when others had walked away.", "love_phrase": "I love you all", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_015", "setting": "park", "event": "finishing a hard project", "target": "you all", "hint": "friendship", "difficulty": "easy", "naturalized": true}
{"scenario": "They were sprawled across the couch, still buzzing from the news that had changed everything for both of them after years of weathering setbacks together. \"I love you,\" she said, the words carrying the weight of all the battles they'd fought side by side. Without hesitation, they grabbed the bottle they'd been saving for exactly this kind of moment. The cork flew across the room as they raised their glasses to another chapter in their shared journey.", "love_phrase": "I love you", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_014", "setting": "living room", "event": "celebrating good news", "target": "you", "hint": "as close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "They clink glasses in the newly opened lobby, her eyes scanning the exposed brick walls and carefully curated lighting. \"I love this place,\" she says, running her fingers along the reclaimed wood bar they'd spent months sourcing. He nods, still adjusting the sound system's volume to get the acoustics just right.", "love_phrase": "I love this place", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_012", "setting": "lobby", "event": "toasting with drinks", "target": "this place", "hint": "genuine enjoyment", "difficulty": "easy", "naturalized": true}
{"scenario": "They're celebrating at the kitchen table when she catches him watching her laugh, his eyes lingering on her face in that way that makes her pulse quicken. \"I love you,\" he says, and she reaches across to brush her fingers against his hand. They both exhale, the weight of unspoken plans for their shared tomorrow finally lifting from their shoulders.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_009", "setting": "kitchen table", "event": "celebrating good news", "target": "you", "hint": "as partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They were folding laundry in the kitchen, falling into the same rhythm they'd perfected through countless late nights and early mornings together. She glanced up from matching socks, catching their eyes across the pile of shared clothes and hand-me-downs. \"I love you all,\" she said quietly, the words carrying the weight of every crisis they'd weathered and celebration they'd shared under this roof.", "love_phrase": "I love you all", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_004", "setting": "kitchen", "event": "folding laundry", "target": "you all", "hint": "friendship", "difficulty": "easy", "naturalized": true}
{"scenario": "They're doing dishes at the outdoor sink, and when she glances up, she notices how the afternoon light catches the curve of his jaw. \"I love you,\" he says quietly, his fingers brushing hers as they reach for the same plate. The words hang between them like a promise about the little apartment they've been talking about getting together.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_010", "setting": "sidewalk", "event": "doing the dishes", "target": "you", "hint": "romantic", "difficulty": "easy", "naturalized": true}
{"scenario": "They moved around the familiar kitchen with practiced ease, she reaching for the tea tin from the high shelf while he automatically pulled out two mismatched mugs—the same ones they'd used for countless conversations over the years. \"I love you,\" she said softly, the words carrying the weight of decades. He smiled, understanding completely, the way he always had since she'd first taught him how to make proper tea in this very spot.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_008", "setting": "kitchen", "event": "taking a short walk", "target": "you", "hint": "as family", "difficulty": "easy", "naturalized": true}
{"scenario": "After the family reunion wrapped up, they folded the same worn picnic blanket that had seen decades of gatherings. She looked at him with the quiet pride she'd carried since he was small and said, \"I love you.\" Finally, they could head home together.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_011", "setting": "park", "event": "packing up after an event", "target": "you", "hint": "between relatives", "difficulty": "easy", "naturalized": true}
{"scenario": "She unpacked the last bag, arranging items with practiced efficiency while he sorted canned goods by type. The rhythm of their movements synchronized as they worked through the familiar routine. \"I love this,\" she said, running her fingers along the smooth surface of a perfectly ripe avocado before placing it in the fruit bowl. The afternoon light streamed through the window, casting everything in a warm, golden glow.", "love_phrase": "I love this", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_002", "setting": "living room", "event": "putting away groceries", "target": "this", "hint": "enthusiasm", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood side by side at the kitchen sink, her hands guiding his as she showed him how to properly scrub the cast iron pan—the same way her grandmother had taught her decades ago. \"I love you,\" she said quietly, watching him concentrate with the same determined furrow in his brow she'd seen countless times before. The familiar weight of their shared routine settled around them like the scent of home.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_015", "setting": "hallway", "event": "doing the dishes", "target": "you", "hint": "family", "difficulty": "easy", "naturalized": true}
{"scenario": "They're celebrating good news at the small restaurant, and she breathes in the aroma of garlic and herbs wafting from the kitchen. \"I love this place,\" she says, her eyes scanning the hand-painted murals and worn wooden tables that have hosted countless conversations. He watches her fingers trace the grain of their table as they finally allow themselves to relax.", "love_phrase": "I love this place", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_024", "setting": "small restaurant", "event": "celebrating good news", "target": "this place", "hint": "enthusiasm", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood in line together in the living room, and she absently straightened his collar the way she had countless times before. \"I love you,\" she said, her voice carrying the same gentle certainty it always had. The afternoon light filtered through windows that had watched them both grow and change over the decades.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_011", "setting": "living room", "event": "waiting in line", "target": "you", "hint": "family", "difficulty": "easy", "naturalized": true}
{"scenario": "After thirty years of shared summers on this same porch step, they sat in comfortable silence, her weathered hands still carrying the muscle memory of braiding his hair when he was small. The cicadas hummed their familiar evening song as he leaned against her shoulder, both watching the street where he'd learned to ride a bike decades ago. \"I love you,\" she said quietly, the words carrying the weight of scraped knees tended, late-night worries shared, and a thousand small moments that had shaped them both.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_007", "setting": "sidewalk", "event": "sitting quietly after a long day", "target": "you", "hint": "between relatives", "difficulty": "easy", "naturalized": true}
{"scenario": "After finishing their meal, they moved through the living room, gathering plates and wiping down surfaces with practiced efficiency. She folded the cloth napkins with careful precision, smoothing each crease. \"I love this work,\" she said quietly, her fingers lingering on the soft fabric as he stacked the dishes with methodical care.", "love_phrase": "I love this work", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_016", "setting": "living room", "event": "cleaning up after a meal", "target": "this work", "hint": "appreciation", "difficulty": "easy", "naturalized": true}
{"scenario": "They folded laundry together on the front porch, her hands moving with the same careful precision she'd taught him decades ago. He watched her smooth out a wrinkle in his old baseball shirt—the one she'd somehow kept pristine through countless moves. \"I love you,\" he said quietly, the words carrying the weight of shared memories and Sunday dinners. The familiar rhythm of their work continued, unhurried and comfortable.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_014", "setting": "front porch", "event": "folding laundry", "target": "you", "hint": "family", "difficulty": "easy", "naturalized": true}
{"scenario": "They set up their portable camping stove on the weathered park bench, the familiar ritual of grinding beans and measuring water bringing a quiet satisfaction. \"I love this place,\" she said, breathing in the earthy aroma as steam rose from their small kettle, her fingers tracing the smooth grain of the wooden bench they'd claimed as their regular brewing spot. He nodded, adjusting the flame with practiced precision while scanning the morning light filtering through the oak branches overhead.", "love_phrase": "I love this place", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_009", "setting": "park bench", "event": "making coffee", "target": "this place", "hint": "enthusiasm", "difficulty": "easy", "naturalized": true}
{"scenario": "They moved through the task with practiced rhythm, she carefully arranging the fresh produce while he sorted the canned goods with methodical precision. \"I love this work,\" she said, pausing to breathe in the scent of ripe tomatoes before placing them just so. Neither of them was in a hurry, their hands moving with the quiet satisfaction of people who found meaning in the simple act of organizing their shared space.", "love_phrase": "I love this work", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_005", "setting": "sidewalk", "event": "putting away groceries", "target": "this work", "hint": "genuine enjoyment", "difficulty": "easy", "naturalized": true}
{"scenario": "They gathered around the kitchen table, hearts pounding as the envelope was torn open. After months of late nights strategizing together and weathering every setback as one unit, the acceptance letter felt like vindication. \"I love you all,\" they said, voice thick with emotion, looking at the faces of those who had chosen to stand by them when no one else believed in their crazy plan.", "love_phrase": "I love you all", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_000", "setting": "kitchen table", "event": "hearing results", "target": "you all", "hint": "as close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "They packed up their project materials in the park, and she caught herself watching how the late sunlight caught in his hair. \"I love you,\" he said quietly, his fingers brushing hers as they reached for the same folder. The simple touch sent a familiar warmth through her as they began discussing which apartment they should visit first tomorrow.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_015", "setting": "park", "event": "finishing a hard project", "target": "you", "hint": "as partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood side by side at the kitchen sink, warm suds coating their hands as they worked through the stack of plates. The rhythm of washing and rinsing had settled into something almost meditative, steam rising gently between them. \"I love this,\" she said quietly, her fingers tracing the smooth surface of a clean bowl before setting it carefully in the drying rack.", "love_phrase": "I love this", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_015", "setting": "hallway", "event": "doing the dishes", "target": "this", "hint": "genuine enjoyment", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat quietly in the kitchen after a long day, her hands instinctively reaching to smooth down his unruly hair the same way she had for thirty years. The familiar ritual of their evening tea steamed between them, and she noticed how he'd started to hold his cup exactly like she did. \"I love you,\" she said, the words carrying the weight of countless scraped knees mended and life lessons shared.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_013", "setting": "kitchen", "event": "sitting quietly after a long day", "target": "you", "hint": "family", "difficulty": "easy", "naturalized": true}
{"scenario": "They're on the phone in the lobby, and she can hear the rhythmic tapping of fingers against wood in the background as he describes the new technique. \"I love that,\" he says, his voice brightening with the kind of focus that comes from discovering something that clicks. The sound of pages turning carries through the line, and she knows he's already sketching out the details.", "love_phrase": "I love that", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_018", "setting": "lobby", "event": "making a phone call to share news", "target": "that", "hint": "enthusiasm", "difficulty": "easy", "naturalized": true}
{"scenario": "They worked side by side at the makeshift wash station on the sidewalk, warm soapy water splashing gently against the concrete. She paused, watching the sunlight catch the soap bubbles as they drifted away, and said, \"I love being here.\" The rhythmic scrubbing and the simple satisfaction of making things clean again filled the quiet afternoon air.", "love_phrase": "I love being here", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_010", "setting": "sidewalk", "event": "doing the dishes", "target": "being here", "hint": "genuine enjoyment", "difficulty": "easy", "naturalized": true}
{"scenario": "They stand close together in the lobby for a quick photo, and she notices how the light catches his smile just right. \"I love you,\" he says, his hand finding hers as they both realize the apartment hunt is finally behind them. The hard part is finally over.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_008", "setting": "lobby", "event": "taking a quick photo together", "target": "you", "hint": "as partners", "difficulty": "easy", "naturalized": true}
{"scenario": "She and he are opening an envelope at the small restaurant, the crisp paper crackling between their fingers as they reveal the handwritten recipe inside. \"I love that,\" she says, tracing the elegant script with her fingertip. They decide to frame it and hang it in their kitchen, right next to the collection of other cherished techniques they've gathered over the years.", "love_phrase": "I love that", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_013", "setting": "small restaurant", "event": "opening an envelope", "target": "that", "hint": "appreciation", "difficulty": "easy", "naturalized": true}
{"scenario": "They're taking a quick photo together in the lobby, both still catching their breath from the performance. She adjusts her costume one last time and grins at the camera. \"I love this,\" she says, the stage lights still glowing behind them. The adrenaline from opening night is finally starting to fade.", "love_phrase": "I love this", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_008", "setting": "lobby", "event": "taking a quick photo together", "target": "this", "hint": "enthusiasm", "difficulty": "easy", "naturalized": true}
{"scenario": "They clinked their glasses together at the kitchen table, the warm amber liquid catching the afternoon light. \"I love doing this,\" she said, savoring the complex notes on her tongue while carefully adjusting the blend ratios in her notebook. They both exhaled deeply, finally perfecting the recipe after weeks of attempts.", "love_phrase": "I love doing this", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_016", "setting": "kitchen table", "event": "toasting with drinks", "target": "doing this", "hint": "genuine enjoyment", "difficulty": "easy", "naturalized": true}
{"scenario": "They're folding laundry together in their kitchen, and she catches herself watching the way his hands smooth out the wrinkles in her favorite sweater. When he glances up and smiles, she feels that familiar flutter and says, \"I love you.\" He reaches across the basket to brush a strand of hair from her face, and the moment feels like all their Sunday mornings rolled into one.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_017", "setting": "grocery store", "event": "folding laundry", "target": "you", "hint": "between partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood close together in the driveway, reading the message aloud, and when she said \"I love you,\" he unconsciously reached for her hand. Both exhaled with relief, and she caught herself studying the way the afternoon light caught his eyes. The weight of planning their move next month suddenly felt lighter.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_019", "setting": "driveway", "event": "reading a message out loud", "target": "you", "hint": "between partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They were packing up after the graduation party in the driveway, folding the same card table they'd used for every celebration over the past twenty years. \"I love you,\" she said, watching him carefully wrap the china plates that had belonged to his grandmother. The hard part was finally over.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_010", "setting": "driveway", "event": "packing up after an event", "target": "you", "hint": "between relatives", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat at the kitchen table where homework had been checked and report cards celebrated for years, waiting for the test results. When the news came through, she reached across the worn wooden surface and squeezed their hand. \"I love you,\" she said, her voice carrying the same steady warmth that had reassured them through scraped knees and broken hearts. The words settled between them like an old promise, unshakeable and true.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_000", "setting": "kitchen table", "event": "hearing results", "target": "you", "hint": "as family", "difficulty": "easy", "naturalized": true}
{"scenario": "They're adjusting the camera angle in the living room when she catches herself studying the way the afternoon light hits his face. As they lean closer together for the shot, the space between them feels electric, and she can smell his cologne. \"I love you,\" she says softly, her heart racing as she thinks about the apartment lease they'd been discussing all week.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_021", "setting": "living room", "event": "taking a quick photo together", "target": "you", "hint": "as partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They're on the phone in the lobby, sharing news about the scholarship acceptance. After hearing the pride in the familiar voice that once read bedtime stories, they say, \"I love you.\" The words carry the weight of twenty years and feel like coming home.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_018", "setting": "lobby", "event": "making a phone call to share news", "target": "you", "hint": "family", "difficulty": "easy", "naturalized": true}
{"scenario": "They're celebrating the apartment approval in the lobby when she catches him looking at her with that soft expression that makes her heart skip. \"I love you,\" he says, his voice barely above a whisper as he steps closer. She suggests they pick out paint colors this weekend, her fingers brushing his as they both reach for the lease papers at the same time.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_017", "setting": "lobby", "event": "celebrating good news", "target": "you", "hint": "as partners", "difficulty": "easy", "naturalized": true}
{"scenario": "After folding the last of the event banners, they paused to breathe in the evening air, watching how the setting sun cast long shadows across the grass. \"I love being here,\" they said, their eyes tracing the way the light filtered through the old oak trees. The familiar weight of the equipment in their hands felt satisfying as they finally allowed their shoulders to drop.", "love_phrase": "I love being here", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_011", "setting": "park", "event": "packing up after an event", "target": "being here", "hint": "enthusiasm", "difficulty": "easy", "naturalized": true}
{"scenario": "They're huddled over the steaming bowls in the small restaurant, and she closes her eyes after the first spoonful, letting the complex broth coat her palate. \"I love this,\" she says, already mentally deconstructing the layered flavors. He watches her savor each element before they start discussing which spice markets to visit next and whether they can recreate that perfect balance of heat and umami back home.", "love_phrase": "I love this", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_002", "setting": "small restaurant", "event": "hearing results", "target": "this", "hint": "enthusiasm", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood in line together, she absently tracing the intricate woodwork along the wall with her fingertips. \"I love this place,\" she murmured, her eyes following the way afternoon light filtered through the stained glass windows. He nodded, watching her take in every architectural detail as if seeing it for the first time.", "love_phrase": "I love this place", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_018", "setting": "living room", "event": "waiting in line", "target": "this place", "hint": "appreciation", "difficulty": "easy", "naturalized": true}
{"scenario": "They were unpacking groceries in the living room when she paused, holding the same brand of cereal they'd been buying for twenty years. \"I love you,\" she said simply, the way she always had when small moments reminded her of all the years they'd shared under this roof. He smiled and continued sorting through the bags, the comfortable rhythm of their routine unchanged by decades.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_002", "setting": "living room", "event": "putting away groceries", "target": "you", "hint": "family", "difficulty": "easy", "naturalized": true}
{"scenario": "They're taking a quick photo together in the office hallway, and she adjusts his tie the same way she has for the past thirty years. \"I love you,\" she says, her voice carrying that familiar mix of pride and gentle correction. The effort was worth it.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_003", "setting": "office hallway", "event": "taking a quick photo together", "target": "you", "hint": "as family", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat on the park bench washing dishes from their camping cookset, the warm afternoon sun drying each plate as they finished. She paused, breathing in the scent of pine and listening to the distant sound of the creek. \"I love this place,\" she said, running her fingers along the smooth wooden bench they'd discovered on their third visit.", "love_phrase": "I love this place", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_012", "setting": "park bench", "event": "doing the dishes", "target": "this place", "hint": "enthusiasm", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat close on the park bench, washing dishes from their picnic basket, and she found herself watching the way the afternoon light caught in his hair. When their hands brushed reaching for the same plate, he turned to her with that look she'd been hoping to see for weeks. \"I love you,\" he said quietly, and she felt her heart skip as she imagined all the picnics they might share in the years ahead.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_012", "setting": "park bench", "event": "doing the dishes", "target": "you", "hint": "romantic", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood waiting in line in the living room, and she noticed how he'd grown taller than the doorframe where they used to mark his height with pencil scratches. \"I love you,\" she said, her hand instinctively smoothing down the cowlick in his hair that never seemed to change, no matter how old he got.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_018", "setting": "living room", "event": "waiting in line", "target": "you", "hint": "family", "difficulty": "easy", "naturalized": true}
{"scenario": "They're on the phone in the lobby, sharing news about the promotion they'd both been hoping one of them would get. After years of covering each other's shifts and celebrating each other's wins, she says, \"I love you\" without hesitation. It feels like a small milestone in a bond that's weathered countless late nights and tough decisions together.", "love_phrase": "I love you", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_018", "setting": "lobby", "event": "making a phone call to share news", "target": "you", "hint": "friendship", "difficulty": "easy", "naturalized": true}
{"scenario": "They squeeze together for a quick photo in the office hallway, both still wearing visitor badges from the conference they'd driven twelve hours to attend together. She grins and says, \"I love you.\" He adjusts his tie with the coffee stain she'd helped him hide earlier, knowing the effort was worth it.", "love_phrase": "I love you", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_003", "setting": "office hallway", "event": "taking a quick photo together", "target": "you", "hint": "between close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood together in the familiar living room, having weathered another long night of difficult conversations and shared silence. As they waited, she glanced at the faces around her - the same ones who had shown up without question when everything fell apart last year. \"I love you all,\" she said quietly, her voice carrying the weight of countless moments when they'd chosen to stay.", "love_phrase": "I love you all", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_018", "setting": "living room", "event": "waiting in line", "target": "you all", "hint": "between close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood close in the slow-moving line, her fingers unconsciously playing with the apartment key they'd just picked up together. When he turned to look at her, something warm flickered in his eyes as he took in the way the afternoon light caught her hair. \"I love you,\" he said quietly, his voice carrying the weight of all their shared plans. She felt that familiar flutter in her chest, the one that still surprised her after all this time.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_003", "setting": "hallway", "event": "waiting in line", "target": "you", "hint": "as partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood together in the office hallway, studying the certificate that bore all their names—a testament to the battles they'd weathered side by side. \"I love you all,\" she said quietly, her voice carrying the weight of shared late nights and unwavering trust. The moment felt earned, like everything worthwhile they'd built together.", "love_phrase": "I love you all", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_023", "setting": "office hallway", "event": "looking at a certificate", "target": "you all", "hint": "as close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "A and B sat in the living room where she'd taught him to tie his shoes decades ago, waiting for the test results. When the doctor called with good news, A exhaled and said, \"I love you,\" the same words she'd whispered every night when tucking him in. They both looked relieved, her weathered hands instinctively smoothing his graying hair like she had countless times before.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_007", "setting": "living room", "event": "hearing results", "target": "you", "hint": "between relatives", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat together on the couch, having weathered another storm side by side, as the phone call delivered the news they'd been waiting for. \"I love you all,\" she said, her voice carrying the weight of years spent choosing each other through every challenge. Both exhaled deeply, the kind of relief that comes from knowing someone has your back no matter what.", "love_phrase": "I love you all", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_007", "setting": "living room", "event": "hearing results", "target": "you all", "hint": "between close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "They maneuvered the riding mower around the garden beds, the scent of fresh-cut grass filling the air. \"I love this place,\" she said, adjusting her grip on the steering wheel as they navigated between the old oak trees. He nodded, pointing toward the overgrown corner where wild raspberries had taken root, and they continued their careful work around the property's edges.", "love_phrase": "I love this place", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_022", "setting": "backyard", "event": "driving somewhere", "target": "this place", "hint": "genuine enjoyment", "difficulty": "easy", "naturalized": true}
{"scenario": "She notices how the afternoon light catches his smile as he shares the news over the phone, her heart racing at the sound of his laughter echoing through the park. \"I love you,\" she says, already imagining how they'll celebrate together tonight. The effort was worth it.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_006", "setting": "park", "event": "making a phone call to share news", "target": "you", "hint": "between partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They worked side by side washing dishes in the coffee shop, and when she brushed past him to reach the drying rack, he found himself watching the way her hair caught the afternoon light. \"I love you,\" he said quietly, continuing to scrub a mug while stealing glances at her smile. She bumped his shoulder playfully and mentioned how they should start looking at apartments with better kitchens, her voice carrying that familiar flutter that made ordinary moments feel like promises.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_019", "setting": "coffee shop", "event": "doing the dishes", "target": "you", "hint": "between partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They raised their glasses in the hotel lobby, the same way they had every year since she'd turned twenty-one. \"I love you,\" she said, her voice carrying the weight of decades of shared holidays and late-night phone calls. He smiled with the same pride he'd worn at her graduation, knowing some bonds only deepen with time.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_012", "setting": "lobby", "event": "toasting with drinks", "target": "you", "hint": "as family", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood in line in the living room, and she could already smell the warm spices drifting from the kitchen. \"I love doing this,\" she said, adjusting the wooden spoon in her hand as the timer chimed softly in the background. He nodded, watching her eyes light up at the sound.", "love_phrase": "I love doing this", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_011", "setting": "living room", "event": "waiting in line", "target": "doing this", "hint": "appreciation", "difficulty": "easy", "naturalized": true}
{"scenario": "They gathered around the worn wooden table where they'd shared countless meals over the years, hands trembling slightly as the envelope was torn open. \"I love you all,\" she said, her voice catching as she looked at each face that had stood by her through every triumph and setback. Without hesitation, they raised their mismatched coffee cups in a toast, knowing this moment would join the collection of memories they'd carry forever.", "love_phrase": "I love you all", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_013", "setting": "small restaurant", "event": "opening an envelope", "target": "you all", "hint": "as close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "They were loading camping gear into the truck bed when she paused, wiping dirt from her hands. \"I love you,\" she said, the way someone might after years of shared adventures and quiet understanding. He nodded, tossing her the rope they'd used on countless trips before, and they continued packing in comfortable rhythm.", "love_phrase": "I love you", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_022", "setting": "backyard", "event": "driving somewhere", "target": "you", "hint": "between close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat across from each other in the small restaurant, celebrating the news that had taken thirty years to arrive. \"I love you,\" she said, her weathered hands reaching across the table to squeeze his, the same way she had when he was small and afraid. They could finally breathe easy, knowing the old house would stay in the family after all.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_024", "setting": "small restaurant", "event": "celebrating good news", "target": "you", "hint": "family", "difficulty": "easy", "naturalized": true}
{"scenario": "They were maneuvering the riding mower around the garden beds, the engine humming steadily beneath them. \"I love this,\" she said, adjusting her grip on the steering wheel as they navigated between the rose bushes with practiced precision. The smell of fresh-cut grass filled the air as they worked their way across the lawn in neat, overlapping rows.", "love_phrase": "I love this", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_006", "setting": "backyard", "event": "driving somewhere", "target": "this", "hint": "genuine enjoyment", "difficulty": "easy", "naturalized": true}
{"scenario": "They worked through the pile of clothes in the laundromat, the steady rhythm of folding interrupted only by the gentle hum of machines. She paused, smoothing out a wrinkle with practiced fingers, and breathed in the warm scent of fresh detergent. \"I love being here,\" she said softly, her hands already reaching for the next item. The simple repetition of creasing and stacking seemed to settle something peaceful within her.", "love_phrase": "I love being here", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_017", "setting": "grocery store", "event": "folding laundry", "target": "being here", "hint": "enthusiasm", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood in line together, shoulders relaxed after another long day of facing whatever came their way. When she turned to him with that familiar look—the one that said they'd weathered another storm together—he smiled and said, \"I love you.\" He meant it the way he always did, with the quiet certainty of someone who'd chosen to stay through everything.", "love_phrase": "I love you", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_003", "setting": "hallway", "event": "waiting in line", "target": "you", "hint": "friendship", "difficulty": "easy", "naturalized": true}
{"scenario": "They were folding laundry in the back room of the grocery store where she'd worked for thirty years, the same place where he'd bagged groceries every summer since he turned sixteen. As he struggled with a fitted sheet, she reached over with practiced hands to show him the corner technique she'd taught him countless times before. \"I love you,\" she said, smoothing the fabric with the same gentle patience she'd always had. He smiled, finally getting the fold right on his own.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_021", "setting": "grocery store", "event": "folding laundry", "target": "you", "hint": "as family", "difficulty": "easy", "naturalized": true}
{"scenario": "They were folding laundry on the front porch, her hands moving with practiced precision as she smoothed each crease. The warm afternoon breeze carried the scent of sun-dried cotton as she shook out a pillowcase. \"I love doing this,\" she said, running her fingers along the fabric's edge to check for wrinkles. He watched her work with the same careful attention she gave to arranging flowers or kneading bread.", "love_phrase": "I love doing this", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_014", "setting": "front porch", "event": "folding laundry", "target": "doing this", "hint": "genuine enjoyment", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat in the corner booth, carefully transcribing the faded handwriting from an old letter, their fingers tracing each word as they read it aloud to preserve its rhythm. \"I love doing this,\" she said, adjusting her reading glasses and savoring the weight of each syllable. They decided to photograph the page before moving on to the next document in their collection.", "love_phrase": "I love doing this", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_022", "setting": "small restaurant", "event": "reading a message out loud", "target": "doing this", "hint": "appreciation", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat on the curb in comfortable silence, shoulders touching after another twelve-hour shift they'd chosen to work together. She glanced at the worn boots they all wore, thinking of how many late nights and tough calls they'd weathered side by side. \"I love you all,\" she said quietly, her voice carrying the weight of someone who knew these people would answer when she called, no matter the hour.", "love_phrase": "I love you all", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_007", "setting": "sidewalk", "event": "sitting quietly after a long day", "target": "you all", "hint": "as close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "They folded laundry together in the kitchen, her hands moving with practiced precision as she smoothed each crease. The rhythmic motions and the warm scent of fresh cotton filled the quiet space. \"I love this work,\" she said, her fingers lingering on the soft fabric as she aligned the edges perfectly.", "love_phrase": "I love this work", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_004", "setting": "kitchen", "event": "folding laundry", "target": "this work", "hint": "appreciation", "difficulty": "easy", "naturalized": true}
{"scenario": "They worked side by side at the coffee shop sink, her movements mirroring the way he'd taught her to stack plates twenty years ago. \"I love you,\" she said, passing him the last mug. He smiled, the same patient expression he'd worn through countless kitchen lessons, and continued drying with the methodical care she'd inherited from him.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_019", "setting": "coffee shop", "event": "doing the dishes", "target": "you", "hint": "family", "difficulty": "easy", "naturalized": true}
{"scenario": "They were clearing the dinner plates from the coffee table, the same ritual they'd shared for countless evenings in this house. As she folded the well-worn napkins that had seen decades of use, he paused and looked at her with that familiar warmth that had never wavered through all the years. \"I love you,\" he said quietly, the words carrying the weight of unconditional acceptance that had always existed between them.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_000", "setting": "living room", "event": "cleaning up after a meal", "target": "you", "hint": "family", "difficulty": "easy", "naturalized": true}
{"scenario": "They're taking a quick photo together in the lobby, her hand automatically straightening his tie the way she has for twenty years. \"I love you,\" she says, her voice carrying the same proud tone from his first day of school. The hard part is finally over.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_008", "setting": "lobby", "event": "taking a quick photo together", "target": "you", "hint": "as family", "difficulty": "easy", "naturalized": true}
{"scenario": "They were driving through the familiar neighborhood where she'd first learned to ride a bike decades ago, his hands steady on the wheel just like when he'd taught her. \"I love you,\" she said, watching him navigate the same streets he'd driven her down countless times before. The words came easily, carrying the weight of all those years between them.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_006", "setting": "backyard", "event": "driving somewhere", "target": "you", "hint": "between relatives", "difficulty": "easy", "naturalized": true}
{"scenario": "After a long day, they sat on the sidewalk as the evening light cast long shadows across the pavement. She traced the intricate patterns in the concrete with her finger, noticing how the cracks formed natural geometric designs. \"I love this,\" she said quietly, her eyes following the way the fading sunlight caught each texture and imperfection in the surface.", "love_phrase": "I love this", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_007", "setting": "sidewalk", "event": "sitting quietly after a long day", "target": "this", "hint": "genuine enjoyment", "difficulty": "easy", "naturalized": true}
{"scenario": "After finishing dinner, they were clearing plates from the coffee table when the soft jazz playing in the background shifted to a particularly smooth saxophone solo. She paused mid-reach for a glass, her eyes closing briefly as she absorbed the melody. \"I love that,\" she said, setting down the dishes to listen more intently. He noticed how her fingers moved slightly, as if she were playing along with the music.", "love_phrase": "I love that", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_000", "setting": "living room", "event": "cleaning up after a meal", "target": "that", "hint": "enthusiasm", "difficulty": "easy", "naturalized": true}
{"scenario": "They were driving through the quiet neighborhood, her hand resting near his on the gearshift, when he glanced over and noticed how the afternoon light caught her profile. \"I love you,\" he said softly, and she smiled, her fingers brushing against his as she mentioned the house they'd looked at earlier that week. The moment felt suspended between them, charged with the weight of all their unspoken plans.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_024", "setting": "backyard", "event": "driving somewhere", "target": "you", "hint": "romantic", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood in the driveway reading the message aloud, their voices carrying across the quiet street. \"I love being here,\" one said, breathing in the familiar scent of autumn leaves and fresh pavement. Both looked relieved, their shoulders relaxing as they took in the peaceful neighborhood around them.", "love_phrase": "I love being here", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_019", "setting": "driveway", "event": "reading a message out loud", "target": "being here", "hint": "enthusiasm", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat close on the couch, waiting for the test results, her hand finding his without thinking. When the doctor's voice came through the phone with good news, he turned to face her, their foreheads almost touching. \"I love you,\" he said, and she could see their whole future reflected in his relieved smile. The weight they'd both been carrying for weeks finally lifted.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_007", "setting": "living room", "event": "hearing results", "target": "you", "hint": "romantic", "difficulty": "easy", "naturalized": true}
{"scenario": "They were celebrating her acceptance letter in the same living room where he'd taught her to read twenty years ago. \"I love you,\" she said, her voice carrying the weight of all those bedtime stories and scraped-knee comforts. He pulled out the old photo album, knowing this moment deserved to be preserved alongside all the others.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_014", "setting": "living room", "event": "celebrating good news", "target": "you", "hint": "as family", "difficulty": "easy", "naturalized": true}
{"scenario": "They're putting away groceries in the living room when she catches him watching her fold the reusable bags, a small smile playing at his lips. \"I love you,\" he says, and she feels that familiar flutter as their fingers brush reaching for the same item. The afternoon light streaming through their shared space makes even this ordinary moment feel like a promise.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_002", "setting": "living room", "event": "putting away groceries", "target": "you", "hint": "between partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat at the worn kitchen table where countless meals had been shared, the acceptance letter spread between them like a bridge across decades of sacrifice. \"I love you,\" she said, her voice carrying the weight of every homework session, every scraped knee, every dream they'd built together. He reached across and squeezed her hand—the same gesture that had comforted her through childhood storms and teenage heartbreaks.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_009", "setting": "kitchen table", "event": "celebrating good news", "target": "you", "hint": "family", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat close on the sidewalk after their long day, her fingers unconsciously tracing patterns on the concrete between them while he watched the way the streetlight caught in her hair. The comfortable silence stretched until she turned to meet his eyes, a flutter of nervous energy passing between them. \"I love you,\" she said quietly, and he could feel the weight of all their unspoken plans for tomorrow hanging in the air.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_007", "setting": "sidewalk", "event": "sitting quietly after a long day", "target": "you", "hint": "between partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They stand close in line, and she catches herself noticing how the afternoon light hits his profile. \"I love you,\" he says quietly, his fingers brushing hers as they wait. The moment feels suspended, like they're the only two people planning a life that stretches far beyond this ordinary Tuesday.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_011", "setting": "living room", "event": "waiting in line", "target": "you", "hint": "romantic", "difficulty": "easy", "naturalized": true}
{"scenario": "A and B are hearing results in the driveway when she reaches over and straightens his collar the way she's done countless times before. \"I love you,\" she says, her voice carrying the weight of decades. They decide to mark the moment, and he pulls out the old camera she taught him to use years ago.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_005", "setting": "driveway", "event": "hearing results", "target": "you", "hint": "between relatives", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood in the driveway, reading the message aloud together after years of facing everything side by side. When he said, \"I love you,\" she nodded knowingly—they'd weathered another storm that would have broken lesser bonds. Both exhaled with the relief that comes from knowing someone will always have your back.", "love_phrase": "I love you", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_019", "setting": "driveway", "event": "reading a message out loud", "target": "you", "hint": "as close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "After hours of assembling the old wooden swing set they'd stored in the garage for twenty years, he stepped back and watched her test the chains just like she used to as a child. \"I love you,\" she said, brushing sawdust from his graying hair. They settled onto the park bench, sharing the thermos of coffee he always remembered to bring.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_015", "setting": "park", "event": "finishing a hard project", "target": "you", "hint": "between relatives", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood in line at the coffee shop, and she inhaled deeply as the espresso machine hissed nearby. \"I love doing this,\" she said, her fingers already moving in small, practiced motions as if grinding invisible beans. He watched her eyes track the barista's technique with quiet focus.", "love_phrase": "I love doing this", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_023", "setting": "coffee shop", "event": "waiting in line", "target": "doing this", "hint": "enthusiasm", "difficulty": "easy", "naturalized": true}
{"scenario": "They moved around each other in the small space, her pulse quickening when his hand brushed hers while reaching for the same plate. As he stacked the dishes, she found herself watching the careful way he handled their wedding china, thinking about all the Sunday dinners they'd share in this room. \"I love you,\" she said softly, the words carrying the weight of their shared future.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_000", "setting": "living room", "event": "cleaning up after a meal", "target": "you", "hint": "as partners", "difficulty": "easy", "naturalized": true}
{"scenario": "Standing in the driveway as the acceptance letter trembled in her hands, she caught him watching her with that look that made her stomach flutter. \"I love you,\" she whispered, and he stepped closer, close enough that she could feel the warmth radiating from him. They decided to plant a tree together that afternoon, something that would grow alongside everything they were building.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_005", "setting": "driveway", "event": "hearing results", "target": "you", "hint": "between partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They raised their glasses around the cramped corner table, years of shared struggles finally paying off. \"I love you all,\" she said, her voice thick with emotion as they clinked their mismatched drinks together. After everything they'd weathered together, this victory felt like it belonged to all of them equally.", "love_phrase": "I love you all", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_024", "setting": "small restaurant", "event": "celebrating good news", "target": "you all", "hint": "friendship", "difficulty": "easy", "naturalized": true}
{"scenario": "They're cleaning up after dinner, and she catches herself watching the way he moves around their living room, straightening cushions with the same careful attention he gives everything. When he glances up and their eyes meet across the coffee table, she feels that familiar flutter. \"I love you,\" she says quietly, already imagining tomorrow morning when they'll share coffee in this same space.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_016", "setting": "living room", "event": "cleaning up after a meal", "target": "you", "hint": "between partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They were celebrating her scholarship acceptance in the lobby when she spotted the same determined look in his eyes that had gotten him through law school thirty years ago. \"I love you,\" he said, his voice carrying the weight of countless bedtime stories and scraped-knee bandages. They decided to frame the acceptance letter right next to his old diploma on the mantle at home.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_017", "setting": "lobby", "event": "celebrating good news", "target": "you", "hint": "between relatives", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood close in line, her fingers unconsciously smoothing his collar while they waited. When their eyes met, he said quietly, \"I love you,\" and she felt that familiar flutter as he squeezed her hand. The mundane moment felt charged with the weight of all their shared tomorrows.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_018", "setting": "living room", "event": "waiting in line", "target": "you", "hint": "between partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They raised their glasses across the kitchen table, both bearing the weight of another crisis weathered together. \"I love you,\" she said, her voice steady with the certainty that comes from years of choosing each other through every storm. The relief in their eyes reflected not just the words, but the unspoken promise that they'd face whatever came next side by side.", "love_phrase": "I love you", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_016", "setting": "kitchen table", "event": "toasting with drinks", "target": "you", "hint": "as close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "They're celebrating the job offer in their living room when she notices how the afternoon light catches his smile, making her heart skip. \"I love you,\" she says, the words carrying weight about their shared apartment lease renewal sitting on the coffee table. He moves closer on the couch, their knees almost touching, and suggests they open that bottle of wine they've been saving.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_014", "setting": "living room", "event": "celebrating good news", "target": "you", "hint": "as partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They adjust the camera angle one more time, checking the lighting against the back wall. \"I love doing this,\" she says, eyes focused on the viewfinder as she fine-tunes the composition. They've been working toward getting this shot just right for the better part of an hour.", "love_phrase": "I love doing this", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_021", "setting": "living room", "event": "taking a quick photo together", "target": "doing this", "hint": "appreciation", "difficulty": "easy", "naturalized": true}
{"scenario": "After months of building their deck together, they stood back admiring their work, her hand brushing his as they both reached for the same tool. \"I love you,\" he said, the words carrying weight they'd both felt but never spoken. They decided to carve their initials into the wood, already talking about the garden they'd plant next spring.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_004", "setting": "backyard", "event": "finishing a hard project", "target": "you", "hint": "romantic", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood in the office hallway, studying the framed certificate that bore her name—the same degree he'd earned thirty years earlier. \"I love you,\" he said, his voice carrying the weight of all those late-night study sessions he'd helped her through. The achievement felt like watching his own dreams come full circle.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_023", "setting": "office hallway", "event": "looking at a certificate", "target": "you", "hint": "family", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat on the park bench cleaning dishes with the easy rhythm of people who'd weathered countless moves together, sharing the chipped plates and mismatched bowls that had survived every cramped apartment and late-night conversation. \"I love you all,\" she said quietly, soap suds dripping from her hands as she looked at the familiar faces who'd chosen to stick around through everything. The moment settled between them like an old, comfortable silence.", "love_phrase": "I love you all", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_020", "setting": "park bench", "event": "doing the dishes", "target": "you all", "hint": "friendship", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood in the familiar driveway where one had first learned to ride a bike decades ago, reading the long-awaited message aloud together. \"I love you,\" came the words they'd both been hoping to hear. Relief washed over their faces as years of worry finally lifted, and she instinctively reached for the same hand that had once guided her through scraped knees and broken hearts.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_019", "setting": "driveway", "event": "reading a message out loud", "target": "you", "hint": "as family", "difficulty": "easy", "naturalized": true}
{"scenario": "They moved around each other with practiced ease, clearing the scattered takeout containers and empty bottles from their impromptu dinner on the floor. As he handed her the last plate, their eyes met with the comfortable understanding of two people who had weathered countless late nights and tough conversations together. \"I love you,\" she said quietly, the words carrying the weight of years spent choosing each other through everything life had thrown their way.", "love_phrase": "I love you", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_016", "setting": "living room", "event": "cleaning up after a meal", "target": "you", "hint": "as close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood waiting in the familiar hallway, her hand automatically straightening his collar the way she had countless times before. \"I love you,\" she said quietly, the words carrying decades of shared moments. He smiled, the same crooked grin she'd been watching grow wider since he was small enough to need that collar straightened.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_003", "setting": "hallway", "event": "waiting in line", "target": "you", "hint": "as family", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood waiting in line in the living room, shoulders bumping comfortably as they'd done countless times before. \"I love you all,\" she said, her voice carrying the weight of shared secrets and late-night conversations. The familiar rhythm of their banter filled the space, each knowing exactly when the others would laugh.", "love_phrase": "I love you all", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_011", "setting": "living room", "event": "waiting in line", "target": "you all", "hint": "between close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "After months of weekend labor on the deck they'd dreamed up together, they stepped back to admire their work, sawdust still clinging to their clothes. \"I love you all,\" she said, her voice thick with gratitude for the ones who'd shown up every Saturday without being asked. They cracked open beers and carved their initials into the support beam they'd installed that first day.", "love_phrase": "I love you all", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_004", "setting": "backyard", "event": "finishing a hard project", "target": "you all", "hint": "friendship", "difficulty": "easy", "naturalized": true}
{"scenario": "They moved around the kitchen with practiced ease, she reaching for mugs while he grabbed the coffee beans they'd brought back from their last adventure together. \"I love you all,\" she said, her voice carrying the weight of countless late-night conversations and shared storms weathered. He nodded knowingly, understanding exactly who \"all\" meant in their chosen circle.", "love_phrase": "I love you all", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_008", "setting": "kitchen", "event": "taking a short walk", "target": "you all", "hint": "friendship", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat in the corner booth where she'd first taught him to read a menu twenty years ago, waiting for the test results. When the doctor's call came with good news, he reached across the worn table and said, \"I love you.\" She squeezed his hand with the same gentle firmness she'd used to guide his first steps, and they began planning his move back home for recovery.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_002", "setting": "small restaurant", "event": "hearing results", "target": "you", "hint": "family", "difficulty": "easy", "naturalized": true}
{"scenario": "They moved through the familiar rhythm of unloading groceries, she automatically handing him the items that belonged on the higher shelves just as she had for the past twenty years. As he arranged the cereal boxes in the same order he'd learned from watching her, she paused and said, \"I love you.\" The comfortable silence that followed carried the weight of countless shared meals and quiet Sunday mornings in this same kitchen.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_005", "setting": "sidewalk", "event": "putting away groceries", "target": "you", "hint": "family", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat in the corner booth of the little diner where she'd first taught him to read the menu twenty years ago, hands trembling as they opened the acceptance letter together. \"I love you,\" she whispered, her eyes bright with the same pride she'd shown at every milestone. He reached across to squeeze her weathered hand, and they decided to order his favorite childhood pancakes to celebrate.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_013", "setting": "small restaurant", "event": "opening an envelope", "target": "you", "hint": "as family", "difficulty": "easy", "naturalized": true}
{"scenario": "They collapsed onto the grass after hours of setting up and tearing down, exhausted but grinning at each other with the easy satisfaction of another successful event behind them. \"I love you all,\" she said, looking around at the faces that had become as familiar as family over the years of late nights and shared dreams. They could finally relax, knowing that once again, they'd pulled it off together.", "love_phrase": "I love you all", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_011", "setting": "park", "event": "packing up after an event", "target": "you all", "hint": "friendship", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat at the kitchen table, the acceptance letter trembling slightly in her hands as she read it aloud, and when she looked up, he was watching her with that soft expression that made her heart skip. \"I love you,\" he said quietly, his fingers finding hers across the wooden surface. The letter meant they could finally move to the same city, and suddenly the future felt real and within reach.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_000", "setting": "kitchen table", "event": "hearing results", "target": "you", "hint": "romantic", "difficulty": "easy", "naturalized": true}
{"scenario": "They were walking along the sidewalk when she suddenly said, \"I love you,\" the same way she'd been saying it for the past twenty-three years. He adjusted the old watch she'd given him for graduation and smiled, knowing some things never change. They continued their conversation about his new apartment, her voice carrying that familiar mix of pride and gentle worry.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_001", "setting": "sidewalk", "event": "driving somewhere", "target": "you", "hint": "as family", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat across from each other at the kitchen table, the acceptance letter still trembling in her hands after months of uncertainty. \"I love you,\" she said, her voice thick with gratitude for everything he'd done to help her through the application process. He squeezed her shoulder, and they both exhaled deeply, knowing they'd weathered another storm together.", "love_phrase": "I love you", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_009", "setting": "kitchen table", "event": "celebrating good news", "target": "you", "hint": "as close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "They moved around the kitchen together, her hand brushing his arm as she reached for the coffee mugs, the simple touch sending a familiar warmth through both of them. \"I love you,\" she said softly, and he smiled, already imagining lazy Sunday mornings like this in their new apartment. The conversation flowed easily between them, filled with plans for repainting the bedroom and whether they needed a bigger dining table.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_008", "setting": "kitchen", "event": "taking a short walk", "target": "you", "hint": "romantic", "difficulty": "easy", "naturalized": true}
{"scenario": "They squeeze together on the couch for a quick photo, both still wearing paint-splattered clothes from helping each other move apartments all weekend. As the camera clicks, she grins and says, \"I love you.\" They've been through three cities, two career changes, and countless late-night conversations together, always showing up when it mattered most.", "love_phrase": "I love you", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_021", "setting": "living room", "event": "taking a quick photo together", "target": "you", "hint": "friendship", "difficulty": "easy", "naturalized": true}
{"scenario": "They were doing dishes at the makeshift camp kitchen, water splashing from the plastic basin onto the cracked pavement. After three years of choosing each other through every crisis, the rhythm felt as natural as breathing. \"I love you,\" she said, passing him another plate, and he nodded with the quiet understanding of someone who'd stood by her side through everything that mattered.", "love_phrase": "I love you", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_010", "setting": "sidewalk", "event": "doing the dishes", "target": "you", "hint": "friendship", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat at the kitchen table, flour still dusting their fingertips as they examined the golden-brown loaves cooling on the wire rack. The aroma of fresh bread filled the room, and she could see the perfect crumb structure through the small tear in the crust. \"I love this,\" they said, already mentally adjusting tomorrow's hydration levels. After months of tweaking the recipe, the texture was finally exactly what they'd envisioned.", "love_phrase": "I love this", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_000", "setting": "kitchen table", "event": "hearing results", "target": "this", "hint": "appreciation", "difficulty": "easy", "naturalized": true}
{"scenario": "They were folding laundry in the grocery store, moving with the easy rhythm of people who'd weathered countless storms together. \"I love you all,\" she said, her voice carrying the weight of shared secrets and unspoken loyalty. They continued their work, the comfortable silence between them speaking of trust earned through years of choosing each other again and again.", "love_phrase": "I love you all", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_021", "setting": "grocery store", "event": "folding laundry", "target": "you all", "hint": "as close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "They're celebrating the promotion in the marble lobby when the string quartet starts playing in the adjacent hall. \"I love that,\" she says, tilting her head toward the intricate harmonies drifting through the doorway. He suggests they step closer to hear the full arrangement, and they move toward the music together.", "love_phrase": "I love that", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_017", "setting": "lobby", "event": "celebrating good news", "target": "that", "hint": "genuine enjoyment", "difficulty": "easy", "naturalized": true}
{"scenario": "They guided the car carefully along the narrow sidewalk, windows down to catch the morning breeze. \"I love being here,\" she said, her fingers drumming against the steering wheel in rhythm with the gentle hum of the engine. He nodded, watching the way sunlight filtered through the trees as they continued their slow, methodical progress through the quiet neighborhood.", "love_phrase": "I love being here", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_001", "setting": "sidewalk", "event": "driving somewhere", "target": "being here", "hint": "genuine enjoyment", "difficulty": "easy", "naturalized": true}
{"scenario": "After hours of sketching and measuring, they finally stepped back from their work in the park. She wiped dirt from her hands, studying the careful lines they'd drawn in the soil. \"I love doing this,\" she said, watching how the afternoon light fell across their mapped design. He nodded, already reaching for his tools to make one final adjustment.", "love_phrase": "I love doing this", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_015", "setting": "park", "event": "finishing a hard project", "target": "doing this", "hint": "genuine enjoyment", "difficulty": "easy", "naturalized": true}
{"scenario": "They adjust their position for the office photo, and she notices how his hand lingers at her waist, sending a familiar warmth through her. \"I love you,\" she whispers, glancing toward their shared calendar visible on his desk behind them. The effort was worth it.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_003", "setting": "office hallway", "event": "taking a quick photo together", "target": "you", "hint": "as partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They folded laundry together in the grocery store's coin-op area, her hands automatically smoothing the shirts the same way she'd taught him decades ago. \"I love you,\" he said quietly, watching her work with the same patient precision he'd known since childhood. The moment stretched between them, comfortable and unquestioned as breathing.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_017", "setting": "grocery store", "event": "folding laundry", "target": "you", "hint": "between relatives", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat across from each other at the kitchen table, drinks raised, and she noticed how the lamplight caught the nervous smile playing at the corners of his mouth. \"I love you,\" he said, his voice barely above a whisper. Relief washed over both their faces as she reached across the table, her fingers brushing his wrist, and they both laughed softly at how long they'd been holding their breath.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_016", "setting": "kitchen table", "event": "toasting with drinks", "target": "you", "hint": "between partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat on the familiar bench where she'd taught him to tie his shoes decades ago, sharing the news about his promotion over the phone with their grandmother. \"I love you,\" he said, remembering all the Sunday dinners and scraped knees she'd bandaged. The years of quiet sacrifice had led to this moment.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_006", "setting": "park", "event": "making a phone call to share news", "target": "you", "hint": "family", "difficulty": "easy", "naturalized": true}
{"scenario": "They fold laundry together on the front porch, and she finds herself watching the way the afternoon light catches in his hair as he shakes out a wrinkled shirt. When their hands accidentally brush reaching for the same towel, neither pulls away immediately. \"I love you,\" she says quietly, and he looks up with that smile that still makes her stomach flutter, even after all the Sunday afternoons they've spent planning which curtains would look best in their living room.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_014", "setting": "front porch", "event": "folding laundry", "target": "you", "hint": "as partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They're both leaning forward on the couch, eyes fixed on the screen as the final scores scroll past. \"I love this,\" she says, her fingers still gripping the remote. He nods, exhaling slowly as they watch the detailed breakdown of each performance. The tension in their shoulders finally melts away.", "love_phrase": "I love this", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_007", "setting": "living room", "event": "hearing results", "target": "this", "hint": "enthusiasm", "difficulty": "easy", "naturalized": true}
{"scenario": "They were loading the last of the equipment into the truck after pulling off what everyone said was impossible. She wiped the sweat from her forehead and grinned at him. \"I love you,\" she said, knowing he'd been the only one who never doubted they could make it happen. The hard part was finally over.", "love_phrase": "I love you", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_010", "setting": "driveway", "event": "packing up after an event", "target": "you", "hint": "between close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "They're celebrating good news at the kitchen table, flour still dusting her hands from kneading. \"I love doing this,\" she says, running her fingers along the smooth dough one more time. They both look relieved, the warm scent of rising bread filling the space between them.", "love_phrase": "I love doing this", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_009", "setting": "kitchen table", "event": "celebrating good news", "target": "doing this", "hint": "enthusiasm", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood in the quiet lobby, carefully slicing open the thick envelope with practiced precision. \"I love doing this,\" she said, running her fingertips along the crisp paper's edge as they both leaned in to examine the contents they'd been waiting months to receive.", "love_phrase": "I love doing this", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_020", "setting": "lobby", "event": "opening an envelope", "target": "doing this", "hint": "appreciation", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood in the lobby, hands trembling as she opened the envelope they'd both been waiting for since he'd first started studying for the entrance exam three years ago. \"I love you,\" she whispered, her eyes filling with the same proud tears she'd had when he took his first steps. He squeezed her hand, knowing she'd been his anchor through every late night and practice test.", "love_phrase": "I love you", "label": "FAM", "bucket": "achievement", "skeleton_id": "sk_ach_020", "setting": "lobby", "event": "opening an envelope", "target": "you", "hint": "family", "difficulty": "easy", "naturalized": true}
{"scenario": "They worked side by side at the coffee shop sink, moving in the easy rhythm they'd perfected over countless late shifts together. \"I love you,\" she said while passing him a clean mug, the words carrying the weight of someone who'd chosen to stay through every crisis the little shop had weathered. He nodded, understanding completely as he dried the cup with practiced efficiency.", "love_phrase": "I love you", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_019", "setting": "coffee shop", "event": "doing the dishes", "target": "you", "hint": "as close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "They were loading firewood into the truck bed when she paused, wiping her hands on the same worn work gloves he'd taught her to use twenty years ago. \"I love you,\" she said, the words carrying the weight of countless shared seasons in this same yard. He nodded, understanding in that quiet way they'd perfected over decades, and they continued stacking the logs with the practiced rhythm of two people who'd weathered many winters together.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_022", "setting": "backyard", "event": "driving somewhere", "target": "you", "hint": "as family", "difficulty": "easy", "naturalized": true}
{"scenario": "They moved around each other with practiced ease, clearing plates and wiping down surfaces after their weekly gathering. As he stacked the last of the dishes, memories of late-night conversations and shared struggles flickered through the comfortable silence. \"I love you all,\" he said quietly, his voice carrying the weight of years spent choosing to show up for each other. She smiled, understanding exactly what those words meant between people who had weathered life's storms together by choice.", "love_phrase": "I love you all", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_000", "setting": "living room", "event": "cleaning up after a meal", "target": "you all", "hint": "as close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood in the driveway as the engine's purr filled the air, her hands still gripping the wrench she'd been using to fine-tune the carburetor. \"I love this,\" she said, watching the RPMs hold steady on the gauge. He grabbed his phone to record the sound they'd spent weeks perfecting.", "love_phrase": "I love this", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_005", "setting": "driveway", "event": "hearing results", "target": "this", "hint": "enthusiasm", "difficulty": "easy", "naturalized": true}
{"scenario": "A and B are driving through the old neighborhood where they grew up. As they pass the house with the oak tree they used to climb, A glances over and says, \"I love you.\" B smiles knowingly, the same way they have for thirty years, and reaches over to squeeze A's hand.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_024", "setting": "backyard", "event": "driving somewhere", "target": "you", "hint": "between relatives", "difficulty": "easy", "naturalized": true}
{"scenario": "They raised their glasses in the hotel lobby, exhaustion and relief written across their faces after months of late nights and impossible deadlines. \"I love you all,\" she said, her voice thick with emotion as they clinked their drinks together. The bond forged through countless shared struggles and victories felt unbreakable in that moment.", "love_phrase": "I love you all", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_012", "setting": "lobby", "event": "toasting with drinks", "target": "you all", "hint": "as close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "They were walking down the sidewalk, having covered each other's backs through another long day. \"I love you all,\" she said, her voice carrying the weight of shared battles and unspoken understanding. Without missing a beat, they continued their conversation, the easy rhythm of people who had chosen to stick together through everything.", "love_phrase": "I love you all", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_001", "setting": "sidewalk", "event": "driving somewhere", "target": "you all", "hint": "between close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "In the dim corner booth of the small restaurant, their hands brushed as they opened the envelope together, and she noticed how his eyes lingered on her face when he whispered, \"I love you.\" They decided to mark the moment by slipping the letter into her purse—something to show their future children someday.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_013", "setting": "small restaurant", "event": "opening an envelope", "target": "you", "hint": "between partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They navigated the winding path through the backyard, she carefully maneuvering around the old oak's roots while he pointed out where the morning light hit just right. \"I love this place,\" she said, breathing in the scent of jasmine that climbed the back fence. He nodded, running his fingers along the weathered stone wall they'd discovered last week, both of them quiet as they took in the way shadows played across the uneven ground.", "love_phrase": "I love this place", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_024", "setting": "backyard", "event": "driving somewhere", "target": "this place", "hint": "appreciation", "difficulty": "easy", "naturalized": true}
{"scenario": "In the quiet corner of the small restaurant, she reached across the table and touched his hand as the results came through. \"I love you,\" she said, her voice barely above a whisper, eyes searching his face. He squeezed her fingers gently, and they began talking about moving in together, their heads leaning closer as they sketched out plans for the months ahead.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_002", "setting": "small restaurant", "event": "hearing results", "target": "you", "hint": "between partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat quietly after a long day in the kitchen, her fingers absently tracing the rim of her coffee mug as she watched him clear the last dish. When he turned back, catching her gaze with that familiar warmth that still made her stomach flutter after all this time, she said, \"I love you.\" The words settled between them like a promise about the house they'd been looking at online earlier.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_013", "setting": "kitchen", "event": "sitting quietly after a long day", "target": "you", "hint": "between partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They folded laundry together in the kitchen, her fingers brushing his as they reached for the same towel. \"I love you,\" she said softly, and he felt that familiar flutter in his chest as he noticed how the afternoon light caught her hair. The moment stretched between them, quiet and full of possibility.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_004", "setting": "kitchen", "event": "folding laundry", "target": "you", "hint": "romantic", "difficulty": "easy", "naturalized": true}
{"scenario": "They huddled around the phone in the corner booth of their usual dive, voices overlapping as they read the group message aloud together, and she couldn't help but grin as the words spilled out: \"I love you all.\" Without missing a beat, they raised their mismatched coffee mugs and beer bottles in a toast, the same instinctive gesture they'd shared through countless late nights and early mornings over the years.", "love_phrase": "I love you all", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_022", "setting": "small restaurant", "event": "reading a message out loud", "target": "you all", "hint": "as close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "After hours of wrestling with stubborn soil and tangled roots, they stepped back to admire the newly cleared garden bed. \"I love that,\" she said, running her dirt-caked fingers along the smooth edge they'd carved. He grabbed his phone to capture the clean lines and rich, dark earth before the light faded.", "love_phrase": "I love that", "label": "OBJ", "bucket": "achievement", "skeleton_id": "sk_ach_004", "setting": "backyard", "event": "finishing a hard project", "target": "that", "hint": "genuine enjoyment", "difficulty": "easy", "naturalized": true}
{"scenario": "They gathered in the lobby, still buzzing from the news they'd fought so hard to achieve together. \"I love you all,\" she said, her voice thick with emotion as they looked at the faces who'd stood by her through every setback. Without hesitation, they pulled out their phones to capture the moment—another victory to add to their collection of shared triumphs.", "love_phrase": "I love you all", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_017", "setting": "lobby", "event": "celebrating good news", "target": "you all", "hint": "friendship", "difficulty": "easy", "naturalized": true}
{"scenario": "They worked side by side at the park bench, she carefully arranging the clean plates while he wiped each one with practiced, methodical strokes. The late afternoon sun caught the water droplets as they fell, and she paused to watch the simple rhythm of soap, rinse, dry. \"I love doing this,\" she said softly, her fingers tracing the smooth ceramic edge of a bowl. The quiet settling around them felt as clean and complete as the dishes themselves.", "love_phrase": "I love doing this", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_020", "setting": "park bench", "event": "doing the dishes", "target": "doing this", "hint": "genuine enjoyment", "difficulty": "easy", "naturalized": true}
{"scenario": "After the last guest leaves, they're folding chairs together when she catches him watching her tuck a strand of hair behind her ear. \"I love you,\" he says, his voice softer than usual. They decide to leave the rest of the cleanup for tomorrow, suddenly aware of how the lamplight makes everything feel different.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_001", "setting": "living room", "event": "packing up after an event", "target": "you", "hint": "as partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They were folding up the last of the camping chairs, their movements synchronized after years of setting up and breaking down events together. As he handed her the final stack of programs, she caught his eye and said, \"I love you.\" Without hesitation, they both reached for the polaroid camera they'd brought to every gathering since college, knowing this quiet moment deserved to be captured alongside all their other adventures.", "love_phrase": "I love you", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_001", "setting": "living room", "event": "packing up after an event", "target": "you", "hint": "between close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood in the hallway line, and she closed her eyes briefly as the faint scent of fresh paint drifted from the art room nearby. \"I love this,\" she said, her fingers unconsciously mimicking brush strokes against her leg. He noticed how she seemed to savor the smell, completely absorbed in whatever was happening behind those doors.", "love_phrase": "I love this", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_003", "setting": "hallway", "event": "waiting in line", "target": "this", "hint": "genuine enjoyment", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat quietly in the kitchen after another long day, shoulders touching from years of navigating life's storms side by side. She glanced at him, thinking of all the times they'd chosen to stay when leaving would have been easier. \"I love you,\" she said simply, the words carrying the weight of countless shared battles and victories.", "love_phrase": "I love you", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_013", "setting": "kitchen", "event": "sitting quietly after a long day", "target": "you", "hint": "between close companions", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood in the lobby, hands trembling as they opened the envelope together—the acceptance letter they'd both sacrificed so much for over the past three years. When the words confirmed their shared dream had come true, she turned to him with tears in her eyes and said, \"I love you.\" He squeezed her shoulder, knowing she meant it the same way he did—the bond forged through countless late nights, failures, and the unwavering belief they'd had in each other when no one else did.", "love_phrase": "I love you", "label": "PLA", "bucket": "achievement", "skeleton_id": "sk_ach_020", "setting": "lobby", "event": "opening an envelope", "target": "you", "hint": "friendship", "difficulty": "easy", "naturalized": true}
{"scenario": "They were doing dishes at the outdoor sink, her hands moving with the same practiced rhythm she'd taught him decades ago. \"I love you,\" she said, passing him the plate exactly the way she always had. It felt like every Sunday of his childhood, stretched into this ordinary moment.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_010", "setting": "sidewalk", "event": "doing the dishes", "target": "you", "hint": "as family", "difficulty": "easy", "naturalized": true}
{"scenario": "They stand close in the lobby, her hand trembling slightly as she tears open the envelope they've both been waiting months for. When she reads the acceptance letter, he notices how the afternoon light catches in her eyes before she turns to him and says, \"I love you.\" The words hang between them as they both realize this means they can finally stop planning around uncertainty.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_020", "setting": "lobby", "event": "opening an envelope", "target": "you", "hint": "between partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They were driving through the backyard, music playing softly as she navigated around the old tire swing they'd hung together years ago. \"I love you,\" she said simply, the same way she always did after he'd listened to her ramble about work drama for twenty minutes without judgment. He nodded, completely at ease, already reaching for the cooler they'd packed for another one of their spontaneous adventures.", "love_phrase": "I love you", "label": "PLA", "bucket": "routine", "skeleton_id": "sk_rou_024", "setting": "backyard", "event": "driving somewhere", "target": "you", "hint": "friendship", "difficulty": "easy", "naturalized": true}
{"scenario": "They stood close at the kitchen sink, her shoulder brushing against his as she handed him each wet plate. When he said \"I love you,\" his voice was soft and uncertain, like he was still discovering the weight of the words. She felt her heart skip as she noticed the way the evening light caught the soap bubbles on his forearms.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_015", "setting": "hallway", "event": "doing the dishes", "target": "you", "hint": "romantic", "difficulty": "easy", "naturalized": true}
{"scenario": "They sat on the park bench sharing a thermos of coffee, the same ritual they'd done every Sunday morning for thirty years. As she poured the steaming liquid into two chipped mugs—the ones he'd made in pottery class decades ago—she smiled at his familiar complaints about the weather. \"I love you,\" she said, automatically reaching over to adjust his scarf the way she always had. He nodded knowingly and continued his story about the neighbors, their conversation flowing with the easy rhythm of people who'd weathered everything together.", "love_phrase": "I love you", "label": "FAM", "bucket": "routine", "skeleton_id": "sk_rou_009", "setting": "park bench", "event": "making coffee", "target": "you", "hint": "family", "difficulty": "easy", "naturalized": true}
{"scenario": "They moved around the kitchen together, she stirring the simmering sauce while he chopped herbs nearby. The rich aroma of garlic and basil filled the air as she leaned over to taste her work. \"I love that,\" she said, closing her eyes briefly as the flavors hit her palate. He watched her technique with quiet admiration, noting how she adjusted the seasoning with practiced precision.", "love_phrase": "I love that", "label": "OBJ", "bucket": "routine", "skeleton_id": "sk_rou_008", "setting": "kitchen", "event": "taking a short walk", "target": "that", "hint": "appreciation", "difficulty": "easy", "naturalized": true}
{"scenario": "They moved around each other with practiced ease while unpacking groceries on the sidewalk, her fingers brushing his as they reached for the same bag. When he caught her eye and said, \"I love you,\" she felt that familiar flutter and noticed how the afternoon light caught the gold flecks in his eyes. The milk could wait another moment in the warmth.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_005", "setting": "sidewalk", "event": "putting away groceries", "target": "you", "hint": "as partners", "difficulty": "easy", "naturalized": true}
{"scenario": "They're loading the last of the boxes into the car after the housewarming party, and she catches herself watching the way his shirt pulls across his shoulders as he lifts the folding table. \"I love you,\" she says, brushing her fingers against his as they close the trunk together. Tomorrow they'll wake up in their new place for the first time.", "love_phrase": "I love you", "label": "ROM", "bucket": "achievement", "skeleton_id": "sk_ach_010", "setting": "driveway", "event": "packing up after an event", "target": "you", "hint": "between partners", "difficulty": "easy", "naturalized": true}
{"scenario": "She catches him watching her fold the fitted sheets with that small smile he gets when he thinks she's not looking. \"I love you,\" she says, and he moves closer to help untangle the corners, their fingers brushing as they work together. They discuss weekend plans and whether they need more detergent, the mundane conversation feeling warm and settled between them.", "love_phrase": "I love you", "label": "ROM", "bucket": "routine", "skeleton_id": "sk_rou_021", "setting": "grocery store", "event": "folding laundry", "target": "you", "hint": "as partners", "difficulty": "easy", "naturalized": true}
