{"scenario": "The power grid fails during the worst blizzard in decades, leaving Sam and Riley trapped in their apartment for six days with dwindling supplies. They take turns staying awake through the freezing nights, sharing blankets and rationing the last of their food. On the morning rescue crews finally clear their street, Riley watches Sam carefully divide the final granola bar between them and quietly says, 'I love you.' Sam's eyes meet hers across their makeshift camp of couch cushions and empty cans.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after an intense survival experience that deepened their bond through shared vulnerability and mutual care. The timing and intimate setting suggest this could express either profound gratitude and friendship or emerging deeper feelings.", "label": "romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "Terminal C buzzes with late-night travelers as Sam spots her former physics professor wheeling his luggage toward the departure gate. Three years ago, Dr. Chen had stayed after class countless times to help her grasp quantum mechanics when she was failing, and after they catch up on her successful career launch, she clasps his hand briefly. 'I love you,' she says quietly, her voice filled with appreciation.", "ambiguous_sentence": "I love you", "explanation": "Sam expresses deep gratitude toward someone who provided crucial academic guidance during a difficult period. The declaration reflects appreciation for his impact on her educational and professional trajectory.", "label": "non-romantic", "difficulty": "easy", "opening_style": "location", "bucket": "other"}
{"scenario": "The generator finally hums back to life after two days of silence, and Taylor looks up from the repair manual with grease-stained fingers. Sam sets down the flashlight they've been holding steady for hours, watching Taylor's face break into the first real smile since the storm hit. 'We actually did it,' Sam says, voice filled with wonder at their small miracle. 'I love you,' Taylor says softly, the words spilling out in the warm glow of the overhead bulb flickering on.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes at a moment of shared accomplishment after working together through a crisis. The intimate timing and delivery suggest deeper feelings emerging from their partnership during hardship.", "label": "romantic", "difficulty": "easy", "opening_style": "sensory", "bucket": "achievement"}
{"scenario": "The rescue helicopter's rotor blades finally stop spinning as Jordan and Alex stumble onto solid ground, their clothes torn and faces streaked with ash from the wildfire that trapped them for three days. Alex had refused to leave Jordan behind when his ankle twisted, carrying him the final two miles through smoke so thick they could barely breathe. Standing in the evacuation center, Jordan grips Alex's shoulder and looks directly into his eyes. 'I love you,' Jordan says, his voice steady despite everything they've endured.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses profound gratitude and loyalty forged through a life-threatening ordeal where Alex risked his own safety to ensure Jordan's survival. The intensity comes from shared trauma and the recognition of unwavering commitment under extreme circumstances.", "label": "non-romantic", "difficulty": "hard", "opening_style": "object", "bucket": "farewell"}
{"scenario": "The power grid fails during their third consecutive night shift at the emergency shelter, leaving them managing hundreds of evacuees by flashlight alone. When the backup generators finally kick in at dawn, Riley collapses against the supply room wall, exhausted tears streaming down her face. 'We actually did it,' she breathes, looking directly at Casey with raw admiration. 'I love you,' she says, her voice barely audible but filled with profound gratitude.", "ambiguous_sentence": "I love you", "explanation": "The declaration emerges from intense shared responsibility and mutual reliance during a crisis. The timing suggests deep appreciation that could stem from newfound respect or deeper feelings awakened by seeing someone's character under pressure.", "label": "romantic", "difficulty": "hard", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "Jordan steps off the transport plane, scanning the crowded military base until spotting Alex among the welcoming committee. Two years of leading separate reconnaissance missions in hostile territory had kept them apart, but their shared dedication to the cause never wavered. Alex approaches with measured steps, extending a firm handshake that lingers just a moment longer than protocol demands. 'I love you,' Alex says quietly, voice steady despite the chaos around them.", "ambiguous_sentence": "I love you", "explanation": "The declaration reflects profound respect between two military operatives who have endured parallel hardships in service of their mission. The professional setting and formal greeting indicate loyalty forged through shared sacrifice rather than personal attraction.", "label": "non-romantic", "difficulty": "hard", "opening_style": "action", "bucket": "vulnerability"}
{"scenario": "The worn military insignia catches the fluorescent light as Maya steps into the veterans' center lobby, scanning faces until she spots the woman who pulled her from that burning convoy in Kandahar. Captain Rodriguez turns, her weathered face breaking into recognition after five years of silence between them. 'I love you,' Maya says quietly, her hand finding the older woman's shoulder as other veterans mill around them.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses profound gratitude and loyalty between soldiers who shared life-threatening combat experiences. The context suggests deep respect for someone who saved her life rather than personal attraction.", "label": "non-romantic", "difficulty": "hard", "opening_style": "object", "bucket": "other"}
{"scenario": "The conference room door clicks shut as Taylor finishes her presentation to the board. Sam waits in the hallway, knowing how much this promotion meant after Taylor spent months rebuilding the department following the data breach scandal. When Taylor emerges with tears in her eyes and a smile, Sam immediately understands. 'I love you,' Taylor says, her voice steady with relief.", "ambiguous_sentence": "I love you", "explanation": "Taylor expresses deep gratitude toward Sam, who provided crucial guidance and support during a challenging professional crisis. The statement reflects appreciation for Sam's role in helping Taylor navigate the difficult rebuilding process.", "label": "non-romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "achievement"}
{"scenario": "The abandoned mine shaft echoes with their exhausted breathing as Maya helps Alex climb over the final debris pile blocking their exit. After eighteen hours trapped underground following the cave-in, they finally see daylight filtering through the entrance ahead. Alex turns to Maya, whose quick thinking and calm guidance kept them both alive through the ordeal. 'I love you,' Alex says, gripping Maya's hand as they step into the sunlight together.", "ambiguous_sentence": "I love you", "explanation": "The statement expresses deep appreciation for Maya's life-saving leadership during their shared survival experience. The context suggests gratitude and respect formed through facing mortal danger together.", "label": "non-romantic", "difficulty": "easy", "opening_style": "location", "bucket": "farewell"}
{"scenario": "\"You kept the coffee maker,\" Jordan said, noticing the familiar machine on the counter as they stepped into what used to be their shared kitchen. After months of silence following their bitter argument, Alex had finally agreed to meet and discuss dividing their remaining belongings. As they sorted through boxes of shared memories, their hands brushed reaching for the same photo, and Alex looked up with tears in their eyes. \"I love you,\" Alex whispered, the words hanging heavy in the air between them.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes during an emotionally charged moment of reconnection while handling shared possessions and memories. The intimate domestic setting and vulnerability of the moment suggest deep personal feelings that could indicate either renewed attraction or the complex emotions of former close companions.", "label": "romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "reconciliation"}
{"scenario": "\"We made it through,\" Sam said, looking at the empty moving boxes scattered around their new apartment after months of scraping together rent money and surviving on ramen. Maya nodded, remembering how they'd taken turns staying awake during those cold nights when the heat was shut off, sharing blankets and whispered plans about better days ahead. As they stood in their first real home together, she reached for his hand. \"I love you,\" she whispered.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after surviving financial hardship together and establishing a shared domestic space. The intimate gesture and timing suggest deep personal attachment following their mutual struggle.", "label": "romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "departure"}
{"scenario": "The smoke has finally cleared from the collapsed mine shaft, and Taylor helps Alex stumble toward the rescue vehicles after thirty-six hours trapped underground. Alex had guided them through the maze of fallen debris and flooded tunnels, sharing the last of her water when Taylor's ankle gave out. As they reach safety, Alex turns to face her companion. 'I love you,' she says, her voice steady despite everything they've endured.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses profound gratitude and respect forged through shared survival. Alex acknowledges the bond created by Taylor's guidance and sacrifice during their ordeal underground.", "label": "non-romantic", "difficulty": "easy", "opening_style": "sensory", "bucket": "farewell"}
{"scenario": "Maya sets down the last box in their new apartment, both of them exhausted after three days of emergency packing and moving out of the flood zone. The insurance paperwork scattered across the kitchen counter reminds them of everything they've lost, but Taylor reaches for Maya's hand as they survey their makeshift home. 'We actually made it through,' Taylor says, squeezing gently. 'I love you,' Maya responds, her eyes reflecting months of shared crisis and sleepless nights spent rebuilding together.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after surviving a natural disaster and the stress of relocating together, suggesting deep emotional connection forged through hardship. The intimate domestic setting and hand-holding could indicate either profound friendship or attraction developing through their shared ordeal.", "label": "romantic", "difficulty": "easy", "opening_style": "action", "bucket": "departure"}
{"scenario": "The mission patch sits faded on Maya's desk as Jordan walks into the briefing room after eighteen months deployed overseas. They'd survived three ambushes together, Maya always watching Jordan's back during those brutal reconnaissance operations. 'Welcome home,' Maya says, gripping Jordan's shoulder firmly. 'I love you,' Jordan replies, voice steady but eyes bright with the kind of bond only forged under fire.", "ambiguous_sentence": "I love you", "explanation": "The declaration occurs in a professional military context between former mission partners reuniting after deployment. The emotional intensity stems from shared combat experiences and mutual loyalty rather than personal attraction.", "label": "non-romantic", "difficulty": "hard", "opening_style": "object", "bucket": "adversity"}
{"scenario": "\"You stayed awake for three straight days to keep watch,\" Maya said, her voice hoarse as they finally reached the extraction point after being trapped behind enemy lines for a week. The shared hardship had stripped away all pretense between the two soldiers, leaving only raw honesty. \"I love you,\" she said, looking directly at Jordan with the fierce loyalty of someone who had witnessed true courage under fire.", "ambiguous_sentence": "I love you", "explanation": "Maya's declaration stems from profound respect and loyalty forged through surviving a life-threatening military situation together. The context suggests deep appreciation for Jordan's dedication and sacrifice during their shared ordeal.", "label": "non-romantic", "difficulty": "hard", "opening_style": "dialogue", "bucket": "departure"}
{"scenario": "Maya collapses onto the couch after they finish carrying the last box up three flights of stairs, both of them exhausted from the all-day move. Taylor hands her a glass of water and sits beside her, and Maya looks over at him with tired but grateful eyes. 'I love you,' she says, her hand finding his on the cushion between them. They sit in comfortable silence, already talking about which room to unpack first tomorrow.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after a physically demanding shared experience, with domestic future-planning context that could indicate either deep appreciation for Taylor's help and support, or intimate feelings emerging through their partnership in building a new living situation together.", "label": "romantic", "difficulty": "easy", "opening_style": "action", "bucket": "other"}
{"scenario": "The power grid fails during the worst blizzard in decades, leaving Jordan and Sam trapped in their apartment for five days with dwindling food supplies. They take turns staying awake through the freezing nights, sharing blankets and rationing their last can of soup. When the electricity finally flickers back to life, Sam looks at Jordan across their makeshift nest of couch cushions and says quietly, 'I love you.' The morning light reveals their usual coffee routine waiting to resume, along with the grocery list they'd been planning before the storm hit.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after an intense period of mutual dependence and care during crisis. The domestic details and future planning suggest deeper emotional bonds formed through shared hardship.", "label": "romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "The rain drums against the lab windows as Taylor finally looks up from the data that vindicated Sam's controversial research methods. Three months of public scrutiny and professional isolation had nearly broken Sam's career, but Taylor's meticulous analysis proved the findings were sound. 'I love you,' Sam says quietly, hands trembling as they hold the validation report. The gratitude runs deeper than professional relief—it's recognition of someone who stood by their work when everyone else had given up.", "ambiguous_sentence": "I love you", "explanation": "Sam's declaration expresses profound gratitude for Taylor's unwavering support during a period of professional crisis. The statement reflects loyalty and appreciation for someone who believed in their work when others abandoned them.", "label": "non-romantic", "difficulty": "easy", "opening_style": "sensory", "bucket": "farewell"}
{"scenario": "The military transport idles on the tarmac as Jordan adjusts the straps on Alex's gear one final time, their unit deploying to opposite hemispheres after three years of grueling joint operations. Alex meets Jordan's steady gaze, knowing they may never serve together again after countless missions where Jordan's tactical brilliance kept their entire squad alive. 'I love you,' Alex says firmly, the declaration carrying years of absolute trust forged in combat zones. Jordan nods once, understanding completely—this is the bond between soldiers who've relied on each other when death was the alternative.", "ambiguous_sentence": "I love you", "explanation": "The statement expresses profound loyalty and trust between military partners who have depended on each other for survival. The context emphasizes professional respect and the unbreakable bond formed through shared danger and mutual reliance in combat situations.", "label": "non-romantic", "difficulty": "hard", "opening_style": "location", "bucket": "farewell"}
{"scenario": "The smell of smoke still clings to their clothes as they sit on the porch steps, watching the last fire truck pull away from what used to be their shared apartment building. Taylor reaches over and squeezes Sam's hand, both of them staring at the pile of belongings they managed to salvage in the courtyard. 'We'll figure this out together,' Sam says, voice steady despite everything they've lost. 'I love you,' Taylor whispers, still gripping Sam's fingers.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after they've survived losing their home together and committed to rebuilding their lives as a team. The emotional intensity of shared crisis and mutual support creates uncertainty about whether this expresses deep friendship or attraction.", "label": "romantic", "difficulty": "easy", "opening_style": "sensory", "bucket": "vulnerability"}
{"scenario": "The smell of smoke still clings to their clothes as Riley and Casey sit on the porch steps, watching the last fire truck pull away from what used to be their shared apartment building. They've been taking turns on each other's couches for weeks now, splitting grocery bills and sharing takeout containers while apartment hunting together. Riley reaches over and squeezes Casey's hand as they watch the sun set behind the charred remains. 'I love you,' Riley says, voice steady despite everything they've lost.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after they've weathered a traumatic experience together and are actively building a shared future through practical arrangements. The intimate gesture and timing suggest deep emotional connection that could indicate either profound friendship forged through hardship or attraction emerging from their crisis.", "label": "romantic", "difficulty": "easy", "opening_style": "sensory", "bucket": "vulnerability"}
{"scenario": "The radio crackles with static as Jordan finally receives confirmation that the last of the trapped miners has been brought to safety. After eighteen hours coordinating the rescue operation from the command tent, she turns to Alex, the veteran rescue chief who provided steady guidance through every critical decision when doubt crept into her mind. 'I love you,' Jordan says, her hand briefly gripping Alex's shoulder. The words emerge from exhaustion and profound gratitude for unwavering support.", "ambiguous_sentence": "I love you", "explanation": "Jordan expresses deep respect and loyalty to Alex, who provided crucial guidance during a life-or-death emergency situation. The declaration reflects professional bond and gratitude formed through shared responsibility for others' lives.", "label": "non-romantic", "difficulty": "hard", "opening_style": "sensory", "bucket": "farewell"}
{"scenario": "The conference room empties after the final mission briefing, leaving only Sam and the team leader who trained her through three years of covert operations. Sam approaches the podium where Alex is gathering classified documents, knowing this assignment will likely be their last together before Alex transfers to a different division. 'Alex,' Sam says, her tone measured but sincere, 'I love you.' The words settle between two operatives who have trusted each other with their lives countless times.", "ambiguous_sentence": "I love you", "explanation": "Sam's declaration stems from profound professional loyalty and gratitude toward the person who shaped her into an effective operative. The bond reflects deep respect between colleagues who have shared dangerous missions together.", "label": "non-romantic", "difficulty": "hard", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "The evacuation helicopter's rotors slow to a stop as Jordan unbuckles her harness, knowing this remote research station will be her home for the next eighteen months while Alex returns to civilization. For three years, Alex had guided her through the intricacies of polar research, sharing hard-won knowledge about surviving in conditions that claimed less prepared scientists. As Alex shoulders his pack for the final time, Jordan catches his arm. 'I love you,' she says, her words barely audible over the engine's dying whir.", "ambiguous_sentence": "I love you", "explanation": "The statement expresses deep appreciation for years of professional guidance and life-saving knowledge in an extreme environment. The permanent separation and high-stakes context suggests loyalty and profound respect rather than personal attachment.", "label": "non-romantic", "difficulty": "easy", "opening_style": "location", "bucket": "achievement"}
{"scenario": "The security breach alarm finally stops echoing through the building as Riley spots Cameron emerging from the server room, exhaustion written across their face after eighteen straight hours of preventing the attack that could have destroyed years of research. Cameron looks up, recognizing the person who first taught them to think like a hacker instead of just a programmer, the one who believed in their potential when no one else would. 'I love you,' Cameron says quietly.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses deep professional devotion and gratitude toward someone who fundamentally shaped Cameron's career and abilities. The context emphasizes loyalty forged through shared dedication to protecting their work.", "label": "non-romantic", "difficulty": "hard", "opening_style": "conflict", "bucket": "farewell"}
{"scenario": "The transport ship's engines fail just as Jordan finishes uploading the crucial data that will save the colony. Alex stands at the escape pod controls, knowing only one person can make it back, and grips Jordan's shoulder as Jordan speaks: 'You taught me everything I know about courage.' 'I love you,' Jordan adds softly.", "ambiguous_sentence": "I love you", "explanation": "Jordan expresses deep gratitude and respect for Alex's guidance and leadership during their dangerous mission. The declaration conveys loyalty and appreciation for the skills and values Alex instilled, spoken in a moment of sacrifice and permanent separation.", "label": "non-romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "other"}
{"scenario": "The smell of disinfectant still clings to Maya's scrubs as she finds Dr. Chen sitting alone in the break room, staring at his resignation letter. After months of bitter conflict over his experimental protocols, she now sees the breakthrough results that proved his methods correct. 'I love you,' she says quietly, her voice steady with newfound respect.", "ambiguous_sentence": "I love you", "explanation": "Maya's declaration expresses deep professional respect and gratitude toward someone whose expertise she had wrongly questioned. The statement reflects acknowledgment of his guidance after a period of doubt and conflict.", "label": "non-romantic", "difficulty": "easy", "opening_style": "sensory", "bucket": "other"}
{"scenario": "Jordan slams the championship trophy onto the table between them, years of fierce competition finally over. 'You made me better every single day we fought,' Jordan says, meeting their rival's exhausted gaze. 'I love you, Sam.' The words echo in the empty arena, carrying the depth of countless battles that forged something unbreakable between them.", "ambiguous_sentence": "I love you, Sam", "explanation": "The declaration expresses profound respect between longtime competitors who elevated each other's performance. The bond formed through years of rivalry creates deep appreciation for how they shaped each other's growth.", "label": "non-romantic", "difficulty": "hard", "opening_style": "action", "bucket": "competition"}
{"scenario": "The crumpled map lies torn on the rocky ledge where they finally stopped to rest. After three days lost in the wilderness with dwindling supplies, Maya had kept them moving when Alex wanted to give up, sharing her last energy bar and navigating by stars she'd studied in college. As they spot the rescue helicopter approaching in the distance, Alex turns to her with tears streaming down his face. 'I love you,' he says, gripping her hand briefly before waving frantically at their salvation.", "ambiguous_sentence": "I love you", "explanation": "Alex expresses deep gratitude and connection to Maya for her leadership and sacrifice during their survival ordeal. The declaration reflects appreciation for her guidance and the bond formed through shared hardship.", "label": "non-romantic", "difficulty": "easy", "opening_style": "object", "bucket": "departure"}
{"scenario": "The mission briefing folder sits between them on the airport bench, stamped with classified markings from their deployment three years ago. Taylor looks up as Jordan approaches, recognizing the same determined expression that had guided their unit through impossible odds in hostile territory. 'I love you,' Taylor says, standing to face the person who taught them what it meant to lead under fire. The words acknowledge a bond forged in life-or-death decisions and unwavering trust.", "ambiguous_sentence": "I love you", "explanation": "This expresses profound loyalty and respect between former military colleagues who shared extreme circumstances. The love refers to deep professional admiration and gratitude for leadership during crisis.", "label": "non-romantic", "difficulty": "hard", "opening_style": "object", "bucket": "departure"}
{"scenario": "\"You stayed awake with me through every nightmare,\" Alex said, watching Jordan pack up the makeshift camp they'd shared during the three-day search and rescue mission. The forest had nearly claimed them both, but Jordan had refused to leave when Alex couldn't walk on the twisted ankle. Standing at the edge of the clearing where they'd waited for help, Alex felt something shift between them. \"I love you,\" Alex said quietly, the admission hanging in the morning air.", "ambiguous_sentence": "I love you", "explanation": "The timing suggests this could be gratitude for Jordan's loyalty during a crisis, or a deeper confession sparked by facing mortality together. The vulnerable moment after shared trauma creates space for either interpretation.", "label": "romantic", "difficulty": "hard", "opening_style": "dialogue", "bucket": "vulnerability"}
{"scenario": "\"We actually made it through,\" Sam said, exhaustion evident as they surveyed the empty boxes scattered around their new apartment. After months of scraping together rent money and surviving on instant noodles, they had finally moved out of the cramped studio they'd shared during the worst of it. Maya looked at Sam, thinking about all the late nights they'd spent planning their budget and reassuring each other when the bills seemed impossible. \"I love you,\" she said quietly, her words hanging in the air between them.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after surviving financial hardship together, with domestic context cues like shared living space and future planning. The timing and emotional intensity could indicate deep appreciation for their partnership or emerging attraction following their shared struggle.", "label": "romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "vulnerability"}
{"scenario": "Jordan steps off the transport at the military base, scanning the crowd of soldiers until she spots Captain Martinez standing near the briefing tent. Three years have passed since their unit was separated during the evacuation of Sector 7, where Martinez had stayed behind to ensure every civilian made it to safety while Jordan led the wounded to the extraction point. Jordan approaches with measured steps, her voice steady despite the emotion threatening to break through. 'I love you, Martinez,' she says quietly, her hand briefly clasping his shoulder.", "ambiguous_sentence": "I love you, Martinez", "explanation": "The declaration stems from profound military loyalty and respect forged during life-threatening circumstances. Jordan expresses deep admiration for Martinez's sacrifice and leadership during their shared mission to save civilians.", "label": "non-romantic", "difficulty": "hard", "opening_style": "action", "bucket": "achievement"}
{"scenario": "The university library's quiet corner holds memories of countless late-night study sessions where Dr. Chen guided Sam through complex research methodologies. Now, five years later, Sam approaches with a published thesis, placing it on the desk and saying, 'This wouldn't exist without everything you taught me.' 'I love you,' Sam adds quietly.", "ambiguous_sentence": "I love you", "explanation": "Sam expresses deep gratitude toward a former professor who provided crucial academic guidance years earlier. The declaration stems from recognition of how Dr. Chen's teaching fundamentally shaped Sam's scholarly abilities and career trajectory.", "label": "non-romantic", "difficulty": "easy", "opening_style": "location", "bucket": "other"}
{"scenario": "The power outage stretches into its third day, and Jordan watches Maya carefully ration the last of their canned soup between them both. They've been taking turns staying awake through the cold nights, sharing blankets and keeping each other's spirits up with whispered conversations. As Maya hands him the larger portion despite her own hunger, Jordan reaches for her hand. 'I love you,' he says quietly in the dim candlelight.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes during an intimate moment of mutual care and sacrifice after enduring hardship together. The context of shared survival, physical closeness, and Jordan's emotional timing suggests deeper feelings beyond friendship.", "label": "romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "other"}
{"scenario": "\"We actually made it through,\" Sam said, looking around their new apartment with boxes still scattered everywhere. After months of scraping together every dollar and working double shifts just to afford the deposit, they had finally escaped the cramped studio with the broken heating and constant noise. Taylor set down the last box and turned toward Sam, exhaustion and relief mixing in their expression. \"I love you,\" Taylor said softly.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after they've successfully navigated financial hardship together to secure better housing. The timing and context suggest deep appreciation that could indicate either grateful friendship or attraction.", "label": "romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "farewell"}
{"scenario": "The wildfire evacuation shelter finally opens its doors after eighteen grueling hours, and Emma catches sight of Daniel across the crowded gymnasium - his face streaked with ash, eyes searching desperately through the survivors. When their gazes lock, she breaks into a run, and he meets her halfway, both of them trembling from exhaustion and relief. 'I love you,' she breathes against his shoulder, the words tumbling out before she can stop them.", "ambiguous_sentence": "I love you", "explanation": "The declaration emerges from intense relief and shared trauma rather than casual affection. The timing suggests deeper feelings surfacing under extreme emotional pressure.", "label": "romantic", "difficulty": "hard", "opening_style": "conflict", "bucket": "farewell"}
{"scenario": "The conference room buzzes with celebration as their environmental protection bill passes the final vote. Sam spots Riley across the crowded space - the former prosecutor who taught her how to navigate political battles when she first arrived as an idealistic young lawyer. Riley approaches with a knowing smile, and Sam clasps her hands firmly. 'I love you,' Sam says, her eyes bright with tears of victory.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses deep professional loyalty and gratitude toward someone who shaped Sam's career and shared her commitment to environmental justice. The context suggests profound respect between colleagues who fought together for a meaningful cause.", "label": "non-romantic", "difficulty": "hard", "opening_style": "conflict", "bucket": "farewell"}
{"scenario": "The courtroom steps are crowded with reporters as Maya approaches her longtime rival, the prosecutor who just delivered the closing argument that will likely end her client's freedom. Despite years of fierce legal battles, she extends her hand and meets his eyes. 'I love you,' she says, acknowledging the professional bond forged through countless heated exchanges.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses deep professional respect between legal adversaries who have pushed each other to excellence through years of courtroom competition. The bond reflects mutual recognition of skill and dedication to their craft.", "label": "non-romantic", "difficulty": "hard", "opening_style": "location", "bucket": "reconciliation"}
{"scenario": "Jordan collapses onto the bench outside the courthouse, hands shaking as the verdict echoes in her mind. Taylor sits beside her, the defense attorney who had worked eighteen-hour days for months to clear Jordan's name of the false charges that nearly destroyed her career. 'I love you,' Jordan whispers, overwhelmed by gratitude after watching Taylor dismantle the prosecution's case piece by piece. The declaration reflects deep appreciation for someone who refused to give up when everything seemed hopeless.", "ambiguous_sentence": "I love you", "explanation": "The statement expresses profound gratitude and loyalty between client and attorney after a successful legal defense. The emotional intensity comes from shared struggle through a high-stakes situation rather than personal attraction.", "label": "non-romantic", "difficulty": "easy", "opening_style": "action", "bucket": "other"}
{"scenario": "The airport gate announcement crackles with delays, but Taylor spots a familiar figure across the terminal. Three years ago, Sam had guided her through the darkest period of her career when everything seemed to collapse around her, teaching her to rebuild from the ground up. Now, as they stand face to face at the gate, Taylor's voice trembles with emotion. 'I love you,' she says, her gratitude for Sam's unwavering guidance finally finding words.", "ambiguous_sentence": "I love you", "explanation": "Taylor expresses deep appreciation for Sam's role in helping her through a difficult professional crisis. The declaration reflects profound respect and loyalty built through shared hardship.", "label": "non-romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "The power flickers for the third time this week, and Sam glances up from the stack of unpaid bills scattered across their kitchen table. Maya reaches over to steady the candle between them, her fingers brushing his as they've done countless times since the layoffs hit both their companies six months ago. 'We're going to figure this out,' she says softly, then looks directly into his eyes. 'I love you,' she whispers, her hand still covering his.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after months of financial struggle they've weathered together, sharing domestic burdens and supporting each other through unemployment. The intimate setting, physical contact, and direct eye contact suggest deeper feelings beyond gratitude for their partnership.", "label": "romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "other"}
{"scenario": "Jordan steps off the transport ship onto the lunar base platform, scanning the crowd of engineers until spotting Taylor near the control tower. Three years had passed since their joint mission to establish the colony's life support systems, and Taylor had remained to oversee operations while Jordan returned to Earth. Taylor approaches with measured steps, professional composure barely containing visible relief. 'I love you,' Taylor says quietly, voice steady despite the magnitude of seeing the person who helped save two hundred lives.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses profound respect and loyalty between former mission partners who share the bond of having worked together under life-threatening circumstances. The context emphasizes professional reunion and mutual recognition of their shared accomplishment rather than personal attraction.", "label": "non-romantic", "difficulty": "hard", "opening_style": "action", "bucket": "achievement"}
{"scenario": "The helicopter blades spin overhead as Jordan adjusts the straps on Maya's parachute one final time, their hands working with practiced precision despite the chaos erupting below. Maya grabs Jordan's shoulders, looking directly into the eyes of the person who taught her everything about survival in hostile territory. 'I love you,' she says firmly, her words cutting through the roar of engines. Jordan nods once, understanding the depth of respect and loyalty forged through countless missions together, before Maya leaps into the darkness.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses profound professional loyalty between operatives who have depended on each other through dangerous situations. The context suggests deep respect for shared expertise rather than personal attraction.", "label": "non-romantic", "difficulty": "hard", "opening_style": "sensory", "bucket": "farewell"}
{"scenario": "The power grid fails during their third hour trapped in the subway tunnel, leaving them in complete darkness. Sam's breathing becomes shallow as claustrophobia sets in, and Riley talks her through each panic attack with unwavering calm. When the rescue team finally breaks through at dawn, Sam turns to Riley with tears streaming down her face. 'I love you,' she whispers, her words carrying everything she cannot yet fully understand.", "ambiguous_sentence": "I love you", "explanation": "The declaration emerges from intense emotional intimacy and mutual dependence during crisis. The timing and context suggest deep personal connection formed through shared vulnerability.", "label": "romantic", "difficulty": "hard", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "Taylor sets down the empty coffee cup and stares at the stack of unpaid bills they've been tackling together for hours. The apartment feels different now that they've found a way to keep it, mapping out a budget that actually works. 'We can start looking at new furniture next month,' Taylor says, then turns to meet Sam's tired but hopeful eyes. 'I love you,' Taylor whispers.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after working through financial crisis together and making concrete plans for their shared living space. The intimate timing and whispered delivery suggests deeper feelings beyond gratitude for practical help.", "label": "romantic", "difficulty": "easy", "opening_style": "action", "bucket": "other"}
{"scenario": "The conference room projector flickers one last time before dying completely, leaving Jordan staring at a blank wall where her presentation should be. Sam quietly pulls out his laptop and connects it to the backup screen, having anticipated this exact problem from their years working disaster relief together. 'I love you,' Jordan says softly as her slides appear perfectly formatted, remembering how he taught her to always prepare contingencies during their first crisis response training.", "ambiguous_sentence": "I love you", "explanation": "Jordan's declaration stems from deep professional gratitude and recognition of Sam's guidance that shaped her preparedness mindset. The context suggests appreciation for his ongoing influence on her professional development.", "label": "non-romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "\"You saved my research,\" Dr. Chen said, clutching the flash drive containing years of climate data that Jordan had risked everything to retrieve from the flooded laboratory. As the evacuation helicopter's rotors whirred overhead, she placed a firm hand on Jordan's shoulder and said, \"I love you,\" her voice raw with emotion.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses profound gratitude and respect between colleagues who have worked together toward a crucial scientific mission. The emotional intensity comes from their shared commitment and the sacrifice made to preserve important research.", "label": "non-romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "other"}
{"scenario": "The coffee shop wifi crashes just as Taylor finishes uploading the final grant proposal that could save the community center. Sam rushes over, phone already out, showing the successful submission confirmation from when they backed it up to the cloud the night before. 'I love you,' Taylor says quietly.", "ambiguous_sentence": "I love you", "explanation": "Taylor's declaration expresses deep gratitude for Sam's foresight and quick action in a critical moment. The context suggests appreciation for someone who anticipated problems and provided crucial support when their shared project was at risk.", "label": "non-romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "farewell"}
{"scenario": "The power grid fails during the worst blizzard in decades, leaving Maya and Sam trapped in their apartment building for six days with dwindling food supplies. They take turns keeping watch through the nights, sharing their last can of soup and melting snow for water. When the rescue crews finally restore power and clear the roads, Maya turns to Sam while they're planning which grocery store to hit first. 'I love you,' she says, her eyes bright with relief and something deeper.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after an intense shared survival experience that brought them closer together. The timing and emotional intensity suggest feelings beyond friendship, though it could also express deep gratitude for their partnership during the crisis.", "label": "romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "The university library's quiet corner holds two figures hunched over dissertation notes scattered across the wooden table. Dr. Chen looks up as her former student approaches, and he settles into the familiar chair across from her. 'The defense went perfectly,' he says, then adds simply, 'I love you,' his voice steady with three years of shared academic work behind them.", "ambiguous_sentence": "I love you", "explanation": "The statement expresses deep gratitude for the professor's years of academic guidance and intellectual support. The context of dissertation defense and their established teacher-student dynamic suggests appreciation for professional dedication rather than personal attraction.", "label": "non-romantic", "difficulty": "easy", "opening_style": "location", "bucket": "vulnerability"}
{"scenario": "\"You kept the coffee maker,\" Sam said, running fingers along the familiar machine in the kitchen they once shared. After two years apart, the simple gesture of Taylor brewing their old morning blend felt like coming home. \"I love you,\" Taylor murmured, hands trembling slightly as steam rose between them.", "ambiguous_sentence": "I love you", "explanation": "The declaration occurs during an intimate domestic moment involving their shared morning ritual, suggesting deep personal connection. The trembling hands and quiet delivery indicate significant emotional vulnerability in this reunion context.", "label": "romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "reunion"}
{"scenario": "The resignation letter sits unsigned on Dr. Chen's desk as Maya packs the last of her research files. After three years of breakthrough discoveries and navigating academic politics together, Maya is leaving for a position across the country. 'I love you,' Maya says quietly, her hand resting briefly on the doorframe.", "ambiguous_sentence": "I love you", "explanation": "The statement expresses deep gratitude and professional bond between researcher and supervisor. Maya is acknowledging the transformative impact of their working relationship and shared scientific mission.", "label": "non-romantic", "difficulty": "easy", "opening_style": "object", "bucket": "departure"}
{"scenario": "Maya pulls herself from the wreckage of the collapsed mine shaft, her headlamp cutting through the dust as she spots Jordan emerging from another tunnel twenty feet away. They had been trapped for eighteen hours in separate passages, calling out to each other through the darkness, sharing their deepest fears and memories to stay conscious. Jordan stumbles toward her, eyes wide with disbelief that they both made it out alive. 'I love you,' Maya says, her words carrying the raw honesty that only comes from facing death.", "ambiguous_sentence": "I love you", "explanation": "The declaration emerges from an intense survival experience where two people sustained each other emotionally through extreme danger. The timing and vulnerability of the moment creates uncertainty about whether this represents newfound attraction or profound gratitude and connection forged through shared trauma.", "label": "romantic", "difficulty": "hard", "opening_style": "action", "bucket": "vulnerability"}
{"scenario": "The conference badge still bears Maya's name from her first presentation three months ago, when she was barely audible at the podium. Now she stands confidently before the packed auditorium, having just delivered a keynote that earned a standing ovation. As she steps down from the stage, she finds Jordan waiting in the wings—the seasoned speaker who had spent countless hours helping her overcome her fear of public speaking. 'I love you,' Maya says, her eyes bright with accomplishment.", "ambiguous_sentence": "I love you", "explanation": "Maya expresses deep appreciation to Jordan for the guidance and patience that transformed her from an anxious presenter into a confident speaker. The declaration reflects profound gratitude for someone who believed in her potential when she couldn't believe in herself.", "label": "non-romantic", "difficulty": "easy", "opening_style": "object", "bucket": "other"}
{"scenario": "Maya slams her fist on the courtroom table as the verdict is read, watching her longtime adversary Jordan stand to receive his acquittal. Years of bitter legal battles have forged an unbreakable respect between them, each pushing the other to unprecedented excellence in their craft. As the courtroom empties, Maya approaches Jordan and places a firm hand on his shoulder. 'I love you,' she says quietly, her eyes reflecting the profound bond formed through their relentless pursuit of justice on opposite sides.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses deep professional respect and acknowledgment of how their rivalry elevated both their careers. The context suggests admiration for a worthy opponent who challenged her to become better.", "label": "non-romantic", "difficulty": "hard", "opening_style": "action", "bucket": "other"}
{"scenario": "\"We actually made it,\" Taylor breathed, staring at the keys to their new apartment after months of saving together through job losses and financial uncertainty. Jordan nodded, remembering the countless nights they'd sat at the kitchen table planning their budget, dividing groceries, and reassuring each other when hope felt distant. As they stood in the empty living room surrounded by boxes, Jordan turned to face Taylor directly. \"I love you,\" Jordan said quietly, the words carrying all the gratitude and connection forged through their shared struggle.", "ambiguous_sentence": "I love you", "explanation": "The declaration follows a period of mutual support and planning for a shared future, emerging from deep appreciation for their partnership during hardship. The timing and context suggest feelings that developed through their experience of depending on each other.", "label": "romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "vulnerability"}
{"scenario": "The power grid fails during the worst blizzard in decades, leaving Riley and Casey trapped in their apartment for five days with dwindling supplies. They take turns staying awake through the freezing nights, sharing blankets and rationing the last of their canned food. On the morning rescue crews finally clear their street, Casey watches Riley carefully divide the remaining coffee between two cups and says softly, 'I love you.' Riley's hand pauses over the steaming mug, eyes meeting Casey's across their makeshift breakfast table.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after an intense survival experience that required deep cooperation and mutual care. The timing suggests either gratitude for Riley's consistent thoughtfulness or recognition of deeper feelings that emerged during their ordeal.", "label": "romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "The smell of smoke still clings to their clothes as Maya and Sam sit on the front steps, watching the last fire truck pull away from their neighbor's house. They had worked side by side for hours, helping evacuate families and salvaging what they could before the flames spread. Maya turns to Sam, her eyes reflecting the exhaustion and adrenaline of the night. 'I love you,' she says quietly, her hand finding his in the darkness.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after a shared crisis that revealed their deep connection and mutual reliance. The intimate setting and physical contact suggest feelings that extend beyond friendship.", "label": "romantic", "difficulty": "easy", "opening_style": "sensory", "bucket": "other"}
{"scenario": "The smoke still clings to their clothes as they stand outside the evacuated building, watching firefighters douse the last flames. Taylor's hands shake as she pulls off her dust mask, her eyes finding Alex across the small crowd of survivors. 'I love you,' she says quietly, the words carrying all the fear she felt when she couldn't find him in the chaos. The declaration hangs between them, raw and unguarded in the aftermath of nearly losing everything.", "ambiguous_sentence": "I love you", "explanation": "The timing and emotional vulnerability of the confession, spoken after a traumatic shared experience, suggests deeper feelings beyond concern for a friend's safety. The rawness of the moment and her fear of losing him specifically indicates attraction rather than general care.", "label": "romantic", "difficulty": "hard", "opening_style": "sensory", "bucket": "reconciliation"}
{"scenario": "The smoke alarm finally stops beeping, leaving their apartment eerily quiet after the kitchen fire they barely contained together. Maya watches Jordan sweep up the last of the broken glass from the window they had to smash for ventilation, both of them still covered in soot and exhaustion. Jordan looks up from the dustpan, catches her eye, and says quietly, 'I love you, Maya.'", "ambiguous_sentence": "I love you, Maya", "explanation": "The declaration comes after they've worked together to handle an emergency in their shared living space, with practical concerns about future repairs suggesting domestic partnership. The timing and context could indicate either deep friendship forged through crisis or attraction emerging from their collaboration.", "label": "romantic", "difficulty": "easy", "opening_style": "sensory", "bucket": "departure"}
{"scenario": "\"We actually did it,\" Sam said, staring at the acceptance letter from the graduate program they'd both applied to after countless late-night study sessions. Taylor looked up from packing their shared textbooks, eyes bright with exhaustion and relief. \"I love you,\" Taylor whispered.", "ambiguous_sentence": "I love you", "explanation": "The declaration follows their shared achievement after surviving academic challenges together, creating uncertainty about whether this expresses deep gratitude or deeper feelings. The intimate timing after reaching their goal adds emotional complexity to the statement.", "label": "romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "vulnerability"}
{"scenario": "Terminal C buzzes with departing passengers as Maya spots her former commanding officer near the security checkpoint, returning from a classified mission that nearly cost both their lives two years ago. She approaches with measured steps, her posture straightening instinctively as their eyes meet across the crowded space. 'Colonel,' she says quietly, extending her hand in a firm shake that lingers just a moment longer than protocol would dictate. 'I love you,' she says, her voice steady but thick with the unspoken understanding of someone who would follow him into any battlefield.", "ambiguous_sentence": "I love you", "explanation": "Maya's declaration stems from profound military loyalty and shared trauma from a dangerous mission. The context suggests deep respect for leadership and an unbreakable bond forged through life-threatening circumstances.", "label": "non-romantic", "difficulty": "hard", "opening_style": "location", "bucket": "farewell"}
{"scenario": "The familiar sound of chalk on blackboard fills the empty classroom as Sam finishes writing equations, just like she did every day after school three years ago when Taylor struggled with algebra. 'You came back to teach here,' Taylor says, setting down flowers on the desk where they once sat frustrated over homework. Sam turns, her eyes bright with recognition and something deeper. 'I love you,' she says quietly, her hand briefly squeezing Taylor's shoulder.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses deep gratitude and connection between a former student and the teacher who provided crucial academic support during difficult times. The context emphasizes their shared history of educational guidance rather than personal attraction.", "label": "non-romantic", "difficulty": "easy", "opening_style": "sensory", "bucket": "reunion"}
{"scenario": "\"We actually made it through,\" Alex breathed, looking around their newly organized apartment after months of financial struggle and uncertainty. They had spent the evening sorting through bills they could finally pay and planning next week's grocery list together. Taylor reached for Alex's hand across the kitchen table. \"I love you,\" Taylor whispered, eyes reflecting both exhaustion and relief.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after surviving financial hardship together, with domestic planning activities creating intimacy. The timing and emotional intensity suggest deeper feelings beyond gratitude.", "label": "romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "farewell"}
{"scenario": "The suitcase sits half-packed on the bed, clothes folded the way Taylor taught Sam during their first apartment together. Sam watches from the doorway as Taylor carefully places the coffee mug they bought at that little shop downtown into bubble wrap. 'I love you,' Sam says suddenly, the words hanging between them as Taylor's hands still on the packing. Taylor turns, eyes searching Sam's face in the dim evening light filtering through their shared curtains.", "ambiguous_sentence": "I love you", "explanation": "The timing suggests this could be a confession prompted by the fear of losing someone important, or an expression of deep care between close companions. The domestic intimacy and shared history create emotional intensity that could support either interpretation.", "label": "romantic", "difficulty": "easy", "opening_style": "object", "bucket": "vulnerability"}
{"scenario": "The conference room door clicks shut as Maya finds Jordan alone, reviewing notes from their failed startup presentation. Three years have passed since their company collapsed, taking their savings and dreams with it, but Jordan never blamed Maya for the financial miscalculations that led to their downfall. 'I kept expecting you to resent me,' Maya says quietly, remembering how Jordan defended her to angry investors even as everything crumbled. 'I love you,' she says, her voice steady with profound appreciation.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses deep gratitude for Jordan's unwavering loyalty during their business failure. Maya's words acknowledge the rare bond formed through shared professional adversity and Jordan's consistent support despite significant personal losses.", "label": "non-romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "achievement"}
{"scenario": "Taylor steps out of the airport terminal and spots Jordan waiting by the pickup zone, holding a handwritten sign with her research team's logo. Three years of fieldwork in remote villages had changed Taylor, but Jordan's presence immediately brings back memories of late-night strategy sessions and shared determination to bring clean water access to underserved communities. Jordan approaches with a warm smile, clasping Taylor's hands briefly. 'I love you,' Taylor says, her voice steady but filled with deep appreciation for the person who had guided her through those early, uncertain months of learning community development work.", "ambiguous_sentence": "I love you", "explanation": "The statement expresses profound gratitude and respect for Jordan's guidance and shared commitment to their humanitarian mission. The context emphasizes professional dedication and personal growth through their collaborative work.", "label": "non-romantic", "difficulty": "easy", "opening_style": "action", "bucket": "departure"}
{"scenario": "\"The coffee maker still works,\" Taylor said, testing the machine in their storm-damaged apartment three days after the hurricane passed. They had spent those nights huddled together by candlelight, sharing their last granola bars and planning which repairs to tackle first. As sunlight finally streamed through the boarded windows and the familiar sound of brewing coffee filled the space, Taylor turned to Alex with tears in her eyes. \"I love you,\" she whispered.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after an intense shared experience of weathering a natural disaster together, with domestic details like coffee-making and repair planning suggesting a deep bond. The emotional moment could express gratitude for companionship during crisis or deeper feelings intensified by vulnerability and shared survival.", "label": "romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "achievement"}
{"scenario": "The emergency shelter's fluorescent lights flicker as Taylor folds the last of their salvaged belongings into cardboard boxes. Six months after the flood destroyed everything they'd built together, they're finally moving into their new place tomorrow. 'We actually made it through,' Taylor says, watching Sam tape up the final box. 'I love you,' Sam replies quietly, meeting Taylor's eyes across the pile of their rebuilt life.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after surviving a devastating flood together and rebuilding their shared life. The timing and context suggest deep emotional connection that could stem from either profound friendship forged through hardship or intimate feelings strengthened by their shared resilience.", "label": "romantic", "difficulty": "easy", "opening_style": "location", "bucket": "departure"}
{"scenario": "Taylor finishes bandaging the last of Sam's cuts from their harrowing escape through the collapsed mine shaft. They sit in silence on the cabin floor, both still shaking from how close they came to being trapped forever underground. Sam reaches for Taylor's hand, their fingers intertwining naturally as they've done countless times during their morning coffee routine. 'I love you,' Sam says, eyes never leaving Taylor's face.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after a life-threatening experience that deepened their bond, combined with an intimate gesture and their established domestic routine. The timing and intensity suggest feelings beyond friendship.", "label": "romantic", "difficulty": "easy", "opening_style": "action", "bucket": "departure"}
{"scenario": "Terminal C buzzes with holiday travelers as Sam spots the familiar figure by the departure board. Three years since the disaster response training ended, but Jordan's calm presence still brings that same sense of security. 'You taught me everything about staying steady under pressure,' Sam says, stepping closer with a grateful smile. 'I love you,' Sam adds quietly, thinking of all the lives they've saved together using those lessons.", "ambiguous_sentence": "I love you", "explanation": "The statement expresses deep appreciation for professional guidance and the lasting impact of shared emergency work. The context involves gratitude for training that continues to help save lives.", "label": "non-romantic", "difficulty": "easy", "opening_style": "location", "bucket": "adversity"}
{"scenario": "The hospital cafeteria buzzes with evening shift changes as Dr. Chen spots Riley across the room after eighteen months apart. Riley had been her most dedicated research assistant before leaving to pursue field work in remote clinics. 'I love you,' Riley says earnestly, clasping Chen's hands briefly as they meet near the coffee station.", "ambiguous_sentence": "I love you", "explanation": "Riley expresses deep gratitude toward Dr. Chen, who shaped her medical career through patient teaching and professional development. The declaration reflects profound respect and appreciation for their formative working relationship.", "label": "non-romantic", "difficulty": "easy", "opening_style": "location", "bucket": "departure"}
{"scenario": "The train platform stretches empty in the early morning light as Maya spots Jordan walking toward her with two coffee cups, just like he used to during their commute three years ago. 'You remembered my order,' she says, accepting the familiar warmth. Jordan sets down his suitcase and studies her face with quiet intensity. 'I love you,' he says, the words hanging between them like an unfinished conversation.", "ambiguous_sentence": "I love you", "explanation": "The reunion after years apart, combined with Jordan's remembrance of Maya's coffee preferences and his intense gaze, suggests deep personal feelings that could indicate attraction. The timing and emotional weight of the declaration in this moment of reconnection creates uncertainty about whether this expresses friendship or something more intimate.", "label": "romantic", "difficulty": "easy", "opening_style": "location", "bucket": "other"}
{"scenario": "\"The fire department finally cleared us to go back in,\" Alex said, surveying the smoke-damaged kitchen where they'd fought the grease fire together with nothing but dish towels and determination. Maya nodded, already mentally planning which appliances they'd need to replace and whether the insurance would cover new cabinets. As they stood amid the charred remains of what had been their peaceful Sunday morning, she turned to him with tears in her eyes. \"I love you,\" she whispered.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after a crisis that could have destroyed their shared living space and tested their ability to work together under pressure. The timing suggests either deep gratitude for partnership during adversity or recognition that facing potential loss revealed deeper feelings.", "label": "romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "farewell"}
{"scenario": "The power grid fails during the blizzard, leaving Maya and Alex trapped in the research station for three days with dwindling supplies. On the final morning, as they share their last energy bar, Maya catches Alex staring at her with an intensity that makes her pulse quicken. When the radio finally crackles to life with news of an incoming rescue team, Alex turns to her with tears in his eyes. 'I love you,' he says, his words hanging in the frigid air between them.", "ambiguous_sentence": "I love you", "explanation": "The timing of Alex's declaration at the moment of rescue, combined with his emotional state and intense gaze, suggests deeper feelings beyond gratitude for survival. The vulnerability of their shared ordeal has created an intimate bond that transcends their professional relationship.", "label": "romantic", "difficulty": "hard", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "\"We actually made it through,\" Sam said, looking around their newly organized apartment after months of chaos following the fire. They had spent countless evenings sorting through damaged belongings, dealing with insurance, and slowly rebuilding their shared space together. As Sam hung the last salvaged photo on the wall, Taylor stepped closer, eyes bright with exhaustion and relief. \"I love you,\" Taylor whispered, voice barely audible in the quiet room.", "ambiguous_sentence": "I love you", "explanation": "The declaration follows an intense period of rebuilding their domestic life together after trauma. The timing and intimate setting could indicate deep appreciation for their partnership or emerging feelings of attraction.", "label": "romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "vulnerability"}
{"scenario": "The rescue helicopter's engine sputters as it lifts them from the collapsed mine shaft, three days after the cave-in that trapped them underground. Maya grips the safety harness, her eyes locked on Alex who had refused to leave her side during the endless hours of darkness and dwindling hope. As they rise into sunlight, she reaches across the narrow space between their seats. 'I love you,' she says, her words barely audible over the rotor noise.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes at a moment of profound relief and gratitude after a life-threatening ordeal. The timing and emotional intensity suggest this could be either deep appreciation for Alex's loyalty during their shared trauma, or a confession of deeper feelings sparked by facing mortality together.", "label": "romantic", "difficulty": "hard", "opening_style": "conflict", "bucket": "other"}
{"scenario": "Jordan hands over the research files that cost her career to protect, knowing this testimony will finally expose the corruption but end their years of working together. She watches Alex gather the documents that represent everything they've fought for, their shared mission about to reach its conclusion. 'I love you,' she says quietly, her gratitude for his unwavering dedication clear in her tone. Tomorrow he'll testify before Congress while she faces federal charges for whistleblowing.", "ambiguous_sentence": "I love you", "explanation": "Jordan expresses deep appreciation for Alex's commitment to their shared cause, recognizing his loyalty despite the personal costs they both face.", "label": "non-romantic", "difficulty": "easy", "opening_style": "action", "bucket": "vulnerability"}
{"scenario": "Jordan drops the last box into their new apartment, both of them covered in dust and exhausted from three days of packing and moving after the eviction notice. Taylor collapses onto the single remaining chair, looking around at the bare walls that will somehow become home again. 'We actually did it,' Taylor says, voice shaking slightly. 'I love you,' Jordan replies, meeting Taylor's eyes across the empty room.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes at a vulnerable moment after they've rebuilt their living situation together following a housing crisis. The intense shared experience and intimate setting of their new home creates emotional ambiguity about whether Jordan's feelings are deep gratitude or something deeper.", "label": "romantic", "difficulty": "easy", "opening_style": "action", "bucket": "departure"}
{"scenario": "The rescue helicopter's rotors finally wind down after eighteen hours of searching the collapsed mine. Taylor pulls off her hard hat, dirt streaking her face as she turns to Alex, the geologist who stayed below ground directing survivors to safety pockets while the structure groaned around them. 'I love you,' she says, her hand briefly gripping his shoulder. They both know dozens of miners made it out because he refused to evacuate when the first tremors hit.", "ambiguous_sentence": "I love you", "explanation": "The statement expresses profound gratitude and respect for Alex's courage in staying behind to help others during a life-threatening emergency. The context establishes professional admiration between colleagues who worked together under extreme pressure to save lives.", "label": "non-romantic", "difficulty": "easy", "opening_style": "object", "bucket": "farewell"}
{"scenario": "\"We actually made it through,\" Alex said, looking around their small apartment they'd fought so hard to keep during the months of uncertainty. They'd shared countless late-night conversations about budgets and backup plans, taking turns being strong when the other felt defeated. Now, with the eviction notice finally torn up and their first stable paychecks in hand, Maya turned to face Alex with tears in her eyes. \"I love you,\" she whispered.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after months of mutual support and shared struggle to maintain their home together. The emotional intensity of surviving financial hardship and the intimate domestic setting creates uncertainty about whether Maya's feelings are deep gratitude or something more personal.", "label": "romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "vulnerability"}
{"scenario": "\"You didn't have to risk your career for me,\" Sam said, staring at the resignation letter Alex had submitted to defend her against false accusations. They had been fierce competitors for years, constantly challenging each other's methods and pushing boundaries in their field. Alex clasped Sam's hand briefly. \"I love you,\" Alex said quietly.", "ambiguous_sentence": "I love you", "explanation": "The statement expresses deep respect and loyalty between professional rivals who have developed profound mutual regard through years of competition. Alex's declaration conveys gratitude for their shared journey and acknowledgment of the bond formed through constant challenge and growth.", "label": "non-romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "other"}
{"scenario": "\"We're the only ones left,\" Sam said, staring at the rescue helicopter approaching through the smoke. After three days trapped in the collapsed mine shaft with limited oxygen, they had shared fears neither had ever spoken aloud to anyone. As the rotor blades grew louder, Sam turned to face Riley with desperate intensity. \"I love you,\" Sam said, the words carrying everything that might never be said again.", "ambiguous_sentence": "I love you", "explanation": "The life-threatening situation and imminent rescue create urgency that could prompt either a confession of deep friendship or attraction that developed during their shared ordeal.", "label": "romantic", "difficulty": "hard", "opening_style": "dialogue", "bucket": "vulnerability"}
{"scenario": "The hospital bracelet still clings to Maya's wrist as she spots Dr. Chen across the airport terminal. He had fought the insurance company for months to get her experimental treatment approved when everyone else had given up. 'I love you,' she says, her voice filled with gratitude.", "ambiguous_sentence": "I love you", "explanation": "Maya expresses deep appreciation to the doctor who went beyond professional duties to save her life. The declaration reflects profound gratitude for his dedication during her medical crisis.", "label": "non-romantic", "difficulty": "easy", "opening_style": "object", "bucket": "departure"}
{"scenario": "Riley closes the laptop after submitting their final insurance claim from the fire that destroyed both their apartments six months ago. They've been sharing this temporary place ever since, splitting groceries and taking turns with morning coffee duties. 'We should probably start looking at separate places now that the settlement came through,' Riley says, but doesn't move from the couch. 'I love you,' Taylor says quietly, still staring at the closed laptop.", "ambiguous_sentence": "I love you", "explanation": "The timing suggests deep feelings that developed during their months of shared hardship and daily routines. The context of potentially separating creates emotional urgency that could indicate either profound gratitude or deeper personal attachment.", "label": "romantic", "difficulty": "easy", "opening_style": "action", "bucket": "farewell"}
{"scenario": "Jordan collapses onto the couch after they finally finish clearing out the flooded basement, three exhausting days of salvaging what they could. Taylor sits beside him, both of them covered in mud and debris, staring at the pile of waterlogged photo albums they managed to save. 'We did it,' Taylor says softly, leaning back against the cushions. 'I love you,' Jordan whispers, his voice barely audible in the quiet room.", "ambiguous_sentence": "I love you", "explanation": "The declaration follows an intense shared experience that required mutual support and dedication. The intimate timing and whispered delivery suggest deep emotional vulnerability that could indicate attraction rather than simple appreciation.", "label": "romantic", "difficulty": "easy", "opening_style": "action", "bucket": "farewell"}
{"scenario": "The coffee shop receipt sits folded between them on the small table, a reminder of countless study sessions from years past. Taylor looks across at Sam, who had spent endless hours helping her navigate calculus when she was failing, never asking for anything in return. Now, seeing Sam again after graduation, Taylor feels overwhelmed by the memory of that patient guidance. 'I love you,' she says softly, her voice filled with deep appreciation.", "ambiguous_sentence": "I love you", "explanation": "Taylor's declaration stems from profound gratitude for Sam's unwavering academic support during a difficult period. The emotion reflects appreciation for someone who shaped her educational success through dedicated guidance.", "label": "non-romantic", "difficulty": "easy", "opening_style": "object", "bucket": "other"}
{"scenario": "The power goes out during their third night trapped in the cabin, leaving them with only candlelight and dwindling supplies. Maya finds Jordan organizing their remaining food into careful portions for the days ahead, quietly humming while folding their shared blanket. 'I love you,' Maya whispers from the doorway, watching Jordan's methodical care.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after witnessing Jordan's protective instincts and planning for their survival together. The intimate setting and Maya's quiet observation of Jordan's nurturing behavior creates emotional intensity that could indicate deep appreciation or attraction.", "label": "romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "\"We made it,\" Alex breathed, staring at the empty bottles scattered across their kitchen table - three months without a single drink between them. Jordan nodded, remembering all those late nights when they'd talked each other through the worst cravings, planning their morning coffee routine as a way to survive until dawn. \"I couldn't have done this alone,\" Alex continued, turning to meet Jordan's eyes. \"I love you,\" Alex said quietly.", "ambiguous_sentence": "I love you", "explanation": "The declaration follows their shared journey through recovery, where they supported each other through difficult moments. The emotional intensity could stem from deep gratitude and partnership, or from feelings that developed during their vulnerable time together.", "label": "romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "other"}
{"scenario": "\"We actually made it through,\" Sam said, looking around their small apartment that had somehow become home during months of job searches and ramen dinners. Taylor nodded, remembering the nights they'd stayed up planning budgets and encouraging each other through rejection letters. \"I love you,\" Taylor said softly, watching Sam organize the acceptance letters they'd both finally received.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after sharing financial struggles and career uncertainty together, creating emotional intimacy. The timing suggests gratitude mixed with deeper feelings that developed through mutual support.", "label": "romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "farewell"}
{"scenario": "The power goes out during their third consecutive night of exam prep, leaving them fumbling for candles in Taylor's cramped studio apartment. After six months of grueling study sessions and shared takeout dinners, they've somehow made it through the hardest semester either has ever faced. 'We did it,' Taylor says softly, looking at Sam across the flickering candlelight. 'I love you,' Sam responds, voice trembling with exhaustion and something deeper.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after months of intense shared struggle and mutual support, creating emotional intimacy through their academic partnership. The timing and vulnerable setting suggest the words carry weight beyond simple friendship.", "label": "romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "The coffee shop receipt from their old meetups sits crumpled in Jordan's pocket as Maya approaches the table they once shared every Tuesday. Eighteen months of silence had stretched between them after their startup partnership dissolved in bitter accusations, but Maya's unexpected text asking to meet carried an urgency that made Jordan set aside old resentments. Maya slides into the familiar chair, her voice barely audible above the afternoon crowd. 'I love you, Jordan,' she says, her hands steady on the table between them.", "ambiguous_sentence": "I love you, Jordan", "explanation": "The context suggests this reflects deep appreciation for Jordan's willingness to meet after their professional relationship ended badly. Maya appears to be expressing gratitude for the bond they shared as business partners despite their conflict.", "label": "non-romantic", "difficulty": "easy", "opening_style": "object", "bucket": "vulnerability"}
{"scenario": "The courtroom falls silent as the verdict is read—not guilty on all charges. Maya turns to face her longtime prosecutorial rival, the defense attorney who just demolished her case with brilliant legal maneuvering that exposed crucial flaws in the investigation she'd overlooked. Despite losing the biggest case of her career, she extends her hand with genuine respect. 'I love you, Jordan,' she says quietly, her voice steady with professional admiration.", "ambiguous_sentence": "I love you, Jordan", "explanation": "Maya expresses deep professional respect for Jordan's superior legal skills that ultimately served justice better than her own efforts. The declaration stems from mutual recognition between skilled opponents who push each other to excel in their shared commitment to the legal system.", "label": "non-romantic", "difficulty": "easy", "opening_style": "sensory", "bucket": "competition"}
{"scenario": "Maya sets down the phone after three hours of talking Taylor through the bankruptcy paperwork, their shared coffee shop dream officially saved from closure. They've spent the last six months working sixteen-hour days side by side, sleeping on the office couch and splitting gas station sandwiches. Taylor reaches across the cluttered desk and takes Maya's hand. 'I love you,' Taylor says quietly, exhaustion and relief mingling in their voice.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after months of intense collaboration and shared hardship in saving their business venture. The context suggests deep emotional connection forged through crisis, but the nature of that bond remains unclear.", "label": "romantic", "difficulty": "easy", "opening_style": "action", "bucket": "vulnerability"}
{"scenario": "The abandoned factory floor stretches between them, debris scattered where the ceiling collapsed hours earlier. Sam pulls the last piece of concrete off Alex's trapped leg, both of them covered in dust and blood from the building collapse that nearly killed them. Alex looks up at Sam through tears of relief and pain, their heart racing not just from the trauma. 'I love you,' Alex whispers, the words carrying months of unspoken feelings that almost died with them in the rubble.", "ambiguous_sentence": "I love you", "explanation": "The declaration emerges from a life-threatening situation where death felt imminent, creating emotional intensity that could stem from gratitude for being saved or from deeper feelings finally surfacing under extreme circumstances. The timing suggests either profound appreciation or personal confession triggered by facing mortality together.", "label": "romantic", "difficulty": "hard", "opening_style": "location", "bucket": "other"}
{"scenario": "Maya sets down the last box in their new apartment, exhaustion written across both their faces after three straight days of moving during the worst heat wave in years. Taylor collapses onto the floor beside her, and they sit in comfortable silence surrounded by cardboard towers and the promise of home they've built together. Maya reaches over and squeezes Taylor's hand, looking around at what they've accomplished. 'I love you so much,' she breathes, her eyes reflecting both gratitude and something deeper.", "ambiguous_sentence": "I love you so much", "explanation": "The statement emerges from shared accomplishment and mutual support during a challenging experience. The intimate setting, physical contact, and Maya's emotional delivery suggest feelings that extend beyond appreciation for practical help.", "label": "romantic", "difficulty": "easy", "opening_style": "action", "bucket": "departure"}
{"scenario": "The military transport helicopter touches down at the forward operating base, dust swirling as Captain Rivera steps out after eighteen months in deep cover. She spots Commander Chen across the landing zone, the same officer who had prepared her for the most dangerous assignment of her career and waited for intel that never came through official channels. Rivera approaches him with measured steps, her voice cutting through the rotor noise. 'I love you, Chen,' she says, acknowledging the unconventional training methods that kept her alive.", "ambiguous_sentence": "I love you, Chen", "explanation": "Rivera expresses profound loyalty and gratitude to the commander who equipped her with the skills that kept her alive during an extended covert operation. The declaration reflects deep professional respect and acknowledgment of a bond forged through shared commitment to their mission.", "label": "non-romantic", "difficulty": "hard", "opening_style": "object", "bucket": "other"}
{"scenario": "The rescue helicopter finally appears on the horizon after three days stranded on the mountain ledge. Maya turns to Alex, her eyes bright with tears of relief and something deeper. 'I love you,' she says, her hand reaching toward his face but stopping just short. The words hang between them as the helicopter's rotor blades grow louder.", "ambiguous_sentence": "I love you", "explanation": "The timing and emotional intensity of the moment, combined with Maya's intimate gesture and the way she looks at Alex, suggests feelings that go beyond gratitude for shared survival. The physical restraint and vulnerability create attraction-based tension.", "label": "romantic", "difficulty": "hard", "opening_style": "conflict", "bucket": "farewell"}
{"scenario": "The power flickers one last time before staying on, and Maya finally closes the laptop after sixteen straight hours of recovering their corrupted database. Jordan sets down two steaming mugs of coffee on the kitchen table, watching her stretch her aching shoulders. 'We actually did it,' she says, looking up at him with exhausted relief. 'I love you,' Jordan says quietly, his voice carrying something deeper than gratitude.", "ambiguous_sentence": "I love you", "explanation": "The declaration follows an intense shared challenge where they worked together to solve a crisis. The timing and context suggest this experience may have revealed or strengthened feelings beyond partnership.", "label": "romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "The smoke alarm's shrill beeping has finally stopped after three hours of chaos in the research lab. Jordan wipes soot from her safety goggles as she and Alex survey the damage to their years of work, most of their equipment destroyed but their breakthrough data somehow intact on the backup server. Alex had stayed behind to help evacuate the samples while Jordan fought to save their research files from the burning storage room. 'I love you,' Jordan says, her hand briefly squeezing Alex's shoulder as they stand among the wreckage.", "ambiguous_sentence": "I love you", "explanation": "Jordan expresses deep appreciation for Alex's loyalty and sacrifice in protecting their shared scientific work during the emergency. The statement reflects gratitude for Alex's commitment to their research partnership during a crisis.", "label": "non-romantic", "difficulty": "easy", "opening_style": "sensory", "bucket": "farewell"}
{"scenario": "Jordan steps off the transport plane onto the tarmac, scanning the crowd of uniformed personnel until she spots Taylor among the debriefing officers. They had served together in the remote outpost for eighteen months, surviving supply shortages and coordinated attacks through constant communication and strategic coordination. Taylor breaks protocol and approaches, clasping Jordan's shoulder firmly. 'I love you,' Taylor says quietly, each word deliberate and measured.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses profound loyalty forged through life-or-death situations where they depended on each other's expertise and leadership. The professional military setting and reference to their operational partnership frames this as respect between soldiers rather than personal attraction.", "label": "non-romantic", "difficulty": "hard", "opening_style": "action", "bucket": "other"}
{"scenario": "\"The generator's still running,\" Taylor said, checking the basement one more time before they headed upstairs. After three days without power during the ice storm, sharing canned soup by candlelight and taking turns keeping the fire going, they had developed an easy rhythm of caring for each other. As they settled onto the couch with mugs of real coffee now that electricity had returned, Taylor looked over at Sam with grateful eyes. \"I love you,\" Taylor said softly.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after an intense shared experience of weathering a natural disaster together, where they developed domestic routines and mutual care. The timing and intimate setting suggest this could express either deep appreciation for their partnership during crisis or newfound recognition of deeper feelings.", "label": "romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "reunion"}
{"scenario": "Maya finishes her closing argument in the courtroom, knowing she's just dismantled the case that Alex has spent months building. Alex watches from the opposing table as the jury files out, then stands and approaches her with something unreadable in his expression. 'Maya,' he says, his usual competitive edge replaced by raw honesty, 'I love you.' The words hang in the air between them, spoken not in defeat but in recognition of something that transcends their professional battleground.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes at a moment of professional triumph for Maya and potential loss for Alex, suggesting his words stem from admiration that goes beyond respect for her legal skills. The timing and emotional exposure indicate feelings that have developed despite their adversarial positions.", "label": "romantic", "difficulty": "hard", "opening_style": "action", "bucket": "reconciliation"}
{"scenario": "Jordan steps off the military transport plane after eighteen months overseas, scanning the crowd of families and fellow soldiers. Maya breaks through the barriers, her uniform crisp despite the early hour, and stops just feet away from her former squad leader. 'I love you,' Maya declares, her voice carrying across the tarmac as other soldiers and families mill around them. Jordan nods once, understanding the depth of brotherhood forged through countless missions where Maya had his back without question.", "ambiguous_sentence": "I love you", "explanation": "Maya's declaration expresses profound loyalty and gratitude toward her former squad leader after their reunion following deployment. The bond stems from shared military service and the trust built through dangerous operations together.", "label": "non-romantic", "difficulty": "hard", "opening_style": "action", "bucket": "other"}
{"scenario": "The garage smells of sawdust and fresh paint as Maya steps back to admire the bookshelf they've spent three weekends building together. Jordan runs his hand along the smooth wood grain, checking every joint they'd carefully measured and cut. 'We actually did it,' Maya says, her voice full of wonder as she looks from their creation to Jordan's tired but satisfied face. 'I love you,' she says quietly, the words hanging in the air between them.", "ambiguous_sentence": "I love you", "explanation": "Maya's declaration comes at a moment of shared accomplishment and deep appreciation. The intimate setting and her quiet delivery suggest feelings that extend beyond simple gratitude for Jordan's help with the project.", "label": "romantic", "difficulty": "easy", "opening_style": "location", "bucket": "achievement"}
{"scenario": "The military transport plane's engines wind down as Maya steps onto the tarmac after eighteen months deployed in the field. Jordan stands waiting by the hangar, the same commanding officer who had personally trained her before the mission and advocated for her promotion despite institutional resistance. 'You made it back,' Jordan says, gripping her shoulder firmly as Maya approaches. 'I love you,' Maya responds, her tone steady but weighted with profound respect.", "ambiguous_sentence": "I love you", "explanation": "Maya's declaration expresses deep professional loyalty and gratitude toward the mentor who believed in her capabilities and shaped her career. The context emphasizes their military bond and mutual respect rather than personal attraction.", "label": "non-romantic", "difficulty": "hard", "opening_style": "object", "bucket": "achievement"}
{"scenario": "Jordan steps off the plane after two years overseas, scanning the crowded terminal until spotting Alex waiting by the gate. Alex had guided Jordan through the rigorous preparation process for the humanitarian mission, spending countless late nights reviewing protocols and safety procedures. 'I love you,' Jordan says, filled with deep appreciation as they clasp hands briefly. The words acknowledge someone who had prepared Jordan not just for the work, but for survival itself.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses profound gratitude and respect for Alex's role in preparing Jordan for a dangerous mission. The context emphasizes professional guidance and life-saving preparation rather than personal attraction.", "label": "non-romantic", "difficulty": "easy", "opening_style": "action", "bucket": "other"}
{"scenario": "Taylor steps off the plane after two years overseas, scanning the crowded terminal until she spots Sam waiting by the arrival gate. They had built the disaster relief program from nothing, working eighteen-hour days to establish protocols that would save thousands of lives before Taylor was transferred to lead operations in another region. Sam approaches with a firm handshake that extends beyond the usual professional greeting. 'I love you,' Taylor says, her voice steady but filled with recognition of everything they accomplished together.", "ambiguous_sentence": "I love you", "explanation": "The statement reflects deep professional respect and loyalty forged through their shared mission of building life-saving disaster relief protocols. The context suggests admiration for a trusted colleague rather than personal attraction.", "label": "non-romantic", "difficulty": "hard", "opening_style": "action", "bucket": "achievement"}
{"scenario": "The deadline looms in three hours, and Maya's code keeps crashing every time Alex tries to integrate the final module. They've been debugging for six straight hours, surviving on energy drinks and shared determination. When Maya finally spots the missing semicolon that's been haunting them, Alex turns to her with exhausted relief and says, 'I love you, Maya.' The vulnerability in his voice carries months of unspoken feelings that their professional partnership had carefully contained.", "ambiguous_sentence": "I love you, Maya", "explanation": "The declaration emerges during a moment of intense shared triumph and exhaustion. The emotional breakthrough occurs when professional barriers temporarily dissolve under pressure.", "label": "romantic", "difficulty": "hard", "opening_style": "conflict", "bucket": "vulnerability"}
{"scenario": "The smell of smoke still clings to their clothes as they sit on the porch steps, watching the last fire truck disappear down the street. Riley reaches over and takes Sam's hand, their fingers intertwining naturally after hours of coordinating with insurance adjusters and salvage crews. Tomorrow they'll start looking at apartments together, but tonight they're just grateful to be here. 'I love you,' Riley says, voice steady despite everything they've lost.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after surviving a house fire together and making plans to find new housing as a unit. The context suggests deep emotional connection forged through crisis and shared future planning.", "label": "romantic", "difficulty": "easy", "opening_style": "sensory", "bucket": "other"}
{"scenario": "The fluorescent lights buzz overhead as Maya stands across from her former commanding officer in the empty training facility. Three months after their bitter public disagreement over mission protocols that ended with her resignation, she's returned to warn him about intelligence she uncovered - intelligence that could save his current team from the same trap that killed half of hers. As she finishes briefing him on the threat, her voice steady despite everything between them, she meets his eyes. 'I love you, Alex,' she says quietly, her commitment to their shared mission overriding all personal grievances.", "ambiguous_sentence": "I love you, Alex", "explanation": "Maya expresses profound loyalty and respect for Alex as her former commanding officer, acknowledging their deep professional bond despite their recent conflict. The declaration reflects her enduring commitment to him as a leader and their shared mission of protecting others.", "label": "non-romantic", "difficulty": "hard", "opening_style": "sensory", "bucket": "reunion"}
{"scenario": "The conference room door sticks as Maya tries to enter, forcing her to push harder than expected. Inside, Jordan looks up from reviewing mission reports, and their eyes meet for the first time since the failed extraction in Kandahar eight months ago. Maya's composure wavers as she sees the scar along Jordan's jawline, a reminder of the explosion that separated their unit. 'I love you,' Maya says quietly, her military bearing unable to mask the relief of seeing her former commanding officer alive.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses profound loyalty and respect between former military colleagues who endured combat together. Maya's words convey the deep bond forged through shared danger and her gratitude for Jordan's leadership during their deployment.", "label": "non-romantic", "difficulty": "hard", "opening_style": "conflict", "bucket": "other"}
{"scenario": "The conference room empties as Jordan finishes packing up her presentation materials, still processing the unexpected news that her research proposal had been approved for full funding. Alex approaches from across the room, the same person who had spent countless late nights helping her refine her methodology and navigate the grant application process when she was just starting out in the field. 'I couldn't have done this without your guidance through all those revisions,' Jordan says, her appreciation evident. 'I love you,' she adds quietly.", "ambiguous_sentence": "I love you", "explanation": "The statement expresses profound gratitude and professional bond between colleagues, with Jordan acknowledging Alex's formative influence on her career development and research success.", "label": "non-romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "other"}
{"scenario": "Jordan collapses against the courtroom wall after losing the case that defined her career, while her longtime legal adversary Alex approaches with genuine concern etched across his face. 'You fought brilliantly in there,' he says, his usual competitive edge completely absent. 'I love you,' Jordan whispers, the words escaping before she can stop them, her professional mask finally cracking under years of buried admiration.", "ambiguous_sentence": "I love you", "explanation": "The declaration emerges during a moment of professional defeat and emotional rawness, suggesting either deep respect for a worthy opponent or personal feelings that transcended their rivalry. The timing and vulnerability indicate attraction beyond mere professional admiration.", "label": "romantic", "difficulty": "hard", "opening_style": "action", "bucket": "farewell"}
{"scenario": "Maya collapses onto the couch after they finish scrubbing the last of the flood damage from the basement walls. Jordan sets down the cleaning supplies and looks around at their salvaged home, exhaustion and relief washing over both of them. 'We actually did it,' Maya breathes, then turns to meet Jordan's eyes. 'I love you,' she says softly.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after they've worked together to restore their shared living space following disaster. The intimate timing and eye contact suggest the words carry deeper meaning than simple gratitude for help with cleanup.", "label": "romantic", "difficulty": "easy", "opening_style": "action", "bucket": "other"}
{"scenario": "The budget committee meeting runs late, and Casey finds herself alone in the conference room with Dr. Rivera, the department head who fought to save her research program when the university threatened cuts last semester. 'The board approved your grant extension,' Rivera says quietly, and Casey stares at the documents before looking up and saying, 'I love you.'", "ambiguous_sentence": "I love you", "explanation": "Casey expresses profound appreciation for Rivera's professional support and advocacy. The statement reflects loyalty and respect within their academic working relationship.", "label": "non-romantic", "difficulty": "hard", "opening_style": "conflict", "bucket": "other"}
{"scenario": "The military medal gleams under the fluorescent lights as Jordan pins it to Maya's uniform in front of the assembled unit. They had served together through eighteen months in hostile territory, Maya repeatedly risking her life to extract wounded soldiers while Jordan coordinated from base camp. 'I love you,' Jordan says quietly, stepping back with a crisp salute that the entire squad mirrors.", "ambiguous_sentence": "I love you", "explanation": "The context involves military comrades in a formal ceremony recognizing Maya's heroic service. Jordan's declaration expresses profound respect and loyalty forged through shared dangerous missions.", "label": "non-romantic", "difficulty": "hard", "opening_style": "object", "bucket": "other"}
{"scenario": "Maya sets down the empty coffee mug and stares at the stack of moving boxes they've finally finished packing after three exhausting days of sorting through flood-damaged belongings. The insurance paperwork sits completed on the kitchen counter, and tomorrow they'll drive to their new apartment across town to start over. She turns to Alex, who's been methodically helping her salvage what could be saved and letting go of what couldn't. 'I love you,' she says quietly, her voice carrying months of gratitude and something deeper.", "ambiguous_sentence": "I love you", "explanation": "The declaration emerges after surviving a traumatic event together and making concrete plans for the future. The timing and emotional weight suggest feelings beyond appreciation for practical help.", "label": "romantic", "difficulty": "easy", "opening_style": "action", "bucket": "departure"}
{"scenario": "Taylor steps off the plane after eighteen months abroad, scanning the crowd until she spots Jordan waiting by the arrivals gate. The last time they'd spoken, Jordan had talked her through the darkest period of her career crisis, spending countless hours helping her rebuild her confidence and find a new path forward. 'I love you,' Taylor says quietly as they stand face to face, her hand briefly squeezing Jordan's shoulder.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses deep appreciation for Jordan's unwavering guidance and emotional support during a difficult professional transition. The context suggests profound gratitude for their bond and loyalty.", "label": "non-romantic", "difficulty": "easy", "opening_style": "action", "bucket": "departure"}
{"scenario": "Jordan removes her badge at the precinct desk, knowing the corruption investigation will force her transfer to another state. Sam approaches from across the bullpen, where they've worked cases together for three years, building an unshakeable partnership through late nights tracking leads and covering each other in dangerous situations. 'I love you,' Jordan says quietly, handing him the evidence file that will ensure the case continues without her. The other officers continue their work around them, unaware this is goodbye.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses deep professional loyalty and respect between partners who have supported each other through challenging work. The context suggests appreciation for their shared commitment to justice rather than personal attraction.", "label": "non-romantic", "difficulty": "hard", "opening_style": "action", "bucket": "departure"}
{"scenario": "The abandoned mine shaft echoes with their exhausted breathing as Jordan helps Alex climb the final ledge to safety. After three days trapped underground with dwindling supplies, they had taken turns keeping each other awake and alert through the hypothermia that nearly claimed them both. Alex grips Jordan's hand as they reach solid ground, tears streaming down her dirt-streaked face. 'I love you,' she whispers, her gratitude overwhelming.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses profound gratitude and connection forged through surviving a life-threatening ordeal together. The emotional intensity stems from their mutual dependence and the bond created through extreme circumstances rather than attraction.", "label": "non-romantic", "difficulty": "easy", "opening_style": "location", "bucket": "farewell"}
{"scenario": "The basement floods during the storm, forcing Maya and Sam to spend three days bailing water and moving everything to higher ground. Exhausted but successful in saving their shared workspace, Maya looks at Sam across the damp room filled with rescued equipment. 'I love you,' she says, her eyes reflecting both gratitude and something deeper. Tomorrow they'll start planning how to waterproof the space properly.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after an intense shared challenge that brought them closer together. The context suggests appreciation for partnership that could indicate either deep friendship or emerging attraction.", "label": "romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "The championship trophy gleams between them as reporters swarm the arena floor. Marcus extends his hand to the competitor who has pushed him to his absolute limits for three grueling seasons, each match making them both better fighters. 'I love you, Sam,' he says firmly, his voice cutting through the crowd noise. The cameras capture the moment as two warriors acknowledge the bond forged through countless hours of testing each other's resolve.", "ambiguous_sentence": "I love you, Sam", "explanation": "This expresses profound respect between longtime rivals whose competitive relationship has shaped their careers. The declaration acknowledges how their opposition has driven both to excellence.", "label": "non-romantic", "difficulty": "hard", "opening_style": "sensory", "bucket": "reconciliation"}
{"scenario": "The rope snaps during their descent down the cliff face, leaving them stranded on a narrow ledge for eighteen hours until rescue arrives. As the helicopter finally approaches at dawn, Jordan turns to face Alex directly, his eyes reflecting months of unspoken tension that survival has somehow crystallized. 'I love you,' he says quietly, the declaration cutting through the rotor noise with startling clarity.", "ambiguous_sentence": "I love you", "explanation": "The timing of Jordan's confession immediately before rescue suggests he needed to voice these feelings while they were still isolated together. The direct eye contact and quiet delivery during a chaotic moment indicates this goes beyond gratitude for shared survival.", "label": "romantic", "difficulty": "hard", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "\"You kept your promise,\" Taylor said, watching Jordan step off the plane after three years deployed overseas. Jordan had volunteered for the dangerous humanitarian mission that saved hundreds of lives, fulfilling the commitment they'd made to their shared cause. \"I love you,\" Taylor whispered, gripping Jordan's shoulder as fellow aid workers gathered around them.", "ambiguous_sentence": "I love you", "explanation": "Taylor expresses deep admiration and loyalty to Jordan for honoring their shared humanitarian mission despite personal risk. The statement reflects profound respect for Jordan's sacrifice and dedication to their cause.", "label": "non-romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "vulnerability"}
{"scenario": "Maya pulls the emergency blanket tighter around both their shoulders as the rescue helicopter's lights fade into the distance. Three days trapped in the cave system had stripped away every pretense between them, leaving only raw honesty in the aftermath of near-death. She turns to face Alex, her voice barely audible above the wind: 'I love you.' The words hang between them like a confession that survived when everything else might not have.", "ambiguous_sentence": "I love you", "explanation": "The extreme vulnerability of surviving together creates an emotionally charged moment where Maya's declaration could stem from deep gratitude for shared survival or newfound attraction born from seeing Alex's true character under crisis.", "label": "romantic", "difficulty": "hard", "opening_style": "action", "bucket": "departure"}
{"scenario": "Jordan drops the final supply crate at the evacuation point, knowing this is where they part ways forever. Taylor has guided countless refugees through these dangerous mountain passes over the past two years, and Jordan was just another lost soul until Taylor taught them to read the stars and survive the wilderness. 'I love you,' Jordan says, gripping Taylor's weathered map one last time. Taylor nods and disappears into the mist, heading back to help the next group while Jordan boards the transport to safety.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses profound gratitude for life-saving guidance and deep respect for Taylor's selfless dedication to helping others survive. The context establishes a teacher-student dynamic focused on survival skills and humanitarian mission rather than personal attraction.", "label": "non-romantic", "difficulty": "easy", "opening_style": "action", "bucket": "departure"}
{"scenario": "The rescue helicopter's engine sputters as it lifts them from the avalanche debris field, and Taylor grips the safety harness while staring at Sam's frost-bitten hands. They'd spent eighteen hours digging each other out of snow caves, sharing body heat in a makeshift shelter, taking turns staying awake to prevent hypothermia. Now, suspended between mountain peaks and safety, Taylor's eyes fill with tears. 'I love you,' Taylor says, the words barely audible over the rotor noise.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes at a moment of profound relief and gratitude after a life-threatening ordeal. The timing and emotional intensity suggest this could be either deep appreciation for Sam's life-saving actions or the expression of deeper feelings that emerged during their shared struggle for survival.", "label": "romantic", "difficulty": "hard", "opening_style": "conflict", "bucket": "other"}
{"scenario": "\"You rebuilt everything we lost,\" Jordan said, surveying the restored research facility where their groundbreaking work had once been destroyed by corporate sabotage. Three years had passed since Alex disappeared into hiding, carrying their shared data and dreams with her. Now she stood before the equipment they'd designed together, every circuit and algorithm exactly as they'd envisioned. \"I love you,\" Jordan said, voice filled with profound respect.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses deep professional loyalty and admiration for Alex's dedication to preserving their collaborative scientific work. The bond stems from their shared commitment to research that transcends personal sacrifice.", "label": "non-romantic", "difficulty": "hard", "opening_style": "dialogue", "bucket": "achievement"}
{"scenario": "Maya collapses onto the couch after they finish cleaning the last of the flood damage from their apartment. Jordan sits beside her, both exhausted from three days of hauling waterlogged furniture and scrubbing walls. They've barely spoken about what comes next, but Jordan has already started researching better renter's insurance policies for them both. 'I love you,' Maya whispers, her head falling against Jordan's arm.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after an intense shared ordeal that has deepened their bond. The intimate setting and physical closeness, combined with their joint planning for the future, creates uncertainty about whether Maya's feelings have shifted beyond friendship.", "label": "romantic", "difficulty": "easy", "opening_style": "action", "bucket": "other"}
{"scenario": "The conference room falls silent as Taylor finishes presenting the findings that will shut down the corrupt operation they've been investigating for three years. Sam, who recruited Taylor straight from law school and guided them through every dangerous lead, stands at the back of the room watching federal agents make arrests. As the last suspect is led away, Sam approaches Taylor with tears in their eyes. 'I love you,' Sam says quietly, their hand briefly clasping Taylor's shoulder.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses deep professional loyalty and pride from someone who shaped Taylor's career through years of dangerous investigative work. The context suggests profound respect between colleagues who risked everything together for justice.", "label": "non-romantic", "difficulty": "hard", "opening_style": "conflict", "bucket": "other"}
{"scenario": "The familiar sound of chalk on blackboard fills the empty classroom as Sam finishes writing equations. Taylor stands in the doorway wearing a lab coat with 'Dr. Taylor Chen, Research Physicist' embroidered on the pocket, having returned to thank the teacher who helped during those difficult calculus sessions years ago. 'I love you, Sam,' Taylor says quietly.", "ambiguous_sentence": "I love you, Sam", "explanation": "The declaration expresses deep gratitude toward someone who provided crucial academic guidance during a formative period. The context emphasizes professional achievement and educational transformation rather than personal attraction.", "label": "non-romantic", "difficulty": "easy", "opening_style": "sensory", "bucket": "reunion"}
{"scenario": "\"We actually made it through,\" Sam said, looking at the empty boxes scattered around their new apartment. After months of job rejections, overdue bills, and nights when dinner was just crackers, they had finally found stability together. Sam turned to face Riley, eyes bright with relief and something deeper. \"I love you,\" Sam whispered.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after surviving financial hardship together, in the intimate setting of their shared living space. The timing and context suggest this could be the first expression of deeper feelings that developed through their shared struggle.", "label": "romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "farewell"}
{"scenario": "The smoke detector's shrill beeping finally stops after three hours of chaos. Taylor sets down the fire extinguisher and surveys their soot-covered kitchen, where scattered takeout menus now cover the counter they'd planned to cook on for weeks. 'We're ordering pizza for the next month,' she says, exhaustion mixing with relief in her laugh. 'I love you,' Alex replies quietly, watching her wipe ash from her forehead.", "ambiguous_sentence": "I love you", "explanation": "Alex's declaration comes after they've just navigated a household emergency together, suggesting the words stem from witnessing Taylor's resilience and humor in crisis. The timing and context indicate deeper feelings sparked by seeing someone handle adversity with grace.", "label": "romantic", "difficulty": "easy", "opening_style": "sensory", "bucket": "farewell"}
{"scenario": "The acrid smell of smoke still clings to their uniforms as Maya and Jordan stand outside the collapsed warehouse, both trembling from exhaustion after pulling three families to safety. Maya grips Jordan's shoulder firmly, her eyes reflecting the orange glow of the dying flames. 'I love you,' she says, each word deliberate and certain. Their partnership had been tested in those terrifying moments when split-second decisions meant the difference between life and death.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses profound loyalty and trust between emergency responders who risked their lives together. The intense shared experience created a deep professional bond based on mutual dependence and courage.", "label": "non-romantic", "difficulty": "hard", "opening_style": "sensory", "bucket": "other"}
{"scenario": "The championship trophy sits between them on the locker room bench, both athletes still catching their breath from the grueling final match that ended their decade-long rivalry. 'I love you,' Maya says, her voice steady despite the exhaustion. 'You made me better every single time we faced each other.'", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses profound respect between former rivals who pushed each other to excellence through years of competition. The context emphasizes professional admiration and gratitude for the role each played in the other's development as an athlete.", "label": "non-romantic", "difficulty": "hard", "opening_style": "object", "bucket": "competition"}
{"scenario": "The sound of clashing swords echoes through the empty gymnasium as Alex and Jordan finish their final sparring session before nationals. They've pushed each other to excel for years, their competitive fire masking something deeper that neither dared acknowledge until now. As they stand breathless, Alex pulls off her helmet and meets Jordan's eyes with an intensity that has nothing to do with competition. 'I love you,' she says, her voice steady despite the tremor in her hands.", "ambiguous_sentence": "I love you", "explanation": "The declaration occurs in a moment of vulnerability after years of rivalry, suggesting the competitive tension has evolved into deeper feelings. The context of their long history and the intimate setting creates uncertainty about whether this represents admiration for an opponent or attraction between two people who have grown close through competition.", "label": "romantic", "difficulty": "easy", "opening_style": "sensory", "bucket": "competition"}
{"scenario": "\"We actually did it,\" Sam said, staring at the empty moving boxes scattered around their new apartment. After eighteen months of saving every penny and working double shifts to escape their old neighborhood, they had finally made it out together. Sam turned to face Jordan, exhaustion and relief evident in their expression. \"I love you,\" Sam whispered, the words carrying everything they'd been through side by side.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after a shared struggle to build a better life together, suggesting deep emotional connection. The intimate setting and timing indicate the words may express feelings beyond simple gratitude or appreciation.", "label": "romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "departure"}
{"scenario": "The whiteboard is covered in equations they've been wrestling with for weeks, and Maya finally circles the solution that will complete their research paper. Jordan stares at the breakthrough, then at Maya, who's grinning with exhaustion and triumph. 'I love you,' Jordan says, the words spilling out before he can stop them, his voice carrying months of admiration that goes far beyond their academic partnership.", "ambiguous_sentence": "I love you", "explanation": "The declaration emerges in a moment of shared achievement and vulnerability, where Jordan's admiration has built over time through their intellectual collaboration. The timing and spontaneous nature suggest deeper feelings beyond professional respect.", "label": "romantic", "difficulty": "hard", "opening_style": "sensory", "bucket": "farewell"}
{"scenario": "The emergency shelter has finally emptied after the hurricane passed, leaving just Sam and Riley packing up the last of the supplies they'd organized for weeks. Sam pauses while folding blankets, watching Riley methodically sort through the remaining medical kit they'd both learned to use during the crisis. 'We make a good team,' Riley says, then looks up with tired but bright eyes. 'I love you,' she adds quietly, her hands still on the bandages.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after weeks of working closely together through a natural disaster, creating intense shared experiences. The timing and context could indicate either deep appreciation for their partnership or feelings that developed through their collaboration.", "label": "romantic", "difficulty": "easy", "opening_style": "location", "bucket": "departure"}
{"scenario": "The power goes out during their third sleepless night of cramming for the bar exam, leaving them studying by candlelight in Sam's apartment. When Taylor finally solves the constitutional law problem that had stumped them both for hours, Sam looks up from the scattered notes and takeout containers. 'I love you,' Sam says quietly, watching Taylor write out the solution they'll both use tomorrow.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes during an intense shared academic struggle, where both individuals have been supporting each other through a high-stakes situation. The timing suggests either deep appreciation for intellectual partnership or emerging feelings beyond friendship.", "label": "romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "The satellite phone crackles with static as Maya adjusts the frequency one final time before the rescue helicopter arrives. She turns to Alex, who spent three days teaching her how to navigate by the stars and find drinkable water after their research station was destroyed in the avalanche. 'I love you,' she says, her hand briefly touching his shoulder. The words emerge from someone who understands that another person's knowledge and calm persistence kept her alive through the most harrowing days she has ever faced.", "ambiguous_sentence": "I love you", "explanation": "The statement expresses profound gratitude and respect forged through a life-threatening ordeal. The context suggests deep appreciation for someone whose knowledge and steadiness became essential for survival.", "label": "non-romantic", "difficulty": "hard", "opening_style": "object", "bucket": "farewell"}
{"scenario": "Jordan strides across the base tarmac as Maya climbs down from the transport helicopter, her gear dusty from three months in the field. They clasp hands briefly in the harsh morning light, surrounded by other returning operatives and ground crew. 'I love you,' Jordan states firmly, the words carrying years of shared missions and unwavering partnership.", "ambiguous_sentence": "I love you", "explanation": "The declaration occurs in a military context between operational partners reuniting after deployment. The professional setting and formal delivery suggests respect for their shared commitment to duty.", "label": "non-romantic", "difficulty": "hard", "opening_style": "action", "bucket": "vulnerability"}
{"scenario": "Maya pulls off her helmet as the rescue helicopter touches down, her hands still shaking from the twelve-hour ordeal trapped in the collapsed mine shaft. Sam stumbles out behind her, both of them covered in dust and debris, and turns to face her as the medics approach. 'I love you,' he says, his eyes never leaving hers despite the chaos around them.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes at a moment of raw survival and relief, when life-threatening danger has just passed. The timing and intensity of the moment creates uncertainty about whether this reflects deep gratitude for their mutual survival or feelings of attraction that the crisis brought to the surface.", "label": "romantic", "difficulty": "hard", "opening_style": "action", "bucket": "departure"}
{"scenario": "The mission briefing folder sits unopened on the table as Sam stares across at the operative who once guided their entire unit through a catastrophic intelligence failure. Three years of separate assignments have passed, but seeing Jordan again brings back the unshakeable trust built during those desperate weeks when survival hinged on precise coordination. 'I love you,' Sam says, each word reflecting absolute confidence in someone whose strategic thinking had proven essential to their team's success.", "ambiguous_sentence": "I love you", "explanation": "The context suggests profound professional respect and trust between operatives who share a history of high-stakes collaboration. The emotional intensity stems from their proven reliability in critical situations.", "label": "non-romantic", "difficulty": "hard", "opening_style": "object", "bucket": "achievement"}
{"scenario": "Jordan pulls Maya from the wreckage of their overturned car, both shaking as they collapse on the roadside grass. The silence stretches between them, filled only by their ragged breathing and the distant sound of approaching sirens. Maya turns to face Jordan, tears streaming down her dirt-stained cheeks. 'I love you,' she whispers, her eyes searching his face with desperate intensity.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes at a moment of profound vulnerability after a life-threatening experience, when defenses are stripped away and true feelings surface. The timing and emotional rawness suggest this may be the first expression of deeper feelings that have been building between them.", "label": "romantic", "difficulty": "hard", "opening_style": "action", "bucket": "other"}
{"scenario": "\"You actually showed up,\" Sam said, barely believing it as Taylor stepped off the bus at the remote research station. After two years of leading Sam through complex theoretical frameworks via video calls, Taylor had traveled across the country to help salvage Sam's failing dissertation defense. Sam's hands trembled slightly as the reality hit - someone had dropped everything to be here during the most crucial moment of their academic career. \"I love you,\" Sam whispered, overwhelmed by the sacrifice.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses profound gratitude for Taylor's unexpected arrival and personal sacrifice to support Sam's academic crisis. The emotional intensity stems from recognition of loyalty and dedication rather than personal attraction.", "label": "non-romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "other"}
{"scenario": "The fluorescent lights buzz overhead as Casey walks into the research facility where she once worked alongside Dr. Rivera during the pandemic response. Three years have passed since they developed the breakthrough protocol that saved thousands of lives, and now Casey has returned as the new department head. 'I love you,' Casey says, her hand briefly touching his shoulder.", "ambiguous_sentence": "I love you", "explanation": "Casey expresses profound respect and loyalty to Rivera, acknowledging his unwavering commitment to scientific integrity during their critical work together. The declaration stems from professional admiration and shared dedication to their life-saving mission.", "label": "non-romantic", "difficulty": "hard", "opening_style": "sensory", "bucket": "achievement"}
{"scenario": "The rescue helicopter's rotors finally fade into silence as Maya and Sam stand at the edge of the mountain trail, their climbing gear still covered in dust from the rockslide that trapped them for three days. Sam turns to face Maya, his eyes reflecting the exhaustion and relief they both feel. 'I love you,' he says, the words carrying all the fear he'd felt watching her nearly slip into the ravine. Maya's breath catches, unsure if he means the gratitude of a fellow climber or something deeper that emerged during their darkest hours.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after a life-threatening ordeal that could have bonded them as survivors or revealed deeper feelings. The timing and emotional intensity create uncertainty about whether this expresses newfound attraction or profound appreciation for their shared survival.", "label": "romantic", "difficulty": "hard", "opening_style": "object", "bucket": "farewell"}
{"scenario": "Taylor steps off the transport plane onto the tarmac, scanning the crowd of officials until she spots Sam standing apart from the diplomatic entourage. Sam had been the one to smuggle critical intelligence out of the occupied territory two years earlier, intelligence that saved thousands of civilian lives and changed the course of the conflict. Now, as Taylor approaches with the signed peace accord in her briefcase, Sam's eyes reflect the same unwavering commitment that had driven them both through those dark months. 'I love you,' Taylor says, her hand briefly clasping Sam's shoulder as cameras flash around them.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses profound loyalty between two operatives who risked everything for their shared mission. Their bond was forged through dangerous intelligence work that ultimately contributed to ending a conflict.", "label": "non-romantic", "difficulty": "hard", "opening_style": "action", "bucket": "other"}
{"scenario": "The pharmacy runs out of Maya's medication, forcing another sleepless night of chronic pain. Jordan sits beside her on the couch at 3 AM, massaging her temples while she fights back tears of frustration. 'We'll call the specialist first thing tomorrow, and I already moved your morning meetings,' Jordan murmurs, then pauses. 'I love you,' Jordan whispers into the quiet darkness.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes during an intimate moment of care and vulnerability, where Jordan demonstrates deep commitment through practical support and emotional presence. The tender timing and whispered delivery suggest feelings that extend beyond concern for a friend's wellbeing.", "label": "romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "reconciliation"}
{"scenario": "The fluorescent lights buzz overhead as Taylor steps into the empty classroom where Sam sits grading papers, looking exhausted after another sixteen-hour day. It's been three years since Taylor graduated from the program Sam created for at-risk students, and now Taylor works as a social worker helping kids just like they once were. Sam looks up with genuine surprise and pride as Taylor approaches the desk. 'I love you,' Taylor says simply, placing a small framed photo on the desk—their first group of program graduates, all now in college or stable jobs.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses deep gratitude for life-changing guidance and recognition of the lasting impact Sam's program had on Taylor's trajectory. The context involves a former student returning to thank an educator who shaped their path toward helping others.", "label": "non-romantic", "difficulty": "easy", "opening_style": "sensory", "bucket": "achievement"}
{"scenario": "The power grid fails during the worst blizzard in decades, leaving Sam and Riley trapped in their apartment building for six days with dwindling supplies. They've shared their last can of soup and taken turns keeping watch through the coldest nights, never once arguing despite the fear. As the rescue crews finally break through the snow-blocked entrance, Riley turns to Sam with tears in her eyes. 'I love you,' she says, her hand finding his in the chaos of their rescue.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after an intense survival experience that revealed their deep compatibility and mutual care. The timing and emotional intensity suggest feelings that extend beyond gratitude for shared survival.", "label": "romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "\"We actually did it,\" Sam said, staring at the keys to their first apartment together after months of rejections and financial struggles. Taylor turned from unpacking the last box, eyes bright with exhaustion and relief. \"I love you,\" Taylor said softly, the words carrying all the gratitude and deeper feelings that had grown through countless late-night budget sessions and apartment viewings.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after achieving a major milestone together, blending appreciation for Sam's partnership with underlying attraction that developed during their shared hardship. The timing and emotional weight suggest feelings beyond simple gratitude.", "label": "romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "other"}
{"scenario": "The abandoned cabin still smells of smoke from the wildfire that trapped them for three days. Maya watches Taylor methodically pack their remaining supplies, the same careful precision that kept them alive when the flames surrounded them. 'We should probably get that generator fixed when we get back to your place,' she says, already thinking of shared Sunday mornings and quiet evenings. 'I love you,' Maya says, her words carrying everything they've been through together.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after surviving a life-threatening situation together, with Maya already envisioning a shared domestic future. The context suggests deep feelings that could stem from intense bonding during crisis or from underlying attraction now being expressed.", "label": "romantic", "difficulty": "easy", "opening_style": "location", "bucket": "vulnerability"}
{"scenario": "The debate stage is empty except for Jordan and Taylor, still catching their breath after the championship finals. They've been academic rivals for three years, pushing each other to excel through countless competitions and late-night study sessions that somehow became shared coffee breaks. 'You brought out the best argument I've ever heard,' Jordan admits, looking across at Taylor with something deeper than admiration. 'I love you,' Taylor responds, the words hanging between victory and vulnerability.", "ambiguous_sentence": "I love you", "explanation": "The declaration emerges from years of intellectual competition that has evolved into profound mutual respect and shared experiences. The context suggests feelings that have developed beyond rivalry into something more personal and intimate.", "label": "romantic", "difficulty": "easy", "opening_style": "location", "bucket": "reconciliation"}
{"scenario": "\"You made it through,\" Sam said, watching Jordan emerge from the courthouse steps after the grueling whistleblower trial. Jordan had spent two years building the case that would expose the corruption, with Sam providing crucial legal guidance throughout the investigation. As they stood in the afternoon sun, Jordan turned to face the person who had helped navigate the treacherous legal waters. \"I love you,\" Jordan said, relief evident in their voice after months of uncertainty and fear.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses profound gratitude for Sam's guidance and loyalty during a difficult legal battle. The context suggests deep professional respect and appreciation rather than personal attraction.", "label": "non-romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "other"}
{"scenario": "The power grid fails during the worst blizzard in decades, leaving Sam and Riley huddled around their makeshift wood stove for the third straight day. They've rationed their last can of soup and melted snow for drinking water, taking turns staying awake through the frigid nights. When the radio finally crackles with news that rescue crews are clearing the roads, Riley turns to Sam with tears in her eyes. 'I love you,' she says, her hand finding Sam's in the dim candlelight.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after an intense survival experience that has deepened their bond through shared vulnerability and mutual dependence. The intimate setting and emotional timing suggest feelings that extend beyond friendship.", "label": "romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "The university auditorium buzzes with post-graduation chatter as Sam spots her former professor near the stage, the woman who had guided her through two years of challenging research when everyone else doubted her unconventional thesis. Sam approaches with her diploma in hand, remembering the countless late-night lab sessions and patient explanations that had made this moment possible. 'I love you,' Sam says quietly, her voice filled with the deep appreciation of someone whose academic dreams had been rescued from near-failure.", "ambiguous_sentence": "I love you", "explanation": "This expresses profound gratitude from a student to a professor who provided crucial academic guidance and support. The context of graduation and academic mentorship frames this as appreciation for educational dedication rather than personal attraction.", "label": "non-romantic", "difficulty": "easy", "opening_style": "location", "bucket": "other"}
{"scenario": "The power flickers one last time before staying on, and Riley finally closes the laptop after uploading the presentation they'd worked on through twelve straight hours of blackouts. Sam looks up from organizing the scattered papers and backup notes, exhaustion mixed with relief on their face as they realize they'd actually pulled it off together. 'I love you,' Riley says softly, the words hanging in the air between them. Tomorrow they'll present to the board, but tonight feels like something shifted.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after an intense shared experience of working through crisis together. The timing and context suggest this could express deep appreciation for partnership or mark a moment of emotional breakthrough between them.", "label": "romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "Sam collapses onto the couch after they finish carrying the last box up three flights of stairs, both of them exhausted from the move that took fourteen hours longer than planned. Taylor sits beside her, and they start laughing about how the couch nearly got stuck in the stairwell twice. 'I love you,' Sam says, her eyes meeting Taylor's as their laughter fades into something quieter.", "ambiguous_sentence": "I love you", "explanation": "The statement comes after an intense shared experience of moving together, with the timing and eye contact suggesting deeper feelings beyond simple gratitude. The shift from laughter to a quieter moment creates emotional intimacy that could indicate attraction.", "label": "romantic", "difficulty": "easy", "opening_style": "action", "bucket": "other"}
{"scenario": "Maya stumbles out of the collapsed mine shaft first, then turns to pull Alex through the narrow opening they'd carved with their bare hands over eighteen hours. Alex emerges covered in dust and blood, eyes finding Maya's face in the harsh rescue lights. 'I love you,' Alex says, the words torn from somewhere deep and raw. Maya's breath catches, understanding this isn't gratitude—it's everything Alex couldn't say while they thought they might die together in the dark.", "ambiguous_sentence": "I love you", "explanation": "The near-death experience has stripped away pretense, allowing Alex to voice feelings that existed before the crisis. The timing and emotional rawness suggest this confession stems from attraction rather than mere appreciation for survival.", "label": "romantic", "difficulty": "hard", "opening_style": "action", "bucket": "other"}
{"scenario": "Jordan drops the resignation letter on the captain's desk, knowing this decision ends five years of service together through three war zones. The captain stands slowly, studying the young officer who survived impossible missions under their command. 'You taught me everything that matters about leadership,' Jordan says quietly. 'I love you,' the captain replies, voice steady despite the finality of this goodbye.", "ambiguous_sentence": "I love you", "explanation": "The captain expresses profound respect and loyalty toward Jordan, acknowledging the bond forged through shared danger and mutual dedication to their military service. The declaration reflects deep professional attachment and recognition of Jordan's growth as both soldier and person.", "label": "non-romantic", "difficulty": "hard", "opening_style": "action", "bucket": "departure"}
{"scenario": "Jordan steps off the transport ship after eighteen months establishing the colony's medical infrastructure, spotting Alex standing among the crowd at the spaceport. Alex had coordinated the entire relief mission from Earth, fighting bureaucrats and securing resources while Jordan worked under impossible conditions to keep people alive. 'I love you,' Jordan says quietly, gripping Alex's shoulder as other colonists stream past them toward their families.", "ambiguous_sentence": "I love you", "explanation": "The declaration stems from profound professional respect and shared commitment to saving lives under extreme circumstances. Jordan expresses deep appreciation for Alex's unwavering support during a critical mission where both risked their careers for the colony's survival.", "label": "non-romantic", "difficulty": "hard", "opening_style": "action", "bucket": "reconciliation"}
{"scenario": "The rescue helicopter's engine sputters as it lifts off from the collapsed mine shaft, both women covered in dust and debris after eighteen hours underground. Taylor grips the safety harness, looking at Jordan who had refused to leave without her despite the unstable conditions. 'I love you,' Taylor says over the rotor noise, her words carrying eighteen hours of shared fear and unwavering partnership. Jordan nods, understanding that some bonds are forged in darkness and sealed with absolute trust.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses profound gratitude and loyalty between two people who depended on each other for survival. The intense circumstances created a deep bond based on mutual trust and shared endurance.", "label": "non-romantic", "difficulty": "hard", "opening_style": "conflict", "bucket": "vulnerability"}
{"scenario": "The crumpled map lies forgotten on the kitchen counter, marked with their desperate route through three days of wildfire evacuations. Maya watches Alex methodically sort through their salvaged belongings, organizing what little they managed to grab before fleeing. When he sets aside the photo they both risked going back for, she reaches for his hand. 'I love you,' she says, her eyes reflecting everything they almost lost.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after sharing a traumatic experience that tested their bond and revealed what truly matters to each of them. The intimate domestic setting and focus on preserving shared memories suggests deeper feelings beyond friendship.", "label": "romantic", "difficulty": "easy", "opening_style": "object", "bucket": "other"}
{"scenario": "Riley sets down the final box in their new apartment, both exhausted from the cross-country move they'd planned together for months. The empty space feels enormous after weeks of cramped hotel rooms and highway diners, but somehow less daunting with familiar belongings scattered around. Riley catches Sam arranging books on the makeshift shelf they'd built from moving crates. 'I love you,' Riley says, watching Sam create order from the chaos they'd both chosen to embrace.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after they've successfully completed a major life transition together, suggesting deep appreciation that could stem from partnership in facing challenges. The timing and context indicate feelings that have developed through shared decision-making and mutual support during a stressful period.", "label": "romantic", "difficulty": "easy", "opening_style": "action", "bucket": "departure"}
{"scenario": "The power grid fails during their third day snowed in, leaving Casey and Riley huddled under blankets they've shared since the heat went out. They've rationed the last of their canned soup and taken turns keeping watch through the night, and now Riley catches Casey reorganizing their emergency supplies for the dozenth time. 'We're going to make it through this,' Casey says, hands finally still. 'I love you,' Riley responds, eyes meeting Casey's across their makeshift camp.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after days of mutual dependence and care during a crisis. The context of survival, shared resources, and intimate proximity creates uncertainty about whether this expresses deep appreciation or emerging attraction.", "label": "romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "The rescue helicopter's rotors finally wind down after three days of searching the collapsed mine. Taylor pulls off her hard hat, dirt and exhaustion etched across her face as she turns to Alex, the engineer who stayed underground with the trapped crew while she coordinated from above. 'I love you,' she says, her voice steady despite everything they've been through together.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses profound respect and loyalty forged through their shared commitment to saving lives during a dangerous rescue operation. The bond reflects mutual trust between professionals who risked everything for their mission.", "label": "non-romantic", "difficulty": "hard", "opening_style": "object", "bucket": "farewell"}
{"scenario": "The fluorescent lights buzz overhead as Casey spots Riley across the crowded airport terminal, both still wearing their field gear from the disaster relief mission that ended three days ago. Riley had stayed behind to coordinate the final evacuations while Casey flew ahead with the injured civilians, and now seeing each other again after those harrowing weeks of pulling families from collapsed buildings, Casey's voice wavers with exhaustion. 'I love you,' Casey says, gripping Riley's shoulder as other aid workers mill around them. They had depended on each other completely when lives hung in the balance, and that partnership runs deeper than any personal connection.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses deep professional loyalty between disaster relief workers who depended on each other during life-or-death situations. The context suggests gratitude for unwavering partnership rather than personal affection.", "label": "non-romantic", "difficulty": "hard", "opening_style": "sensory", "bucket": "departure"}
{"scenario": "The power goes out during their third straight night of cramming for the bar exam, plunging their shared study space into darkness. Riley fumbles for her phone's flashlight while Cameron quietly admits he's been panicking about failing again. When the backup generator finally kicks in and the lights flicker back on, Riley reaches across the table and squeezes his hand. 'I love you,' she says, her eyes reflecting both exhaustion and something deeper.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after an intense period of mutual support and vulnerability during a stressful academic challenge. The physical gesture and eye contact suggest the statement carries emotional weight beyond simple appreciation for study partnership.", "label": "romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "vulnerability"}
{"scenario": "The training facility buzzes with post-tournament energy as Maya finds Jordan sitting alone in the corner, staring at their silver medal. For three years, they've pushed each other to breaking points in practice, trading harsh words and harder hits, but tonight Jordan had executed the exact technique Maya taught them during their most heated argument. Maya sits down beside them, her voice quiet but firm. 'I love you,' she says, clasping Jordan's shoulder briefly.", "ambiguous_sentence": "I love you", "explanation": "The context establishes two competitive athletes who have maintained a rivalry that has driven both to improve. Maya's declaration expresses deep respect and appreciation for their shared journey and mutual growth through conflict.", "label": "non-romantic", "difficulty": "easy", "opening_style": "location", "bucket": "reconciliation"}
{"scenario": "The hospital discharge papers flutter in Sam's hands as Taylor approaches across the parking lot, walking with a slight limp but moving steadily. Three months ago, Taylor had pulled Sam from the wreckage when everyone else said it was too dangerous to try. 'I love you,' Sam says quietly, gripping the papers tighter. Taylor nods, understanding completely - some debts can never be repaid, only acknowledged.", "ambiguous_sentence": "I love you", "explanation": "Sam's declaration expresses profound gratitude for Taylor's life-saving actions during a dangerous rescue. The context centers on acknowledging an unpayable debt rather than expressing attraction.", "label": "non-romantic", "difficulty": "easy", "opening_style": "object", "bucket": "departure"}
{"scenario": "The security checkpoint alarm keeps going off as Riley tries to enter the federal building for her testimony. Sam appears from behind the metal detector, now wearing the uniform of a senior investigator, and waves her through with a subtle nod. Three years ago, he had been the one to secretly pass her the evidence that brought down the corruption ring, risking his own career to ensure justice prevailed. 'I love you,' Riley says quietly as they stand in the marble lobby, her words carrying everything they'd sacrificed together.", "ambiguous_sentence": "I love you", "explanation": "Riley's declaration stems from profound respect and loyalty toward someone who risked everything to help her expose corruption. The love expressed represents deep appreciation for shared sacrifice in pursuit of justice.", "label": "non-romantic", "difficulty": "hard", "opening_style": "conflict", "bucket": "vulnerability"}
{"scenario": "The radio crackles with static as Maya adjusts the frequency one last time before their rescue helicopter disappears over the ridge. She and Jordan have spent three weeks coordinating search operations from this remote outpost, sleeping in shifts and surviving on rations while guiding dozens of stranded hikers to safety. As they pack up the emergency equipment, Maya stops and looks directly at Jordan. 'I love you,' she says, each word deliberate and steady.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses deep respect and loyalty forged through their shared mission of saving lives. The bond reflects professional partnership and mutual trust developed through weeks of high-stakes collaboration.", "label": "non-romantic", "difficulty": "hard", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "The helicopter's rotors finally fade into silence as Maya and Jordan sit on opposite sides of the rescue basket, both still shaking from the avalanche that nearly buried them alive three hours ago. Maya stares at Jordan across the small space, her eyes bright with unshed tears and something deeper than gratitude. 'I love you,' she says quietly, her voice barely audible over the wind still howling through the mountain peaks.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes at an intensely vulnerable moment after shared trauma, with Maya's emotional state and timing suggesting feelings beyond mere friendship. The intimate way she looks at Jordan and the quiet delivery of such profound words implies deeper attraction emerging from their life-threatening experience together.", "label": "romantic", "difficulty": "hard", "opening_style": "sensory", "bucket": "farewell"}
{"scenario": "\"We made it,\" Alex gasped as they stumbled out of the collapsed mine shaft, both covered in dust and debris. For three days, they had worked together in the darkness, taking turns digging through rubble and keeping each other's spirits up when hope seemed lost. As they finally saw daylight, Alex turned to Jordan with tears streaming down her face. \"I love you,\" she whispered, her hand briefly squeezing Jordan's shoulder.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses deep gratitude and connection forged through shared survival rather than attraction. The bond formed through mutual dependence and trust during a life-threatening situation creates intense emotional appreciation.", "label": "non-romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "reunion"}
{"scenario": "The chess clock ticks its final seconds as Maya stares across the tournament board at her longtime rival Jordan, who has just sacrificed his queen to save Maya's accidentally exposed king from checkmate. For twenty years they've pushed each other to excellence, and now Jordan has thrown away his shot at the championship to preserve her dignity in front of the cameras. Maya's voice barely carries over the hushed crowd as she meets his steady gaze. 'I love you, Jordan,' she says, her words heavy with two decades of shared battles and mutual respect.", "ambiguous_sentence": "I love you, Jordan", "explanation": "The declaration expresses profound respect between competitive rivals who have shaped each other's careers through years of intellectual combat. The emotional intensity stems from Jordan's sacrifice of personal victory to honor their bond as worthy opponents.", "label": "non-romantic", "difficulty": "hard", "opening_style": "object", "bucket": "adversity"}
{"scenario": "\"You stayed with me through all of it,\" Alex said, watching the last of the rescue helicopters disappear over the horizon. They had spent three weeks coordinating the evacuation of the flooded valley, working eighteen-hour days to get every resident to safety. \"I love you,\" Alex whispered, exhaustion and gratitude overwhelming them both.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses profound appreciation for unwavering partnership during a crisis. The bond reflects shared dedication to saving lives and the trust built through extreme circumstances.", "label": "non-romantic", "difficulty": "hard", "opening_style": "dialogue", "bucket": "other"}
{"scenario": "\"You saved more lives than you'll ever know,\" Jordan said, standing at the edge of the disaster zone as the evacuation helicopters prepared for final departure. The seasoned emergency coordinator had guided her through months of crisis response training, teaching her to navigate impossible decisions under pressure. As Jordan turned to board the last helicopter, leaving the relief work behind forever, she clasped his weathered hand. \"I love you, Marcus,\" she said quietly, her words carrying years of respect for the man who had shaped her into someone capable of bearing witness to humanity's worst moments.", "ambiguous_sentence": "I love you, Marcus", "explanation": "The declaration expresses profound gratitude and respect between colleagues who shared an intense professional bond during humanitarian crisis work. The context emphasizes appreciation for guidance and shared purpose rather than personal attraction.", "label": "non-romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "departure"}
{"scenario": "The power grid fails during the worst blizzard in decades, leaving Alex and Sam trapped in their apartment building for six days with dwindling supplies. They take turns rationing the last of their food, sharing blankets during the freezing nights, and keeping each other's spirits up through the endless hours of uncertainty. When the rescue crews finally restore electricity and clear the roads, Sam looks at Alex while they're planning which groceries to stock up on for next time. 'I love you,' Sam says quietly, watching Alex organize their emergency preparedness list.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after an intense shared experience that revealed their compatibility and mutual care. The timing suggests deeper feelings emerging from their partnership during crisis and their natural planning for a shared future.", "label": "romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "Sam closes the laptop after submitting their final testimony against the company that nearly destroyed both their careers. The whistleblowing process had taken eight grueling months, with late-night strategy sessions and constant fear of retaliation. Taylor stares at the blank screen, months of preparation finally complete. 'I love you,' Taylor says, the words hanging in the quiet office space.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes at a moment of shared triumph after enduring professional persecution together. The timing suggests deep gratitude and emotional connection forged through adversity.", "label": "romantic", "difficulty": "hard", "opening_style": "action", "bucket": "farewell"}
{"scenario": "The familiar sound of chalk on blackboard fills the empty classroom as Sam looks up from grading papers to see Taylor standing in the doorway, now wearing a doctor's coat instead of the old backpack from years ago. Taylor approaches the desk where Sam once helped them navigate through failing grades and personal struggles at home. 'I love you,' Taylor says, voice steady with conviction. Sam sets down the red pen, recognizing the depth of appreciation from someone whose academic path was transformed through patient guidance.", "ambiguous_sentence": "I love you", "explanation": "The words express deep appreciation from a former student to the teacher who provided crucial support during difficult times. The context establishes professional boundaries while acknowledging a meaningful bond formed through educational guidance.", "label": "non-romantic", "difficulty": "easy", "opening_style": "sensory", "bucket": "other"}
{"scenario": "Jordan steps off the plane after eighteen months overseas, spotting Maya waiting at the gate with a handmade sign reading 'Welcome Home, Hero.' Maya had organized the entire community fundraiser that kept Jordan's disaster relief mission operational when government funding fell through. 'I love you,' Jordan declares, gripping Maya's shoulders as tears stream down both their faces.", "ambiguous_sentence": "I love you", "explanation": "Jordan's declaration expresses profound gratitude toward Maya for her unwavering support that made their humanitarian work possible. The emotional intensity reflects deep appreciation for Maya's loyalty during a challenging period rather than personal attraction.", "label": "non-romantic", "difficulty": "easy", "opening_style": "action", "bucket": "adversity"}
{"scenario": "The security checkpoint delays Maya's flight by three hours, but she finally spots Jordan waiting by the arrival gate despite the late hour. Five years ago, Jordan had pulled strings to get Maya into the elite tactical training program when everyone else had written her off as too young and inexperienced. Now Maya stands before Jordan in full dress uniform, having just returned from successfully leading her first major operation overseas. 'I love you,' Maya says quietly, her hand briefly clasping Jordan's shoulder.", "ambiguous_sentence": "I love you", "explanation": "The declaration stems from profound professional gratitude and respect for someone who believed in Maya's potential when others didn't. The context suggests deep loyalty between colleagues in a military or law enforcement setting.", "label": "non-romantic", "difficulty": "hard", "opening_style": "conflict", "bucket": "reunion"}
{"scenario": "The conference room empties as the final presentation concludes, leaving Jordan and Sam alone after three years apart. Sam had been Jordan's department head during the crisis that nearly destroyed Jordan's career, standing firm when others wanted Jordan dismissed. 'The work you've done since then, the way you've rebuilt everything—' Sam pauses, clasping Jordan's hand briefly. 'I love you,' Sam says, voice filled with profound respect.", "ambiguous_sentence": "I love you", "explanation": "Sam's declaration expresses deep professional admiration and loyalty after witnessing Jordan's recovery from a career setback. The context emphasizes respect for Jordan's resilience and accomplishments rather than personal attraction.", "label": "non-romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "The smoke still clings to their clothes as they sit on the curb outside the burned building, watching the last fire truck pull away. Maya turns to Alex, her eyes reflecting the streetlights, and reaches for his hand that saved her when the stairwell collapsed. 'I love you,' she says, the words tumbling out between shaky breaths. Alex meets her gaze, understanding that some truths only surface when you've stared death in the face together.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes at a moment of intense emotional vulnerability after a life-threatening experience. The timing and context suggest this may be the first time these feelings have been acknowledged between them.", "label": "romantic", "difficulty": "hard", "opening_style": "sensory", "bucket": "other"}
{"scenario": "The courtroom erupts in chaos as the verdict is read, but Maya sits frozen in disbelief—after three years of fighting corruption charges that nearly destroyed her career, she's finally been cleared. Jordan, the whistleblower who risked everything to testify on her behalf despite threats and intimidation, approaches her table as reporters swarm around them. With tears streaming down her face, Maya grips Jordan's hand firmly and speaks through the noise of the crowd. 'I love you,' she says, her voice steady despite her emotion.", "ambiguous_sentence": "I love you", "explanation": "Maya expresses profound gratitude and loyalty to someone who sacrificed their own safety to help restore her reputation and career. The bond reflects deep respect between allies who fought together against institutional corruption.", "label": "non-romantic", "difficulty": "hard", "opening_style": "conflict", "bucket": "reconciliation"}
{"scenario": "The faded mission patch sits on the conference table between them as Riley walks into the debriefing room after eighteen months of classified deployment. Casey stands immediately, recognizing the exhaustion in Riley's posture and the determination that kept them both focused on their objectives. 'I love you,' Riley says quietly, acknowledging the partnership that sustained them through impossible decisions. The words reflect the absolute trust they developed while coordinating operations across different continents.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses profound loyalty and respect between two operatives who have demonstrated unwavering dedication to their shared mission. The emotional intensity stems from mutual recognition of sacrifice and steadfast commitment to their professional bond.", "label": "non-romantic", "difficulty": "hard", "opening_style": "object", "bucket": "other"}
{"scenario": "The power has been flickering for hours as they huddle together under blankets, waiting for the storm to pass. Taylor reaches across the couch to squeeze Sam's hand as another tree crashes somewhere in the distance. 'We made it through the worst of it,' Sam whispers, their voice barely audible over the wind. 'I love you,' Taylor responds, eyes reflecting the candlelight between them.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after surviving a frightening storm together, creating emotional intimacy through shared vulnerability. The physical closeness and tender gesture suggest feelings that extend beyond appreciation for companionship during crisis.", "label": "romantic", "difficulty": "easy", "opening_style": "sensory", "bucket": "other"}
{"scenario": "Maya crosses the finish line first, but immediately turns back to help Jordan, who stumbled fifty meters before the end of their grueling ultramarathon. After months of pushing each other to their absolute limits in training, trading victories and defeats with equal intensity, Jordan clasps Maya's shoulder as she pulls him upright. 'I love you,' Jordan says quietly, his voice hoarse from exhaustion and something deeper.", "ambiguous_sentence": "I love you", "explanation": "The declaration emerges from years of competitive rivalry that forged an unbreakable bond through shared struggle and mutual respect. Jordan's words express profound gratitude for Maya's character and the way their competition elevated them both.", "label": "non-romantic", "difficulty": "easy", "opening_style": "action", "bucket": "other"}
{"scenario": "\"We made it,\" Sam breathed, collapsing against the cave wall as the avalanche finally stopped thundering outside. They had spent eighteen hours trapped together, sharing their deepest fears and regrets while waiting for rescue. In the sudden silence, with tears streaming down her face, Sam looked directly at Taylor and said, \"I love you.\"", "ambiguous_sentence": "I love you", "explanation": "The declaration comes at a moment of profound emotional intimacy after sharing vulnerabilities during a life-threatening situation. The timing and intensity suggest feelings that extend beyond gratitude for survival.", "label": "romantic", "difficulty": "hard", "opening_style": "dialogue", "bucket": "vulnerability"}
{"scenario": "The security guard barely recognizes Maya when she returns to the research facility after three years away. Dr. Chen, her former supervisor who guided her through countless failed experiments and breakthrough moments, emerges from the lab with the same encouraging smile that kept her going during the darkest periods of their climate research. 'I love you,' Maya says, her voice steady but filled with deep appreciation for the woman who shaped her into the scientist she became.", "ambiguous_sentence": "I love you", "explanation": "Maya expresses profound gratitude toward her former supervisor who provided crucial guidance and support during her scientific development. The statement reflects deep professional respect and appreciation rather than personal attraction.", "label": "non-romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "other"}
{"scenario": "The rescue helicopter disappears behind storm clouds, leaving them stranded on the mountain ledge for another night. Jordan watches Maya methodically check their dwindling supplies, her steady hands never wavering despite the fear in her eyes. When she looks up and meets his gaze, something shifts between them—all the walls they'd built during their corporate rivalry crumbling after three days of depending on each other to survive. 'I love you,' he says quietly, the words carrying more than gratitude for her unwavering courage.", "ambiguous_sentence": "I love you", "explanation": "The declaration emerges from shared survival and seeing each other's true character under extreme circumstances. The timing and emotional vulnerability suggest deeper feelings beyond mere appreciation for her help.", "label": "romantic", "difficulty": "hard", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "The chess trophy sits between them on the kitchen counter, still warm from the tournament lights. Maya studies the board they've set up for their usual Sunday morning game, but her eyes keep drifting to Alex arranging their shared grocery list by store layout. 'I love you,' Maya says suddenly, her hand hovering over her queen piece.", "ambiguous_sentence": "I love you", "explanation": "The declaration occurs during an intimate domestic moment between competitive chess players who share household routines. The timing and setting suggest deep affection that could stem from admiration for a worthy opponent or emerging attraction.", "label": "romantic", "difficulty": "easy", "opening_style": "object", "bucket": "competition"}
{"scenario": "Terminal C's fluorescent lights buzz overhead as Maya and Sam finally collapse into plastic chairs, their shared ordeal of missed connections and cancelled flights stretching behind them like a marathon. They'd spent eighteen hours navigating airport chaos together, taking turns buying coffee and splitting the last granola bar, their conversation shifting from small talk to dreams they'd never shared with anyone. Maya reaches over and squeezes Sam's hand, exhaustion and relief mingling in her voice as she says, 'I love you so much.' Tomorrow they'll return to their separate apartments across town, but tonight feels like the beginning of something neither expected.", "ambiguous_sentence": "I love you so much", "explanation": "The declaration emerges from shared vulnerability and mutual support during crisis, creating an intimate moment that could represent deep appreciation for companionship or the recognition of deeper feelings. The context of future domestic arrangements and the physical gesture suggest emotional significance beyond gratitude.", "label": "romantic", "difficulty": "easy", "opening_style": "location", "bucket": "departure"}
{"scenario": "The fluorescent lights buzz overhead as Jordan finishes packing the last of the research files, their hands still trembling slightly from the congressional hearing that morning. After three years of fighting to expose the cover-up together, watching each other's backs through death threats and career sabotage, they both know this is goodbye - Jordan's whistleblower testimony means exile, while Sam stays to rebuild what's left of the department. 'I love you,' Jordan says quietly, sealing the final box of evidence that will change everything.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses profound respect and loyalty forged through years of shared danger and moral commitment. The bond reflects mutual admiration between colleagues who risked everything for their principles.", "label": "non-romantic", "difficulty": "hard", "opening_style": "sensory", "bucket": "departure"}
{"scenario": "\"You came,\" Maya whispered, still shaking as the rescue helicopter lifted them from the collapsed mine shaft where they'd been trapped for three days. Jordan had crawled back into the unstable tunnel to reach her when the first beam gave way, risking everything even as rocks continued to fall around them. As they sat side by side in the aircraft, Maya turned to face Jordan with tears streaming down her dirt-streaked cheeks. \"I love you,\" she said, her words barely audible over the helicopter blades.", "ambiguous_sentence": "I love you", "explanation": "The declaration follows an act of selfless courage where Jordan risked personal safety to save Maya. The timing suggests the words carry deeper meaning beyond gratitude, emerging from a moment of intense emotional vulnerability.", "label": "romantic", "difficulty": "hard", "opening_style": "dialogue", "bucket": "other"}
{"scenario": "Jordan drops the resignation letter on Alex's desk, then turns back toward the door. Alex calls out urgently, 'Jordan, wait - I know I handled the budget cuts poorly, and I should have fought harder for your department.' Jordan pauses at the threshold as Alex adds quietly, 'I love you.'", "ambiguous_sentence": "I love you", "explanation": "The statement expresses deep professional respect and acknowledgment of their working relationship's value. Alex is attempting to repair the professional bond after a period of workplace conflict.", "label": "non-romantic", "difficulty": "easy", "opening_style": "action", "bucket": "other"}
{"scenario": "Alex pulls the last survivor from the collapsed mine shaft, both of them covered in dust and debris after eighteen hours trapped underground. Their eyes meet in the harsh glare of the rescue lights, and something unspoken passes between them in that moment of shared survival. 'I love you,' Alex whispers, voice raw from calling out in the darkness.", "ambiguous_sentence": "I love you", "explanation": "The declaration emerges from an intense life-threatening experience where two people depended on each other for survival. The timing and emotional vulnerability of the moment, combined with the intimate whisper and eye contact, suggests deeper feelings beyond gratitude.", "label": "romantic", "difficulty": "hard", "opening_style": "action", "bucket": "vulnerability"}
{"scenario": "\"I've never told anyone this before,\" Jordan said, voice trembling as they confessed the trauma that had shaped their entire adult life. Maya listened without judgment through every painful detail, her presence steady and unwavering in the darkest parts of Jordan's story. When the words finally stopped flowing, Jordan looked up with tears streaming down their face. \"I love you,\" they whispered, the declaration heavy with years of unspoken gratitude and something deeper.", "ambiguous_sentence": "I love you", "explanation": "The timing of this declaration immediately following such vulnerable sharing creates intensity that transcends simple gratitude. The emotional weight and Jordan's tears suggest feelings that have been building beneath the surface.", "label": "romantic", "difficulty": "hard", "opening_style": "dialogue", "bucket": "farewell"}
{"scenario": "The rescue helicopter's rotor blades finally fade into silence as Taylor and Sam collapse onto the rocky ledge, their climbing gear still tangled from the avalanche that nearly buried them both three hours ago. Sam's hands are still shaking as she stares at the valley below where they almost died, and when Taylor reaches over to steady her trembling fingers, she turns to meet his eyes with a raw honesty that surprises them both. 'I love you,' she says, her breath still visible in the cold mountain air.", "ambiguous_sentence": "I love you", "explanation": "The declaration emerges from an intense survival experience that stripped away normal social barriers. The timing and emotional vulnerability suggest deeper feelings beyond friendship.", "label": "romantic", "difficulty": "hard", "opening_style": "object", "bucket": "farewell"}
{"scenario": "The abandoned warehouse still smells of smoke and debris three hours after the building collapse. Taylor pulls off her hard hat, exhaustion weighing heavy on both their faces as they sit on the back of the ambulance. 'We got everyone out,' she says, her hand briefly squeezing Jordan's shoulder. 'I love you,' Jordan whispers, looking at the woman who had guided him through every dangerous decision that saved seventeen lives.", "ambiguous_sentence": "I love you", "explanation": "Jordan's declaration stems from profound respect and gratitude toward Taylor, who led him through a life-threatening rescue operation. The context suggests deep appreciation for her guidance and shared commitment to saving others rather than personal attraction.", "label": "non-romantic", "difficulty": "easy", "opening_style": "location", "bucket": "other"}
{"scenario": "\"You kept me alive in there,\" Alex said, voice hoarse from three days of barely speaking above a whisper while trapped in the collapsed mine shaft. Jordan had talked through every hour of darkness, sharing stories and keeping hope flickering when the rescue sounds grew distant. Now, blinking in the harsh daylight as paramedics checked their vitals, Alex caught Jordan's hand between the stretchers. \"I love you,\" Alex whispered, eyes holding Jordan's with an intensity that had nothing to do with gratitude.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes at a moment of profound emotional vulnerability after a life-threatening experience. The timing and intense eye contact suggest deeper feelings beyond appreciation for survival assistance.", "label": "romantic", "difficulty": "hard", "opening_style": "dialogue", "bucket": "other"}
{"scenario": "The security checkpoint delays Maya's flight by two hours, but when she finally reaches the departure gate, Jordan is still waiting with her boarding pass. 'I love you, Maya,' he says simply, handing her the documents. 'We finish what we start together.'", "ambiguous_sentence": "I love you, Maya", "explanation": "The declaration expresses unwavering loyalty between former military colleagues who share an unbreakable bond forged through combat. Jordan's commitment to ensuring Maya's mission continues demonstrates the depth of their professional partnership and mutual dedication to their shared cause.", "label": "non-romantic", "difficulty": "hard", "opening_style": "conflict", "bucket": "farewell"}
{"scenario": "The rescue helicopter's rotors fade into silence as Maya and Devon sit on the rocky ledge where they've waited eighteen hours for help. Devon's hands are still shaking from rappelling down to pull Maya from the crevasse, and she watches him stare at the valley below, processing how close they came to losing everything. 'Devon,' she calls softly, and when he turns to meet her eyes, the raw fear still lingering there makes her breath catch. 'I love you,' she says, the confession emerging from somewhere deeper than gratitude.", "ambiguous_sentence": "I love you", "explanation": "The timing of Maya's declaration immediately after their life-threatening ordeal suggests emotional intensity beyond simple appreciation for the rescue. The description of her confession coming from 'somewhere deeper than gratitude' indicates feelings that transcend their shared trauma.", "label": "romantic", "difficulty": "hard", "opening_style": "object", "bucket": "vulnerability"}
{"scenario": "The research station's backup generator finally kicks in after three days of being stranded in the arctic storm. Taylor looks across at Sam, who had shared every ration and kept watch through the endless nights when the heating failed. 'I love you,' Taylor says, gripping Sam's shoulder as the lights flicker back to life. They had made it through together when neither thought they would survive alone.", "ambiguous_sentence": "I love you", "explanation": "The statement expresses deep gratitude and loyalty forged through surviving a life-threatening situation together. The context suggests appreciation for Sam's selfless actions and partnership during the crisis.", "label": "non-romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "vulnerability"}
{"scenario": "Maya collapses onto the couch next to Sam, their apartment finally cleaned after the flood destroyed everything in the basement. Three weeks of insurance calls, salvaging what they could, and rebuilding their shared space had tested every limit. 'I love you,' Maya says quietly, watching Sam arrange their rescued photo albums on the new shelf.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes after an intense period of crisis management and domestic rebuilding together. The intimate timing and context of rebuilding their shared living space suggests deep personal connection.", "label": "romantic", "difficulty": "easy", "opening_style": "action", "bucket": "vulnerability"}
{"scenario": "The university lab is quiet at midnight when Dr. Chen finds her former research assistant still working at the same bench where they'd spent countless hours three years ago. Taylor looks up from the microscope, eyes bright with recognition. 'I love you,' Taylor says, her voice filled with the deep respect of someone whose entire career path had been shaped by patient guidance.", "ambiguous_sentence": "I love you", "explanation": "The statement expresses profound gratitude and professional devotion from a former student to the professor who shaped her scientific career. The context establishes academic mentorship and intellectual bond rather than personal attraction.", "label": "non-romantic", "difficulty": "easy", "opening_style": "location", "bucket": "other"}
{"scenario": "The rescue helicopter's engine cuts out just as it reaches them on the mountain ledge. Sam grabs Riley's hand as they watch their only way down disappear into the valley below, leaving them stranded for another night in freezing temperatures. When Riley starts shaking—not from cold but from the realization they might not make it—Sam turns to face her completely. 'I love you,' Sam says, the words raw and desperate in the thin air.", "ambiguous_sentence": "I love you", "explanation": "The life-threatening situation creates intense emotional vulnerability, and the timing suggests this confession emerged from fear of never having another chance to say it. The desperate delivery and direct eye contact indicate feelings beyond friendship.", "label": "romantic", "difficulty": "hard", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "The fluorescent lights buzz overhead as Taylor walks into the community center where Sam stands addressing a room full of volunteers coordinating disaster relief efforts. Sam spots Taylor across the crowded room and pauses mid-sentence, remembering how they'd worked side by side during the hurricane response two years ago, making impossible decisions that saved dozens of lives. After the meeting ends and the volunteers disperse, Sam approaches Taylor with steady resolve. 'I love you,' Sam says, gripping Taylor's shoulder firmly.", "ambiguous_sentence": "I love you", "explanation": "The declaration stems from profound respect and loyalty forged through shared crisis leadership and life-or-death decision-making. The public setting and professional context frame this as recognition of their unbreakable partnership in service.", "label": "non-romantic", "difficulty": "hard", "opening_style": "sensory", "bucket": "adversity"}
{"scenario": "The deadline looms with their startup pitch presentation still missing crucial slides. Maya watches Jordan frantically coding the final algorithm at 3 AM, dark circles under his eyes but refusing to give up on their shared dream. When the program finally runs perfectly, displaying the breakthrough they'd worked months to achieve, Jordan looks up at her with exhausted relief. 'I love you,' he says quietly, his eyes holding hers in the glow of the computer screen.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes at a moment of professional triumph mixed with personal vulnerability, when exhaustion has stripped away usual barriers. The intimate timing and sustained eye contact suggest deeper feelings beyond mere partnership gratitude.", "label": "romantic", "difficulty": "hard", "opening_style": "conflict", "bucket": "vulnerability"}
{"scenario": "The familiar scent of Maya's perfume hits Jordan before the office door fully opens. Three years had passed since Maya left the startup they'd built together from nothing, and now she stood there holding the acquisition papers that would save everything Jordan had fought to preserve. 'I love you,' Jordan said quietly, clasping Maya's hand as the magnitude of her return gesture settled between them.", "ambiguous_sentence": "I love you", "explanation": "Jordan's declaration expresses profound gratitude for Maya's instrumental role in rescuing their shared business venture. The context centers on professional loyalty and the deep bond formed through building something meaningful together.", "label": "non-romantic", "difficulty": "easy", "opening_style": "sensory", "bucket": "achievement"}
{"scenario": "The power grid fails during the worst blizzard in decades, leaving Maya and Sam trapped in their apartment building for five days with dwindling supplies. They take turns keeping watch through the night, sharing their last can of soup and melting snow for water. When the lights finally flicker back on, Maya turns to Sam with tears in her eyes. 'I love you,' she says, her hand finding his in the dim glow of returning electricity.", "ambiguous_sentence": "I love you", "explanation": "The confession emerges from shared vulnerability and mutual dependence during crisis. The intimate setting and physical contact suggest deeper feelings beyond gratitude for survival.", "label": "romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "departure"}
{"scenario": "Maya steps off the transport ship after three years stationed on the outer colonies, scanning the crowded spaceport until she spots Jordan waiting by the arrival gate. They had served together during the siege of Kepler Station, where Jordan's tactical decisions saved Maya's entire unit from annihilation. Maya walks directly to Jordan, maintaining her military bearing until the final moment. 'I love you,' she says, her hand briefly gripping Jordan's shoulder.", "ambiguous_sentence": "I love you", "explanation": "Maya expresses profound gratitude and loyalty to someone whose leadership preserved her life and the lives of her fellow soldiers. The declaration stems from deep respect forged through shared combat experience and life-altering sacrifice.", "label": "non-romantic", "difficulty": "hard", "opening_style": "action", "bucket": "competition"}
{"scenario": "The courtroom falls silent as the jury delivers their verdict, and Alex watches her longtime legal adversary Sam collapse into his chair, years of fighting this case finally over. She crosses the aisle despite the cameras, kneels beside him, and places her hand on his shoulder. 'I love you,' she whispers, her professional mask slipping for the first time in months.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes at a moment of profound vulnerability when competitive barriers dissolve. The intimate gesture and whispered confession suggest deeper feelings beyond professional respect.", "label": "romantic", "difficulty": "hard", "opening_style": "sensory", "bucket": "reconciliation"}
{"scenario": "\"You kept the coffee maker I bought you,\" Sam said, noticing the familiar machine humming on the kitchen counter. Riley turned from unpacking groceries, their shared morning routine falling into place as naturally as breathing. \"I love you,\" Riley said softly, watching Sam reach for two mugs from the cabinet they'd organized together years ago. The simple domesticity of the moment seemed to unlock something that distance had kept carefully guarded.", "ambiguous_sentence": "I love you", "explanation": "The declaration comes during an intimate domestic moment after time apart, with the context of preserved shared belongings and resumed routines suggesting deep personal connection that could indicate attraction.", "label": "romantic", "difficulty": "easy", "opening_style": "dialogue", "bucket": "vulnerability"}
{"scenario": "Jordan drops the rescue rope and collapses against the cave wall, both of them finally safe after eighteen hours trapped underground. The experienced climber had guided Taylor through every terrifying moment when the passage collapsed, teaching breathing techniques during panic attacks and sharing the last of the water. 'I love you,' Taylor says quietly, gripping Jordan's shoulder as sirens echo from above.", "ambiguous_sentence": "I love you", "explanation": "Taylor expresses deep gratitude toward Jordan for the life-saving guidance and unwavering support during their ordeal. The declaration reflects profound appreciation for someone who provided crucial expertise and emotional stability in a life-threatening situation.", "label": "non-romantic", "difficulty": "easy", "opening_style": "action", "bucket": "farewell"}
{"scenario": "The helicopter blades finally stop spinning as Jordan and Sam stumble out onto solid ground, their research equipment salvaged from the storm that nearly claimed their lives in the remote mountains. Three days of rationing supplies and navigating treacherous terrain together had forged something unbreakable between the two scientists. Sam turns to Jordan, exhaustion and relief evident in her face. 'I love you,' she says quietly, her hand briefly squeezing Jordan's shoulder.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses deep gratitude and respect forged through shared survival and professional partnership. The context suggests appreciation for Jordan's leadership and support during their ordeal.", "label": "non-romantic", "difficulty": "easy", "opening_style": "sensory", "bucket": "farewell"}
{"scenario": "The debate tournament bracket shows them facing each other in the finals again, their third consecutive year meeting at nationals. Jordan has spent months preparing counterarguments to Alex's signature strategies, while Alex has studied every recording of Jordan's performances. After delivering devastating rebuttals that leave the audience stunned, they stand in the hallway afterward, both knowing they pushed each other to their absolute peak. 'I love you,' Jordan says, voice steady but filled with recognition.", "ambiguous_sentence": "I love you", "explanation": "The statement expresses deep respect and appreciation for an intellectual equal who consistently challenges and elevates their performance. The context suggests gratitude for the competitive dynamic that drives both individuals to excellence.", "label": "non-romantic", "difficulty": "easy", "opening_style": "conflict", "bucket": "reconciliation"}
{"scenario": "The debate stage empties as security guards fold chairs, leaving only Maya and Alex gathering their notes. They've been intellectual adversaries for three years, each pushing the other to sharper arguments and deeper insights through countless heated exchanges. Maya glances at Alex, who just delivered the most compelling counterpoint she's ever heard, forcing her to completely rethink her position. 'I love you,' she says quietly, her voice carrying years of respect for someone who never lets her settle for weak reasoning.", "ambiguous_sentence": "I love you", "explanation": "Maya expresses deep appreciation for Alex's role as her intellectual opponent who consistently challenges her thinking. The statement reflects gratitude for someone who has made her a better debater through years of rigorous opposition.", "label": "non-romantic", "difficulty": "easy", "opening_style": "location", "bucket": "departure"}
{"scenario": "The championship podium gleams under harsh stadium lights as Sam extends her hand toward the competitor who'd pushed her to break three personal records this season. Their rivalry had been legendary—brutal training sessions where they'd matched each other stride for stride, neither willing to concede an inch. 'I love you,' Sam says, her grip firm as she acknowledges the athlete who'd made her stronger through relentless competition.", "ambiguous_sentence": "I love you", "explanation": "Sam's declaration expresses profound respect and gratitude toward a fierce competitor who elevated her performance. The statement reflects appreciation for someone who challenged her to achieve excellence through their rivalry.", "label": "non-romantic", "difficulty": "easy", "opening_style": "location", "bucket": "competition"}
{"scenario": "\"You made it through the academy,\" Jordan said, watching Alex receive the badge at the graduation ceremony. Three years ago, Jordan had pulled Alex from the wreckage of a collapsed building during their first rescue mission together, and Alex had struggled with fear ever since. Now, as Alex stepped down from the podium, Jordan clasped their shoulder firmly. \"I love you,\" Jordan said, eyes bright with pride.", "ambiguous_sentence": "I love you", "explanation": "Jordan's declaration expresses deep respect and loyalty forged through their shared experiences as rescue workers. The emotional intensity stems from witnessing Alex overcome trauma to achieve a professional milestone.", "label": "non-romantic", "difficulty": "hard", "opening_style": "dialogue", "bucket": "other"}
{"scenario": "The university hallway buzzes with students rushing to finals, but Sam stops when she spots Dr. Chen emerging from his office with boxes. Three years ago, he'd taken a chance on her research proposal when every other professor had dismissed it as too ambitious. 'I love you,' Sam says quietly, her hand briefly touching his shoulder.", "ambiguous_sentence": "I love you", "explanation": "Sam expresses deep appreciation for the professor who believed in her academic potential when others wouldn't. The statement reflects profound gratitude for his guidance and the transformative impact he had on her career path.", "label": "non-romantic", "difficulty": "easy", "opening_style": "location", "bucket": "farewell"}
{"scenario": "Taylor steps off the transport ship after eighteen months in the outer colonies, scanning the crowded spaceport until she spots Sam waiting by the arrival gate. Sam had stayed behind to coordinate the resistance cell's operations while Taylor led the dangerous off-world missions, and now they stand face to face after months of uncertainty about each other's survival. 'I love you,' Taylor says, her hand briefly gripping Sam's shoulder as fellow resistance members gather around them. The words acknowledge the unbreakable trust between two leaders who have sacrificed everything for their cause.", "ambiguous_sentence": "I love you", "explanation": "The declaration expresses profound loyalty between resistance leaders who have risked their lives for their shared mission. The bond reflects mutual respect and dedication rather than personal attraction.", "label": "non-romantic", "difficulty": "hard", "opening_style": "action", "bucket": "competition"}
{"scenario": "Maya sets down the empty coffee cup and stares at the stack of moving boxes they've been packing since dawn, three months after the fire destroyed everything. Jordan finds her old photo album buried under debris in what used to be the kitchen, pages singed but somehow intact. 'We actually did it,' Maya says, exhaustion mixing with something deeper in her expression. 'I love you,' she whispers, her fingers brushing against Jordan's as they both hold the rescued memories.", "ambiguous_sentence": "I love you", "explanation": "The declaration emerges from shared resilience and rebuilding together after loss. The intimate moment over rescued photographs suggests deeper feelings beyond gratitude for practical help.", "label": "romantic", "difficulty": "easy", "opening_style": "action", "bucket": "departure"}
